{"pages":[{"title":"欢迎大家来我的博客玩","text":"关于我 渊鸢，亲近的朋友叫我圆圆，号铁锅。又名圆铁锅(Round Iron Pot)，域名里的rip就是这么来的。 lofter叫否的白日梦，存放乙女短打。叫我否也行。 专业是光学工程，方向是做高能光纤激光器，已经顺利研究生毕业。短暂的程序员经历，学的C++，写了几个月的C，想试试写python/scala/java这些，也可能只是说说。 这个博客能成功搭起来主要要感谢我们的好政委我的好老师我的情妹妹矩阵良以及b站的up主codesheep。博客搭建步骤大家可以看codesheep的视频，我也会总结笔记放在博客里，希望能够帮到大家XD。 博客标题ZINMZALABIM是来自RedVelvet迷你六辑《’The ReVe Festival’ Day 1》的主打歌，但是在这个博客主题里它好像只会出现在地址栏。对了这首歌并不好听，这个标题主要是取无意义咒语的意象。 普通的阿宅，但是自从博客搭建以来还没有完整的产出所以好像不配说自己是个写字的。所以大家当我是小画家吧！ 本博可能会有的内容 生活：流水账式日记、游记、面基记录。这个大概会占很大一部分哈哈哈哈。 专业：看网课的笔记或者某些碎片知识整理。机器学习、大数据、网络转发模型和算法都会写点，也可能会试着讲讲自己做的研究生课题，还有考教师资格和专利代理资格的知识点等等。 同人：自己写的同人小说（别问为啥现在没有，问就是在写呢），旧文整理太难了暂时不准备往这里搬运，不过也说不定哪天想起来了就（。 灵魂：我不死心我就是要做小画家要做美工要做博客前端UI设计！ 翻译：人有梦就会了不起。原耽/同人翻译，主要是为了练习语言所以大概会很烂。 我喜爱的作品真的很多 爬墙飞快所以只是随便列举一些 FGO：显然是我最爱的作品了！最爱的当然是咕哒？！不过已经很久没有打啦……很爱旧剑很爱闪闪但是一直有心无力哈哈哈哈 JOJO： 最爱四部！！！仗助是我的心肝宝贝！！！ 赤红灯火妖魅行： 近期让我体会到爱情的作品，黑狐和由是真的！！！恨我不会画画！我好喜欢老狐狸！！ 强风吹拂：三浦老师真的很厉害，买了日文原作但是快一年过去了我才啃完第一章我是个垃圾。 少女歌剧： 女孩子们唱歌真的很好！！！我爱momoyo！舞台少女真的是闪光的！ 攻壳机动队：我爱塔奇克马一辈子（咦？？ Psycho-Pass：我的理想男友和理想女友类型分别是狡啮慎也和常守朱，哪怕过了这么多年，爬了这么多墙头依然如此，然后我希望他们能够在一起。 刀剑乱舞：一定要去永青文库看一眼，就算我爬墙了我也依然—— Star Trek：live long and prosper。 Adventure Time：在夹机占为LSP和BMO的包包一掷千金，然后这包挂毛了我最贵的一条裙子，我还能说什么呢？LSP值得。","link":"/about/index.html"}],"posts":[{"title":"cp25流水账","text":"今年下雨真是太不便了我哭声响彻天际 precp24的约定：1. cp25出剑三团；2. cp25摆摊；3. 出一次团片 虽然伦宝确定cp25没法到场，但是仪式感还是要有，该买衣服还是要买。 但是的确这半年发生了不少事情，十四在前一周才确定真的来不了，我也是搞了很久最后day2都没确定能出个啥。不过早知道有jo迪可以蹦我一定带上休妹套装加上小皮草又暖和又可以玩嘤嘤嘤。 也就是在前一两天的时候才得知民宿整改，我们得重新定地方住…… day 0很早出发，和弟弟吃了一顿花里胡哨但口味一般的日料……半夜又点了开封菜吃。 试了一下花萝的头饰要怎么搞，真的……好复杂……我假毛买短了，但大佬家的毛真的便宜好用非常nice！！！ day 1day 1下雨了！！！好冷啊！！！ 但是我穿戴好出门的时候一点没觉着冷（。 虽然五点半起床，没吃早饭也没穿羽绒服，却仅凭斗志就在上海的寒风里活了下来，并且没有感冒。我体内的免疫细胞们是真的有在好好工作啊。 一早过去最先见到的是暗暗，真的是偶遇！真的太巧了哈哈哈哈哈。到摊位上的时候是枳子宝宝在看摊，把我超级重的包塞了过去。后来又绕了一圈看到了政委，恰了蒸饺。 接下来见到的应该是瓜瓜，帮这个瓜拿了个包我就又跑了。只记得是个非常魁梧的男子（咦？ 忘了啥时候见到云木弟弟的了总之云木弟弟是跟女朋友一起的，都是小可爱。 马老师表演了一个徒手画由，鹿鹿表演了一个当场被圈粉，我，我表演了当场撒泼飞升成仙（。 下午有剑三游场……是真的……好冷啊！！！！而且人太多了合照根本看不到头。不过认识了很多讲话很有意思的小妹妹，虽然最后也没加联系方式但是洒家在寒风中无怨无悔。 九九拍了鹿鹿的小视频可爱极，有一说一，精髓是道长翻白眼。 晚上恰了美蛙鱼头！蛙好吃鸭血好吃鸭肠好吃虾滑好吃！弟弟调的油碟味道很好。 夜里又点了水果捞和烧烤然后还跟伦伦宝激情视频裸聊总之真的很快乐。 day 2赞美羽绒服，羽绒服真暖和！ day2是买的普通游客票，鹿仔踏上孤独的vip之路以后告诉我我们day1走错路了……我多花了vip的钱却走了普票的路，我不服qaq 今天我们记得吃早饭了我吃了个包子。 鹿仔本次作为唯一一个酒肉和尚迷倒了一片妹妹，而我，作为普通游客收获了一堆本子。柯总的旧剑真的太下饭了我为了靓仔痴狂， 我真的完美错过好多人，反正我去摊子上的时候大家就都不在，我跑开见别人/买东西了大家就在摊位上了？？？ 最后总算在摊位上多呆了会儿见到了湘鹅（并在三两句之间就约好了年前湘鹅来宁见我和马鹅（高唱wow观摩马老师飞速画画 真的，马老师的茸茸太绝了！！！！我吹一万遍！！！！！ after好像也没啥可说的了，下一届的计划从剑三到魔圆到藕霸到JO到FGO都还没决定，但是申摊已经是必然了本咕咕在线保证一定至少出一个本！","link":"/2019/12/23/cp25流水账/"},{"title":"2020第二季度","text":"消失的几个月我去哪里了。 三月搬家新家大概是去年年底交付的，因为之前一波糟心事就在啥也没装好的情况下先搬进来了，总之精装房居住体验也还好。 四月重新成为了社畜呢通勤路漫漫……但是目前公司的办公节奏就很适合。该不加班就不加班，快乐就是如此简单。 六月报了钢琴课小区里有钢琴老师，索性就报名上课了，关于买真钢还是电钢，之前我还很笃定要电钢，查了一通资料又觉得真钢也很好看，好在贫穷让我理智……目前啥也没买，之后就算买也肯定是电钢啦。 持续不断的装修目前还差不少，但是前期比较紧急的窗帘和封阳台已经搞好了。 装柜子真的很麻烦，尤其是自己没有心理预期的时候……到底装在哪里装成什么样子都完全没有草稿，整墙书柜的方案想搞实木的现在也买不起。衣柜内部设计更是头痛没有思路啊吧啊吧。 目前比较烦恼的是主卧的窗帘，非常普通非常普通非常普通的浅灰配粉色的丝绒。买的时候只有客厅和次卧是想好了要什么样子的，主卧就临时决定，然后果然，非常平平无奇。也许搞成灰色玻璃的衣柜会有一点呼应？ 原本构想的阳台方案彻底放弃，但是好在阳台只要绿植多就不会丑到哪里去。 烘焙/厨艺进修中已经成功烤出了古早蛋糕，靴靴。关于厨艺，目前已经有了几道拿手菜了（指的是不难吃/可以吃） CP屁都没写 前段时间lofter出事我终于记起来把所有文章都存到了本地。然后发现不是开车就是黑历史，怎么回事我的黄色审美一直没变吗？ 还有什么计划一直想要学搭网站学这学那，结果一有时间就发现自己在一边吨吨吨一边看电影…… 总之新PC一定要的，投影仪一定要的，今年双十一一定要买这俩。电钢琴留到十二月买吧。然后一月云鲸二月？？？ipad pro就明年三月（咦？","link":"/2020/06/21/2020/"},{"title":"CPP作者认证","text":"陆续搬文中，最后再试一次不行就算了………………审核的老师爱我一次。 https://www.allcpp.cn/u/112239.do","link":"/2020/07/06/cpp认证/"},{"title":"Sybil Seely","text":"写在前面翻译和魔改一些片段，八卦一下小海豹美人的生平，原文是极乐亭老师发过的BK粉八卦Sybil Travilla的文章，地址是这个：基顿最迷人的女主角 主要目的是发我跟tks老师约的漂亮小人图！新的头像也是tks老师送我的呜呜呜真是太可爱了。 总之先发图 然后开始八卦嘿嘿如果你文巴斯特基顿的粉丝们，谁是他们最喜欢的女主角，那么很大可能是他们会立刻回答西碧尔·希利。迷人、自然、优雅的棕发女郎（brunette ingénue）仅仅在基顿的五部短片中出现，但从那以后就一直给观众留下了清新的印象。 尽管有那么多的赞誉，人们对她还是知之甚少。这个年轻女人究竟是谁，是怎么样偶然参与进了有史以来最伟大的短篇喜剧中的呢？ 她是个加利福利亚女孩，原名Sybil Travilla，出生于1900年1月2日（2o世纪的第二天哈哈）。她的父亲名叫Harry Richard Travilla，母亲是Lucie Travilla，有法国、英国和苏格兰血统。Sybil在七个孩子里排行倒数第二，剩下六个是 Edith, Guy, Jack, Ford, Elaine and Connie. 他们一家住在洛杉矶地区，大部分时候在圣贝纳迪诺（San Bernardino），他们还曾在卡塔琳娜岛（Catalina Island）短暂居住，这座小岛后来被认为是好莱坞精英的游乐场。出生在宾夕法尼亚州的Harry Travilla是一名商人，当地一家报纸称他为“我们有一段时间以来遇到的最有绅士风度的人之一”。他在不同的时期经营过旅馆、做过一家名为“办公室”的酒馆老板也当过轮胎经销商。 Sybil有三个兄弟，都是游泳冠军，参加过卡塔琳娜的许多比赛。绰号“人类U型船”的Jack一度保持了在水下游128码9英寸的纪录，而Ford曾经在水下屏住呼吸4分35秒。Guy成了加州最好的特技跳水运动员之一。他们的事迹在远至匹兹堡的报纸上都受到赞扬。 从1912年到1917年，兄弟们决定利用自己的才华组合出道，组合名就叫Travilla Brothers，出道干的主要是杂技和动物表演……他们在一个巨大的舞台上跟一只名叫Winks的训练有素的海豹一起表演特技，广告很有时代特色，叫“The Seal With The Human Brain”。他们最有名的特技是在水下跟Winks一起吃饭，还能边吃边眨眼，然后他们靠着这个爆点1913年在欧洲很多地方巡演了一轮。后来，兄弟中的一个和他的妻子重启了这个企划并更新为“特拉维拉女孩和海豹”，尽管这个表演只持续了几年。1917年，三兄弟都登记参加了第一次世界大战征兵，尽管那时杰克已经残疾，而他将于1925年去世。 advertise post newspaper photo 据推测，Winks the seal可能是Sybil选择“Seely”（在各种出版物中偶尔拼写为“Sealey”）作为艺名的灵感来源。她的兄弟们的经历是否激发了基顿在The Playhouse里创造一个年轻女子在坦克里表演特技的场景的灵感呢？ 特拉维拉兄弟的成功无疑对他们的家庭很重要。他们的父亲Harry于1905年去世，葬在加州格兰代尔的森林草坪公墓。Sybil决定投身于蓬勃发展的电影业，可能部分是为了帮助她丧偶的母亲，也许她也希望能养活自己。她在1910年代中期加入了麦克·森内特工作室，作为一个备选和额外成员（再更早期她是否有过参演经历还没人知道）。她的第一个角色是短片《Her Nature Dance》，该片于1916年底开始拍摄，1917年4月8日上映。她扮演了几个致力于“希腊户外舞蹈”的舞蹈女孩之一，穿着一件轻薄的“希腊式”服装。 1917年她参演了《Secrets of a Beauty Parlor》，1918年没有，也有可能她出演了现在已经失传的电影。她通常被认为是“Sibye Trevilla”（发音为“Sibie”）。她也是麦克·森内特著名的游泳美女之一，考虑到她的家庭背景，这是很合适的（人们可能会认为她也是一个有才华的游泳运动员）。","link":"/2020/08/01/Sybil-Travilla/"},{"title":"git新手使用手册","text":"简易手册，新手友好，不求理解，只求能用。如有错误请帮忙提出。 git下载和设置密钥git上传下载，修改上传文件 git pull platform master git切换到分支 git checkout -b branch_1 origin/branch_1 //由远程分支创建本地跟踪分支 大文件上传 git lfs track filename git status git add filename git commit –amend git push -f origin branch_1 //强推 解决冲突下载公共仓，本地提示错误后通过conflict和beyond compare修改。 查看历史提交并回退版本 git loggit reset –hard commitnumber 回退自己的修改 git revert 暂存 git stashgit pull platformgit stash poprm -rf //删除git push -f origin branch_1 //强推 创建分支： $ git branch mybranch切换分支： $ git checkout mybranch创建并切换分支： $ git checkout -b mybranch更新master主线上的东西到该分支上：$git rebase master切换到master分支：$git checkout master更新mybranch分支上的东西到master上：$git rebase mybranch提交：git commit -a对最近一次commit的进行修改：git commit -a –amendcommit之后，如果想撤销最近一次提交(即退回到上一次版本)并本地保留代码：git reset HEAD^合并分支：(merge from) $ git checkout master$ git merge mybranch (merge from mybranch)删除分支： $ git branch -d mybranch强制删除分支： $ git branch -D mybranch列出所有分支： $ git branch查看各个分支最后一次提交： $ git branch -v查看哪些分支合并入当前分支： $ git branch –merged查看哪些分支未合并入当前分支： $ git branch –no-merged更新远程库到本地： $ git fetch origin推送分支： $ git push origin mybranch取远程分支合并到本地： $ git merge origin/mybranch取远程分支并分化一个新分支： $ git checkout -b mybranch origin/mybranch删除远程分支：$ git push origin :mybranchrebase: $ git checkout mybranch$ git rebase master (rebase from master)举例： $ git checkout server$ git rebase –onto master server client$ git checkout master$ git merge client (fostforward)$ git rebase master server (checkout sever)$ git merge server$ git branch -d client$ git branch -d server","link":"/2019/11/10/git新手使用手册/"},{"title":"linux常用指令集合","text":"简陋，并且随时增加 赋予权限 chmod 777 ./* -R VIM :w //save:wq //save&amp;quit:q! //强退不保存zz //有修改save&amp;quit；无修改退出:w filename //另存为:r filename //将filename文件内容读到光标处 gg //文档第一行 远程传输 scp root@ip地址:/usr1/code/……/target空格./ 压缩和解压缩 zip -r filename ./ //压缩到当前文件夹zip -r filename 正则表达式搜索文件内容 grep -rn “xxxx” //r表示递归，n表示行号 tips 执行.sh文件时看一下，是否可以改成j8或者j24，使用多线程提高编译速度。","link":"/2019/11/11/linux常用指令集合/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/04/11/hello-world/"},{"title":"sql学习增删改查","text":"基础学习笔记，跟着w3school的教程 如果之后找到了更系统的教学视频也可能会跟着视频看 sql不区分大小写sql不一定要求每条之后都包括分号SQL DML 和 DDL 可以把 SQL 分为两个部分：数据操作语言 (DML) 和 数据定义语言 (DDL) SQL (结构化查询语言)是用于执行查询的语法。但是 SQL 语言也包含用于更新、插入和删除记录的语法。 查询和更新指令构成了 SQL 的 DML 部分： SELECT - 从数据库表中获取数据 UPDATE - 更新数据库表中的数据 DELETE - 从数据库表中删除数据 INSERT INTO - 向数据库表中插入数据 SQL 的数据定义语言 (DDL) 部分使我们有能力创建或删除表格。我们也可以定义索引（键），规定表之间的链接，以及施加表间的约束。 SQL 中最重要的 DDL 语句: CREATE DATABASE - 创建新数据库 ALTER DATABASE - 修改数据库 CREATE TABLE - 创建新表 ALTER TABLE - 变更（改变）数据库表 DROP TABLE - 删除表 CREATE INDEX - 创建索引（搜索键） DROP INDEX - 删除索引 引号的使用请注意，我们在例子中的条件值周围使用的是单引号。 SQL 使用单引号来环绕文本值（大部分数据库系统也接受双引号）。如果是数值，请不要使用引号。 sql 基础SELECT用于选择。关键词 DISTINCT 用于返回唯一不同的值。 WHERE 子句用于规定选择的标准。 AND 和 OR 运算符用于基于一个以上的条件对记录进行过滤。 ORDER BY 语句用于对结果集进行排序，默认按照升序，如果您希望按照降序对记录进行排序，可以使用 DESC 关键字。 12345678910111213141516171819202122SELECT 列名称 FROM 表名称 //选取某一列SELECT * FROM 表名称 //'*'指代选取所有列SELECT DISTINCT 列名称 FROM 表名称 //希望仅仅列出不同（distinct）的值SELECT 列名称 FROM 表名称 WHERE 列 运算符 值 //如需有条件地从表中选取数据，可将 WHERE 子句添加到 SELECT 语句SELECT * FROM Persons WHERE City='Beijing'SELECT * FROM Persons WHERE FirstName='Thomas' AND LastName='Carter'SELECT * FROM Persons WHERE firstname='Thomas' OR lastname='Carter'SELECT * FROM Persons WHERE (FirstName='Thomas' OR FirstName='William')AND LastName='Carter'SELECT Company, OrderNumber FROM Orders ORDER BY Company //以字母顺序显示公司名称SELECT Company, OrderNumber FROM Orders ORDER BY Company DESC //以逆字母顺序显示公司名称SELECT Company, OrderNumber FROM Orders ORDER BY Company, OrderNumber //以字母顺序显示公司名称（Company），并以数字顺序显示顺序号（OrderNumber） INSERT INTO 语句用于向表格中插入新的行。123INSERT INTO 表名称 VALUES (值1, 值2,....)INSERT INTO table_name (列1, 列2,...) VALUES (值1, 值2,....) //指定所要插入数据的列 Update 语句用于修改表中的数据。123UPDATE 表名称 SET 列名称 = 新值 WHERE 列名称 = 某值UPDATE Person SET FirstName = 'Fred' WHERE LastName = 'Wilson' DELETE 语句用于删除表中的行。1234567DELETE FROM 表名称 WHERE 列名称 = 值DELETE FROM Person WHERE LastName = 'Wilson' //删除wilson所在行DELETE FROM table_name //可以在不删除表的情况下删除所有的行。这意味着表的结构、属性和索引都是完整的DELETE * FROM table_name //同上","link":"/2019/11/29/sql学习增删改查/"},{"title":"linux考卷","text":"一张简单考卷和答案 今日考卷题选择 执行命令chmod 746 file.txt该文件的权限是？ r：4 w：2 c：1 rwc_r–_rw- 需要找出/etc/my.conf文件属于哪个包（package）可以执行？ 新用户创建主目录时自动复制的文件目录是？ /etc/ 在bash中，在一条命令后加入“1&gt;&amp;2”意味着？ 哪个命令可以压缩部分文件？ tar- 定义bash环境的用户文件是？ 具有很多C语言功能，又称过滤器的是？ 取ls -l输出结果的第5列的值的正确写法是？ shell程序里，判断文件不存在的写法是？ 填空 linux系统中，以文件方式访问设备。 linux系统有根分区和交换分区两种分区类型。 DNS实际上是分布在Inernet上的主机信息的数据库，其作用是实现IP和主机名之间的转换。 文件权限为d-rw-_r—_r—，用数值形式表示该权限，则该八进制数为：644，该文件属性是655。 vi编辑器有命令和文本输入两种工作模式。 进程和程序的区别在于其动态性，动态的产生和终止，从产生到终止进程可以具有的基本状态为：运行态、就绪态和阻塞态。 硬链接只能建立对文件链接，软链接即符号链接可以跨越不同文件系统。 手工方法配置网络时，可以通过修改/etc/hostname文件来修改主机名，如果要配置计算机的域名解析客户端，需要配置/etc/reslov.conf文件 9.可以用ls -al命令来观察文件的权限，每个文件的权限都用10位表示，并分为4段，其中第一段占1位，表示文件类型，第二段占3位，表示文件所有者对该文件的权限。 问答 linux系统优化的一些步骤。 写一个脚本，脚本名dellog.sh，脚本放在/data/scripts目录下，要求是清理目录/data/logs下的7天前的以.log结尾的文件。创建定时任务，每天凌晨1点30执行。","link":"/2019/11/11/linux/"},{"title":"总之不要忘了记录","text":"四年一遇的日期 趁着还没到零点留个记录 AO3被墙了 虽然说之前就因为老福特越来越糟心搞了这个，实际上这个更多还是把这个博客当草稿本和日记本来用。 在微博上基本上不开麦，连立场都不再表示了。有时候会觉得自己是不是已经活成了一个互联网幽灵，和每一个账号都一模一样，使用的修辞和语法都如出一辙。 但起码还有一点点想说话的欲望。 那么我还会继续写的。","link":"/2020/02/29/jilu/"},{"title":"九月的平稳","text":"难以置信 九月过得如此快 早在一个半月前就提了离职的我，（被）拖拖拉拉到现在还在干着，就算知道是为了背部门考评C，却也还是没有有效的办法就这么离开。好在现在白天基本上无所事事，有了非常多的时间可以跟朋友聊天摸鱼——不过我的朋友们是在正常上班，也有这么多时间，真是奇怪极了。 生日收到了很多人的祝福和礼物，非常快乐。想到如今我还是一事无成甚至没有找到自己喜欢的东西又觉得人生很难。怎么就还在温饱线上挣扎着呢…… 报名了教师资格证的考试，希望起码过掉一门……让我能继续考着。最好是过两门啦可是背书愈发难了。 终——于打完了灯的黑狐长线，我大概得缓缓才能打其他几个结局。在阿良的暴力催促下，获得了近期的食粮和工作动力。虽然没办法像其他人那么疯，顶多就是说一些虎狼之言，但是灯真是一部非常合我胃口的，是能让人由衷赞叹狐狸真是太好了的作品。 灯吾和秋良线实在是工具人莫得感情，嵯峨野线大概是ptsd抱团治疗互相扶持，只有狐狐线是真的（信我。","link":"/2019/09/24/九月的平稳/"},{"title":"七月份的尾巴","text":"凉风有信 2019.07.22 23:17爸妈的过度反应仍旧让我非常意外。 对我自己来说，身体检查的结果大概就是“不太好，但是好像也没什么所谓”的程度，反正一直以来也知道自己的身体没那么好。也没什么自己可能会如何如何的实感。 这几天持续跟我强调不行就辞职回家，也在积极地问我辞职手续如何办理。 比起之前的“不要抱怨，要好好工作”，态度实在是转了一百八十度大弯。 总归是有理由九点钟回家，然后做一点自己想做的事情了。 不过九点下班九点半到家十点半洗完澡真正能做事的时间也没多少 按照爸妈的理论，十点半就该睡了，睁眼到现在都是不应该 2019.07.23 22:28今天被主管拉着谈话中提到“我发现你最近开始主动加班了，终于融入了工作氛围。” 之前被我故意忽视的弦外之音被挑明了。 但是随即我就回复说到最近一段时间为了准备身体检查还是要早走…… 尴尬的气氛真是绝了（。 2019.07.24 21:46今天六点早回家。 跟妙妙煲了个电话粥又跟爸妈联系了一通回来就八点半了。 神秘极了。 对未来的规划多种多样，最重要的还是现在开始继续学习想学的东西。 相比研究生时期，零碎时间少了许多，但独自一人一个房间让我能够轻松快乐做自己。 在大学呆了六七年也没适应自习室文化，发愁。 2019.07.25 22:49今天好像没什么事情发生。 要说的话就是：跑不掉真让人烦躁。 认真地考虑做代课教师了（bushi 干到你j忍无可忍想辞退我的那天，然后快乐辞职回家做乡村教师好了。 2019.08.04 16:18又是艰难加班的一周 昨天经历了非常好笑的约会，真的……太好笑了，男孩子没有女朋友真的都是有原因的。 不过我自己没有男朋友也很理所当然。也没啥好感慨别人的。 夹机占的娃娃真好看！！AT子母包是真的爽！","link":"/2019/07/23/七月份的尾巴/"},{"title":"光影","text":"写在前面被lofter屏蔽了以后我就删了，具体的完成时间已经不记得了……总之随便写了个年份，希望有机会能出狡朱本。 光A面1234567整理硬盘发现了许久以前写的PP同人。虽然想了一个剧情但是没有写清楚也没有写完……有很多地方看着蛮别扭的但是懒得改了。总之扔过来存着。 ​ 我大概永远也忘不了2106年11月6日这个日期了。 一直以来，父亲都作为一个合格的“家主”出现在家中，即使他被曝涉嫌贪污，被怀疑犯罪指数造假，他也一直都表现得自信而权威。 现在回想起来，那段时间家里的气氛的确已经很不对了，父亲呆在家里的时间越来越多，母亲迷上了神经舒缓类的药物，尽管我提出过大剂量使用会造成严重的后果，但是母亲只是笑着把我赶出家门：“妈妈知道分寸的，别担心，老年人也想尝试一下新鲜的事物嘛。” 最后一次关于家的记忆在那个日期的两个、或者三个星期以前，母亲在厨房做早餐，父亲坐在餐桌边看书，我刚刚睡醒，还没从前一天晚上的线下聚会中回过神来。 “在学校一切都好？”他抬眼从书本上方看我：“如果不能保证全优，就好好考虑一下结婚的事情吧。” 那个时候，我研究脑部视神经义体化可能性的课题进行的很不顺利，满心满眼都是如何证明自己的能力，连和他多说一句话都嫌浪费时间，更何况他还提出了这样让人不能忍受的提议。 “知道了。”我勉强喝完了牛奶就拎着包出门了，打定主意不做完课题就不从实验室出来，省的被老头子烦。 我没有在实验室待到课题结束。我的实验课题再也没有结束的可能。 2106年11月6日，父亲的遗体雕塑在高级料理店的前厅被发现。头盖骨被切开，大脑全被挖空，代表记忆的海马体被塞在了肛门里。 母亲在接到通知的当时就被发现犯罪指数超标直接被执行了死亡。 而我，进了医疗所。 我的观看父亲生前收到攻讦时的影响资料的要求被驳回，对父亲死亡的案件的发展进程也一无所知。因为这一切，都有可能加重我的“病情”。 我被隔离在世界之外，成为了某个可以随时销毁的垃圾，直到死，都屈辱而无力。 “色相有变化，变为暗紫色。”伴随着机械的判定声的，是麻醉剂。医护人员在门外说着安抚性的话，然而我像咸鱼一样躺在地上，什么也听不见。 狡啮来探视我，告诉我可以成为执行官的时候，我迅速的答应了。 “连思考都不需要吗？还以为说服你需要花点时间呢。”他笑了一下，点上了香烟。 “我还以为我的状态会很容易判断，像我这样，根本没有治愈的可能性了吧？刑警先生，不用旁敲侧击让我考虑配合治疗了。” “只是有点可惜，加入公安局之后，你的学业大概就没有完成的可能性了。希伯来系统的资料中显示，你对学业的看重可是非同——” “刑警先生，我想你的资料并不完全，我对学业的看重只是来源于家庭的压力，”我顿了一下，看着他的眼睛，就好像我说所说的的确就是真实的理由：“但是现在我的家庭已经不再存在了。” 狡啮撇开头对着旁边吐了一口烟圈，“抱歉，提起了这样的话题。” “没关系，本来刑警先生就是想试探一下我嘛。和父母关系并不密切，可犯罪指数却迟迟没有恢复。”我换了个坐姿。 “对不起——但是你想错了，我并没有所谓试探一下的打算。另外，你父亲的案件至今为止依然没有得到解决，从你租赁的清单上来看，你对此非常执着，我想，这大概就是你没有恢复的理由。” “猜到了，否则不会判定为会加深我的色相的。这次将我列为执行官候选人，也就是说案件有了新发展吗？” “没错。详细情况到公安局后会有分析员来告诉你。” 我成了公安局的执行官。 负责“在监视官的监督下对犯罪系数过高的潜在犯罪者进行犯罪解读、预测以及解决”。用更容易理解的语言来描述，就只是脖子上套着缰绳、靠嗅觉捕猎同类的猎犬而已。 当然，上述两种概括都不是我的想法。对我来说，成为执行官只是我参与父亲死亡案件的手段。我再也不可能回归所谓正常人的社会了，而我也不可能适应完全脱离社会的生活，我清楚地知道这一点，所以，这里是最合适我的地方。 “生物塑化技术早在1993年就应用在了人体上，到如今依旧是解剖研究的重要方法。单考虑药剂的话……”我泛泛的说着一些介绍，早在看到唐之杜学姐的时候我就陷入了迷惑，如果说我能够以非正常的方式从矫正所回归是得益于我曾经的生命科学研究，那么在比我优秀的多的唐之杜学姐已经参与了这件案件的情况下，我的加入又有什么意义呢，不客气一点说，以我现在这样不够理智的状态，甚至会起到反效果。 “由佳里，你在想什么呢？”唐之杜学姐敲了敲我的头：“见到我傻了吗？今天的报告根本不像是你的水准啊。” 学姐像往常一样明艳动人，甚至比她在学校的时候更多了成熟的丰韵。 “我还以为不会有机会再见面了呢，由佳里。而且，如果真的不会再见面就好了啊。” “前辈……” “嗯。你父亲去世的案件是我们组负责的，很抱歉，至今都还没能处理好。”担心这种情绪几乎要从学姐漂亮的眼睛里满溢出来。 “不，这和前辈没有关系——”我慌张的想要想要说些什么，但是话刚出口就忍不住咬断自己的舌头。 旁边的大叔走过来，拜托我帮他递材料给刑事科二系。 我慌慌张张的对着唐之杜学姐道了声抱歉就跑掉了，留下学姐在我背后，欲言又止。 真是糟透了。 唐之杜学姐在校时无疑是整个院系的太阳。成绩优异、还拥有美貌，后援会一向处于爆满状态。我无疑是那些仰慕者之一，但是我比很多人要幸运的多，我被选中作为助手之一参与了学姐的实验课题。 2105年她毕业的时候，很多人都在猜测她会选择什么样的职业，作为自己的参考或者是目标，我也不例外。当我得知她选择到东京医学校进行继续教育的时候，我并没有太过惊讶——在课题进行中，唐之杜学姐就透露过这样的意向。 她6月进入矫正所的消息传到我们学校的时候掀起了一阵狂热的议论，群体压力指数都上升了一个等级，没人愿意相信她会堕落成潜在犯。更何况她才离开这里三个月，在这里时，她一直都表现得和我们中的任何人都没有区别…… 执行官在不出勤时工作任务并不繁重，第一天的工作我适应良好，除了总是会想到唐之杜学姐。我冲了个澡，开始对着房间列需要邮购的必要生活用品。 执行官的宿舍比学校宿舍还要大一些，而且可以完全按我自己的爱好来进行三维全息投影的装扮。这算是执行官较于普通的潜在犯来说为数不多的福利了。 尽管如此，我一直依赖着的网络社交算是全毁了。我叹了口气，将自己整个人摔进床里。 “潜在犯的虚拟形象与网络连接是犯法的。”刚出医疗所，狡啮就这样告诫我。 “嗯，我知道。”在足利的日子里我快被逼疯了，唯一的社交只有和医师的常规性对话，举目望去只有死寂一样的白。 狡啮顿了一下，眼神有点复杂的看向我：“你应该清楚，即使成为了执行官，你仍然是个潜在犯，所以……” 我知道，没错，我仍然是个潜在犯。“终于能够活着走出了足利隔离治疗所”这件事情让我久久无法回归平静。在之前我和狡啮的对话中，我知道我显得饱有攻击性，而我平日里并不是这样的，多数人对我的评价只是“有点可爱，就是普通的女子大学生的样子”，比起“凶暴傲慢”要好得多，也不会让人连组织正常对话的都需要斟酌。 “嗯，我知道了……谢谢。” 狡啮显然有点疑惑于我态度的转变，但是他很快就放弃了对于我心理的揣测。 过了在我看来很久的几分钟，我还是没有忍住，小声的询问：“呐……不能以虚拟形象登入，那么实名进入或者只浏览信息而不进行回复交流呢？” “呃，到目前为止，我没有见到有执行官如此执着的钻这个空子，发展一些不需要借助网络的爱好怎么样？” “这样……” “我试着像上级打个报告为你争取机会吧——别抱太大希望。”狡啮是个十足的绅士，在我张牙舞爪的时候他选择避开我的锋芒，而现在，他又主动替我谋求福利。 我想我该为我的潜在犯生活多点信心，即使我已经被划分为这个世界的少数派、危险分子，我依然有享受生活的权利不是吗？ 车窗外是个晴天，全息投影尽心尽职，到处都是精致的、澄净的、亮丽的。拟真花园里繁花盛开，你甚至在车里都能感受到那浓烈的生命的色彩。你明知道触及的一切都是虚假，可是他们又那么真实，让你忍不住去相信，这是最好的时代。 车按照设定好的路线缓缓驶入公安大楼。 这是个好的开始。我这么告诉自己。 光B面1pp同人，顺手过来存个文。 ​ 在很长一段时间里，出外勤对我来说是很有趣的放风。 车窗也被铁栏杆封闭起来的装甲车像是被捆缚住的巨大野兽，我们——执行官依次爬进它的肚子里去，像是小孩子滑稽的探险。 平时做的事情也和闹着玩没什么区别，毕竟希伯来系统的存在的确使得我们的生活几乎犹如理想乡。的确会有人想要将心中的恶念付诸于行动，可那些生活上的鸡毛蒜皮却都不足以支撑他们对警察进行强力的抵抗，往往他们在看到披着柯米莎三维外观的我们的同时就会直接全盘认输。 我们简直像是睡前故事里的假面英雄。 我被自己的想法逗的不行，冲着对面的佐佐山咧嘴直笑。 佐佐山拉着一张脸，腿伸的很向前，手指不自觉得在座椅上哒哒的敲着。我猜他大概是临上车前才掐灭了点燃没抽两口的香烟。现在依旧处于“瘾君子”的状态里出不来。 “笑什么笑，要不是因为你太没用也不用我还要多出来这一次。”佐佐山狠狠的耙了一把自己的头发：“所以说像你们这种小妞都是怎么进的刑事科啊……” 这次出现区域心理指数上升的是一个还算漂亮的街心花园。警车停在了花园边上一个不为人所注意的角落。佐佐山已经缓过来一点儿了，他抢先披上了柯米莎的外形搜查起来，看起来一点儿也不希望我“拖后腿”。 色相浑浊的毫无疑问是那个正面对着投影广告的小女孩。她显然是陷入了某种不太好的情绪中以至于宁可任由自己的色相浑浊也要对那块广告做出什么——基于她大概无法对广告牌里出现的艺人造成什么真实的伤害。 原因也许是她的小男友说了什么伤人的话？或者是那个艺人成名前曾与她有过什么关系成名后因为怕色相浑浊而离开了她？ 谁管这些。 我们只要让她安静下来去好好做个治疗。 “您好，可以请你配合一下做一下色相检查吗？”柯米莎·佐佐山笑着一边说话一边单手捞过了想要逃开的姑娘。 “请不要害怕，只是检查一下哦。”我看了看显示屏上跳动着的数字：“森林绿，都已经浑浊成这个样子了吗？请放松身体，安心接受治疗……” 小女孩惊慌失措，几乎哭成了一个泪人，佐佐山有点受不了，硬把她塞给了我让我带去警车上。自己跃跃欲试的想在街心花园里多溜达几圈。 狡啮没有制止他这样的行为，自己也穿上柯米莎投影跟在佐佐山后面玩儿了起来。 异变就是这个时候发生的。 起先只是他们闻到了刺鼻的味道，循着源头找过去才发现，味道是源自投影广告。 投影已经由刚刚的“就要美美的！就要洁白的！”的牙膏广告变成了希伯来系统的推广广告。随着广告的播放，刺鼻的味道却越来越浓郁。 “酒精？”狡啮皱起了眉。示意佐佐山小心。 倏然间，不知从何处窜起了小团火苗，在酒精的助燃下愈演愈烈。 投影被破坏了。露出了只经过粗略粉刷的平台，和在其上的，被残忍杀害的少女。 “我真的什么都不知道！”那个在投影前驻足的小女孩成了唯一的线索被带往公安局接受调查。轮番的审讯让她崩溃的大哭起来，犯罪指数直线上升。 办公室的气氛空前的凝重。第一时间直面尸体的狡啮和佐佐山都没有接受心理治疗，反而竭尽全力的调查现场、分析数据、寻找蛛丝马迹。烟蒂堆积了几个烟灰缸。 被杀害的少女是牙膏广告的主角，一个经过希伯来系统认证的艺人。她最为人所著称的就是她“天然的”简直能治愈一切的甜美的笑容。在这个人体机械化如此容易的年代，太多的艺人选择了整形来维持自己美好的容颜，有这样一个纯天然的美人简直太不容易了。 凶手显然不相信这一点，然而令人遗憾的是，他猜对了——这个姑娘的全副牙齿都经过了义体化。于是他为了告知全世界这一点，他将少女的下颔部的皮肤组织剥除，完整的展示了少女的整张牙床。少女的身体赤裸着摆出了她在自己的新广告中的造型，然而原本美丽的笑容已经变得阴森可怖。 这绝对是个噩梦，和噩梦的重现。 “这起事件中同样使用了塑化剂。经过分析对比之后得出的结论是，它和一年前的标本事件使用的塑化剂完全一样。”我拾起狡啮桌上一根未熄的烟蒂，凑过去闻了闻味道，玩闹似的希望能够冷静下头脑：“好消息是，解析出的塑化剂残留物的手法我很熟悉，像是我大学班导的作品。” 办公室里的众人陷入了短暂的沉默。 “凶手能够知道新闻界的准确情报，估计从事的行业和这方面也有关系。” “我们应该考虑多人犯罪的可能性。” “……” 事物的美丽总是昙花一现，美丽的躯壳之内，可能只有不堪入目的真相。 那位不知名的先生，你想揭开的是什么？只是那位可怜的艺人女孩吗？那张被破坏的投影广告？ 或者是，希伯来系统？ “佐藤老师是个合格的班导师，但是在学术方面实在算不得严谨。他总是想要把科学和他所谓的浪漫主义结合到一起——比如在不同人群使用的药剂中添加一些可有可无的添加物作为区别。虽然这只是他的一个设想，只在个人的业余时间进行调试。”我长舒了一口气：“这次的药剂中就检测到了罗丹明b，又称玫瑰红b的无用染料。” “不错的名字啊。玫瑰什么的听起来就很少女。”佐佐山插了一句。 “嗯，顶着一个美丽的名字，却是具有致癌性的恶女角色呢。” “仅这一点并不能证明什么，不管怎样，这也勉强也算个可供追踪的线索，先去户山高等学校看看吧。”宜野座拍了板。 我们到达学校是在下午三点左右。因为未到下课时间，校园里并不很嘈杂。偶尔从课室里传出的声音让我生出一种别样的惆怅来。我不再被这个宁静安详的地方所庇佑，也将不安和猜疑带了进来。 没想到再一次回归学校会是这样的情形。也没有想到我会一冲动就将佐藤老师的私人实验作为线索告知公安局。在现在这样依靠犯罪指数定罪的制度下，我的指控的可参考价值不大，但是宜野座和狡啮依旧选择了重视。他们的确是非常可靠的伙伴，这么说有些僭越，应该说，值得尊敬的上司。尽管实际上我如今的地位实际上比下级要更低更卑贱，只是猎犬而已。 佐藤老师在实验室里忙碌着。高年级的学生在实验室里一边摸鱼一边做一些繁琐又没什么大用的工作。在公安局一行人踏入实验室的时候，佐藤老师沉着的很，还是将接下来一阶段的工作布置了下去才跟着我们离开了。 尽管名义上老师只是因为在业内的名声而作为顾问参与其中，事实上实验室里的几位都从严峻的脸色中了解了点什么——毕竟能混进实验室的都不会是什么傻瓜。 “由佳里，这是怎么了？“其中一个姑娘匆匆将手里的试管塞到试管架上，拉住了我的胳膊：“为什么你在公安局？这又关佐藤老师什么事了？” “呐由佳里，你说说话啊。” “橘！” 这些精英，曾经都是我的同学。尽管如今的我总是下意识地回避、不愿意承认我与这所学校的关联。 “没事的，只是有点事情需要老师的帮助。”我还是撒了谎。 在dominator的帮助下，犯罪指数只需要几秒钟就能够进行测算。佐藤老师的犯罪指数稍高于常人，但是仍然处于正常的范围内。因此，了解的重点就仅在于他最近接触的人群以及他志同道合的朋友了。 宜野座面无表情的陈述了整个案件，然后生硬的提出了希望佐藤老师能够配合调查的要求。 佐藤老师依旧表现的很镇定：“嗯，我会全力配合的，也希望你们不要太过暴力以至于妨碍到我现今在进行的工作。” 他看向我，我躲开了他的目光。 “橘是个好孩子，尽管笨了些。让她带你们去拿采买药品的记录吧，这方面一直是她在负责。” 我闷头大步往实验楼走，迎着一众同学的目光打开了电脑寻找交易记录。 “呐，橘，究竟是怎么一回事啊？” 我不知道！我不知道啊！ 从看见少女的瞬间我就知道我有哪里出了错。原本已经平静的内心闯进了一只凶兽。这个案件大概已经成为了我的某种执念。让我神经质的想要出一份力。让我不再是累赘或者是负担。我需要这个案件的话语权。 我说出了自己的猜想，我知道这会成为非常有用的线索。 哪怕我知道，佐藤老师一定是无辜的。 “找到了，苏丹明b的购买记录。” 影A面1234pp同人。到这里就断掉了=L=总之就是个妹子在老师的指导下杀了自己老爸然后为了躲避老师跑去公安局的故事。没写出来的部分是佐佐山被杀、妹子提供原料还是被发现了以及结局。 ​ 和圣护君的见面早在一年以前。 那时候我正陷入一场无聊的订婚风波。司法和行政都形同虚设的当今社会，所谓的政客依旧会利用各种手段维持他们虚假的地位。我父亲就是这些狂热的权利追逐者中的一个。他办过的最疯狂的事，大概就是买通各路关系想要了解希伯来的真身，与那位“塔尖上的人物”搭上关系。显然，他失败了。颓丧的他轻易的答应了一位政治同盟的联姻诉求，想要这个家里累赘一样的我发挥应有的效力。 圣护君就是那时候出现在我生活中的。我曾以为我们的相识只是一个偶然，端着咖啡匆忙恍惚着走过的我撞上了拿着初版书的他，而为了拯救那本可怜的纸本书籍，我们摔在了一起。这样浪漫的、梦幻的相遇满足了一个恋爱经验为0的女孩的全部幻想。 我们聊了很多。关于人脑，关于机械仿真，甚至还有哲学，天知道他会不会在听到我说的那些的时候有没有在心底里呵出声来。 他还帮我解决了那个订婚的麻烦。我不知道他具体是怎么做的，只是突然间我父亲就作出了让我继续深造的决定，将我打包丢进了学校。交给了佐藤老师。 也是在那个时候，我替圣护君做出了塑化剂。 圣护君是一个非常好的朋友。他博学风趣、善解人意——不得不说他在希望讨人喜欢时做的一向都很好。 我们的友谊维持了很长时间。也许并不常联系，但是也是偶尔可以聚个会喝喝咖啡的关系。 我一直很感激他为我做的事情。 因此他向我索取各种危险或是不危险的药品时我从不拒绝。毕竟他的心理指数从来都清澈又漂亮。也许他只是一个好奇心过重的研究者。 直到后来有一天，他笑着对我说：“由佳里过得生活其实真的很无趣呢。尽管脑子里有许多奇妙又美丽的想法，但是生活中实在是一个严肃刻板到令人无法靠近的人呐。” “其实也不过是个学无所成又懦弱无用的普通人而已，亏我还期待了那么久。” 他的笑容一如往昔，我也就当作是哲学家偶尔的牢骚。 直到我听到了那个消息——终于公布出来的尸体有着一种扭曲的美。 我愣在了当场。虚拟管家在耳边持续念叨：“注意，色相有变浑浊的趋势。”也没有精力去管。 我大概了解那些药品和试剂的去向了。那是我一直催眠自己不去相信的真相。 我拼命的联络圣护君，却发现他给我留下的联系方式已经失去了效用。 我躲进了实验室。假装自己发现了一个新的课题。实际上只是为了瞒住自己色相浑浊的事实。 后来，我就听到了父亲被残忍杀害的消息。实话说，听到消息时我甚至有一点激动，这个男人本就应得一场并不体面的死亡。他的恶行终究是不可能蛮的住的。而我，也有了一个正当的可以色相浑浊起来的理由。 我曾经流露出的对父亲的恶意那么明显，在父亲死后，我也恍然槙岛对我兴趣的来源。他大概一直在等待我做出什么不可挽回的事情。 我还没有傻到真的以为圣护是为了我杀死了我父亲。也许只是凑巧，也许只不过是顺手，或者算是小小的提醒。 我需要找个安全的地方。 最初在医疗所的日子还算安稳。呈环形的病房让我想起槙岛提过的某个哲学家——也许是边沁的什么理论。这让我在心理上不舒服的同时也有了种隐约的安慰。我本来就不清白，就算医疗所以监狱为蓝本又如何呢。 然而很快，我就在医疗团队中看见了圣护君。 他笑的像个圣人，却让我如临地狱。 对他而言，在我的趣味性丧失的同时，我就已经失去了全部的价值吧，这样的我，只有死了才是最干净的。 医护人员流动性较大的医疗所，甚至还不如想对封闭的学校实验室来的安全。 我想要活下来。 我加入了公安局。","link":"/2015/07/06/光影/"},{"title":"八月的疑惑","text":"核磁检查真叫人头秃 时间嗖嗖嗖就过去了，仔细盘算自己忘情工作究竟收获了啥，好像又还是无知又迷茫。站在旁观者立场上能看清的很多事情，到自己头上都还是一个猛子就扎下去，也不管底下是薄冰还是实地。 总算做了详细的身体检查。首先要扎针，方便后续输造影试剂，扎针是真的贼疼。进了核磁共振检查室也是真的贼紧张。剥光自己趴在平台上，然后送进圆咕隆咚的机器里。趴也趴不舒服，硬邦邦的硌着肋骨，头枕着不知道浸渍了多少人汗水的湿漉漉黏哒哒的枕头。 整个检查过程就仿佛蹦了一场野迪——各种动次打次咣咣咣，你在动次打次里前进后退循环往复，还有超高音的一些音效，时不时又停顿一下，只有轻微的大概是计时器的撞针声，中途再感受一下冰冰凉的造影剂顺着血管往上从手背流到小臂、大臂然后进入躯干的过程——就像闯入了什么日式科幻悬疑文艺片似的。 “这跟我太没关系了。” 从检查台上软着脚晕着头下来，我才终于跟这场检查挂上点关系，我对造影剂过敏眼睛上肿了个大包。也就是护士顺手推一针抗敏药的事。 当天医生就说了没什么问题，第二天（也就是昨天）拿了报告果然也还好。 未来究竟怎样实在不好说，只希望能平顺安稳。","link":"/2019/08/14/从今往后/"},{"title":"一些常见面试题和答案1","text":"本文献给跟我一样虽然屁都不会但是谜一样的自信地投了软开岗位的旁友们 希望我们都能获得尘世间的幸福 1. 茴字有几种写法（排序啦是排序参考Boblim的博客| 排序方法 | 时间复杂度（平均） | 空间复杂度 | 稳定性 | 原理 || :——: | :—————-: | :——–: | :—-: | :———————————————————– || 冒泡 | O(n²) | O(1) | 稳定 | 在扫描过程中两两比较相邻记录，如果反序则交换，最终，最大记录就被“沉到”了序列的最后一个位置，第二遍扫描将第二大记录“沉到”了倒数第二个位置，重复上述操作，直到n-1 遍扫描后，整个序列就排好序了。 || 插入 | O(n²) | O(1) | 稳定 | 对于一个数组A[0,n]的排序问题，假设认为数组在A[0,n-1]排序的问题已经解决了。 考虑A[n]的值，从右向左扫描有序数组A[0,n-1]，直到第一个小于等于A[n]的元素，将A[n]插在这个元素的后面。 || 归并 | O(nlogn) | O(n) | 稳定 | 采用经典的分治（divide-and-conquer）策略（分治法将问题分(divide)成一些小的问题然后递归求解，而治(conquer)的阶段则将分的阶段得到的各答案”修补”在一起，即分而治之)。 || | | | | || 选择 | O(n²) | O(1) | 不稳定 | 初始时在序列中找到最小（大）元素，放到序列的起始位置作为已排序序列；然后，再从剩余未排序元素中继续寻找最小（大）元素，放到已排序序列的末尾。以此类推，直到所有元素均排序完毕。 || 希尔 | O(nlogn) | O(1) | 不稳定 | 希尔排序也是一种插入排序，它是简单插入排序经过改进之后的一个更高效的版本，也称为缩小增量排序，把记录按下标的一定增量分组，对每组使用直接插入排序算法排序；随着增量逐渐减少，每组包含的关键词越来越多，当增量减至1时，整个文件恰被分成一组，算法便终止。 || 堆排 | O(nlogn) | O(1) | 不稳定 | 利用堆的性质来进行排序的 || 快排 | O(nlogn) | O(nlogn) | 不稳定 | 选一个数作为基准，双指针分别从前后两端遍历数组，当后指针比基准小且前指针比基准大时交换，直到相遇。把相遇位置的数与基准数做交换，继续快排二分后的两个数组。 || | | | | | 稳定：如果a原本在b前面，而a=b，排序之后a仍然在b的前面。 不稳定：如果a原本在b的前面，而a=b，排序之后 a 可能会出现在 b 的后面。 时间复杂度：对排序数据的总的操作次数。反映当n变化时，操作次数呈现什么规律。 空间复杂度：是指算法在计算机内执行时所需存储空间的度量，它也是数据规模n的函数。 冒泡应该是讲的最多的？底下有个大概示意 例题：冒泡1234567for (i = 0; i &lt; len; i++){ for (j = 0; j &lt; len - i -1; j++){ if (arr[j+1] &lt; arr[j]){ swap(arr[j], arr[j+1]); } }} 理解了冒泡那么插入和选择也都很好理解和记忆 稍微进阶一点的记住快排的原理和实现 例题：快排实现12345678910111213141516171819202122232425262728293031要点是选一个 前后各一个指针和它比大小 class Solution { public: void sort(vector&lt;int&gt;&amp; nums, int start, int end){ if (start &gt; end){ return; } int temp = nums[start]; int i = start; int j = end; while (i != j){ while (nums[j] &gt;= temp &amp;&amp; i &lt; j){ j--; } while (nums[i] &lt;= temp &amp;&amp; i &lt; j){ i++; } if (i &lt; j){ int p = nums[i]; nums[i] = nums[j]; nums[j] = p; } } nums[start] = nums[i]; nums[i] = temp; sort(nums,start,i-1); sort(nums,i+1,end); } vector&lt;int&gt; sortArray(vector&lt;int&gt;&amp; nums) { int start = 0; int end = nums.size()-1; sort(nums,start,end); return nums; } }; 堆排也很重要但是我没记住（ntm 预留空位等我搞懂了再放 一个非常简陋的时间和空间复杂度计算方法 时间复杂度： 一层for循环就是n的一次方，两层嵌套就是n²，只算最高次的。用了二分法的就跟log有关系。 空间复杂度：用了额外空间就不是O(1)了，具体多少就看开了多少内存。 2. 数据结构例题： C++中的容器都有哪些？map如何实现？红黑树是什么？顺序容器：顺序容器有以下三种：可变长动态数组 vector、双端队列 deque、双向链表 list。 关联容器：关联容器有以下四种：set、multiset、map、multimap。关联容器内的元素是排序的。插入元素时，容器会按一定的排序规则将元素放到适当的位置上，因此插入元素时不能指定位置。 除了以上两类容器外，STL 还在两类容器的基础上屏蔽一部分功能，突出或增加另一部分功能，实现了三种容器适配器：栈 stack、队列 queue、优先级队列 priority_queue。 所有容器都有以下两个成员函数： int size()：返回容器对象中元素的个数。 bool empty()：判断容器对象是否为空。 begin()：返回指向容器中第一个元素的迭代器。 end()：返回指向容器中最后一个元素后面的位置的迭代器。 rbegin()：返回指向容器中最后一个元素的反向迭代器。 rend()：返回指向容器中第一个元素前面的位置的反向迭代器。 erase(…)：从容器中删除一个或几个元素。该函数参数较复杂，此处省略。 clear()：从容器中删除所有元素。 front()：返回容器中第一个元素的引用。 back()：返回容器中最后一个元素的引用。 push_back()：在容器末尾增加新元素。 pop_back()：删除容器末尾的元素。 insert(…)：插入一个或多个元素。该函数参数较复杂，此处省略。 要访问顺序容器和关联容器中的元素，需要通过“迭代器（iterator）”进行。迭代器是一个变量，相当于容器和操纵容器的算法之间的中介。迭代器可以指向容器中的某个元素，通过迭代器就可以读写它指向的元素。从这一点上看，迭代器和指针类似。 123容器类名::iterator 迭代器名; //正向迭代器容器类名::reverse_iterator 迭代器名; //反向迭代器 advance(p, n)：使迭代器 p 向前或向后移动 n 个元素。 distance(p, q)：计算两个迭代器之间的距离，即迭代器 p 经过多少次 + + 操作后和迭代器 q 相等。如果调用时 p 已经指向 q 的后面，则这个函数会陷入死循环。 iter_swap(p, q)：用于交换两个迭代器 p、q 指向的值。 容器 迭代器功能 vector 随机访问 deque 随机访问 list 双向 set / multiset 双向 map / multimap 双向 stack 不支持迭代器 queue 不支持迭代器 priority_queue 不支持迭代器 map以模板（泛型）方式实现，可以存储任意类型的数据，包括使用者自定义的数据类型。主要用于资料一对一映射的情况，map内部的实现过程是自建一棵红黑树，这棵树具有对数据自动排序的功能。在map内部所有数据都是有序的。 数组、链表和列表数组的内存空间是连续的，链表在内存空间内是离散的 例题：反转数组/链表变种包括k个一组反转链表，从m-n反转链表，两两反转链表均可leetcode刷题 反转数组：reverse；双指针交换 反转链表：指针前中后，换指向 栈stack、堆heap和队列queue堆是priorityQueue 堆和队列辨析 + C++中栈的用法 例题：括号匹配（栈的应用），堆排序（堆的应用），例题：两个栈做一个队列思路：入队列是把需要存的元素插入栈1；出队列是pop栈2中的元素，把栈1中的元素依次插入栈2（注意这一步栈2必须为空），pop栈2中的元素。 例题：两个队列做一个栈思路：出栈，把元素依次尾插入队列1；把前序元素全头删然后尾插到队列2，把最后一个元素pop掉，以此类推。新插入的元素尾插在原本的队列后面，成为下一次最先被pop掉的。插入原则：保证一个队列为空，一个队列不为空，往不为空的队列中插入元素。 树、二叉树、红黑树、搜索树树： 二叉树：一个父节点有两个子节点 红黑树： 搜索树：有序排列的树 哈希表hashmap的原理这玩意我觉得非常之坑，用起来稀里糊涂的，但是消除时间复杂度又很好用显得你很专业 例题：Two Sum123456789101112131415161718class Solution {public: vector&lt;int&gt; twoSum(vector&lt;int&gt;&amp; nums, int target) { map&lt;int,int&gt; mp; vector&lt;int&gt; a(2,-1); int i = 0; for (i = 0; i &lt; nums.size(); i++){ mp.insert(pair&lt;int,int&gt;(nums[i],i)); if ((mp.count(target - nums[i]) &gt; 0) &amp;&amp; (mp[target-nums[i]]) != i){ a[1] = i; a[0] = mp[target-nums[i]]; } } return a; }}; 例题：LRU缓存机制123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475class LRUCache {public: struct CacheNode { int key; int value; CacheNode *pre, *next; CacheNode(int key, int value): key(key),value(value),pre(NULL),next(NULL){} }; map&lt;int, CacheNode*&gt; mp; CacheNode *head, *tail; int size; LRUCache(int capacity) { size = capacity; head = NULL; tail = NULL; } void remove(CacheNode* p){ if (p-&gt;pre != NULL) { p-&gt;pre-&gt;next = p-&gt;next; } else { head = p-&gt;next; } if (p-&gt;next != NULL) { p-&gt;next-&gt;pre = p-&gt;pre; } else { tail = p-&gt;pre; } } void setHead(CacheNode*p){ p-&gt;next = head; p-&gt;pre = NULL; if (head != NULL){ head-&gt;pre = p; } head = p; if (tail == NULL){ tail = head; } } int get(int key) { map&lt;int,CacheNode*&gt;::iterator it = mp.find(key); if (it != mp.end()){ CacheNode* p = it-&gt;second; remove(p); setHead(p); return p-&gt;value; } else { return -1; } } void put(int key, int value) { map&lt;int,CacheNode*&gt;::iterator it = mp.find(key); if (it != mp.end()){ CacheNode* p = it-&gt;second; p-&gt;value = value; remove(p); setHead(p); } else { CacheNode *q = new CacheNode(key,value); if(mp.size() &gt;= size){ map&lt;int,CacheNode*&gt;::iterator it2 = mp.find(tail-&gt;key); remove(tail); mp.erase(it2); } setHead(q); mp[key] = q; } }}; 5. 网络IP报文分片TCP的三次握手四次挥手三次握手：Client-send SYN；Server-send SYN+ACK；Client-send SYN+ACK 四次挥手：Client-send FIN；Server-send ACK；Client-send FIN；Server-send ACK； LISTEN：侦听来自远方TCP端口的连接请求；SYN-SENT：在发送连接请求后等待匹配的连接请求；SYN-RECEIVED：在收到和发送一个连接请求后等待对连接请求的确认；ESTABLISHED：代表一个打开的连接，数据可以传送给用户；FIN-WAIT-1：等待远程TCP的连接中断请求，或先前的连接中断请求的确认；FIN-WAIT-2：从远程TCP等待连接中断请求；CLOSE-WAIT：等待从本地用户发来的连接中断请求；CLOSING：等待远程TCP对连接中断的确认；LAST-ACK： 等待原来发向远程TCP的连接中断请求的确认；TIME-WAIT：等待足够的时间以确保远程TCP接收到连接中断请求的确认；CLOSED ： 连接已经关闭的状态； 例题：TCP连接半关闭，建立连接过程中的socket函数不可不知的socket和TCP连接过程 例题：TCP头部数据里都有什么？标志位都有哪些？例题：UDP为什么比TCP快？体现在哪些方面？TCP和UDP的区别？HTTP1.0与1.1与HTTPS例题：HTTPS的加密过程例题：在搜索框输入域名到页面显示期间发生了什么例题：RAP和DNS6. 算法递归观察递归树，很明显发现了算法低效的原因：存在大量重复计算，比如 f(18) 被计算了两次，而且你可以看到，以 f(18) 为根的这个递归树体量巨大，多算一遍，会耗费巨大的时间。更何况，还不止 f(18) 这一个节点被重复计算，所以这个算法及其低效。 例题：二叉树深度、斐波那契数列123456 int fib(int N){ if (N == 1 || N == 2) { return 1; } return fib(N-1)+fib(N-2);} 明确了问题，其实就已经把问题解决了一半。即然耗时的原因是重复计算，那么我们可以造一个「备忘录」，每次算出某个子问题的答案后别急着返回，先记到「备忘录」里再返回；每次遇到一个子问题先去「备忘录」里查一查，如果发现之前已经解决过这个问题了，直接把答案拿出来用，不要再耗时去计算了。一般使用一个数组充当这个「备忘录」，当然你也可以使用哈希表（字典），思想都是一样的。 12345678910111213 int fib(int N) { if (N &lt; 1) return 0; // 备忘录全初始化为 0 vector&lt;int&gt; memo(N + 1, 0); return helper(memo, N); } int helper(vector&lt;int&gt;&amp; memo, int n) { if (n == 1 || n == 2) return 1; if (memo[n] != 0) return memo[n]; // 未被计算过 memo[n] = helper(memo, n - 1) + helper(memo, n - 2); return memo[n];} 动态规划递归的暴力解法 -&gt; 带备忘录的递归解法 -&gt; 非递归的动态规划解法 https://leetcode-cn.com/problems/coin-change/solution/dong-tai-gui-hua-tao-lu-xiang-jie-by-wei-lai-bu-ke/ 例题：暑假作业、凑硬币二分法例题：希尔排序、快排深度优先搜索例题：滑雪问题广度优先搜索例题：层次遍历堆的使用例题：高频词（TopK frequentword）、堆排序7. 数据库SQL与NoSQL的区别，MySQL又是什么","link":"/2019/11/16/一些常见面试问题和答案/"},{"title":"堆排序","text":"堆排序笔记 堆排序123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051#include &lt;stdio.h&gt;void heapify (int tree[], int n, int i){ if (i &gt;= n) { return; } int max = i; int c1 = 2*i + 1; int c2 = 2*i + 2; if (c1 &lt; n &amp;&amp; tree[c1] &gt; tree[max]) { max = c1; } if (c2 &lt; n &amp;&amp; tree[c2] &gt; tree[max]) { max = c2; } if (max != i) { swap(tree, max, i); heapify(tree, n, max); } } void build_heap (int tree[], int n) { int last_node = n - 1; int parent = (last_node-1)/2; int i; for (i = parent; i &gt;= 0; i--) { heapify(tree, n, i); }}void heap_sort (int tree[], int n) { build_heap(tree,n); int i; for (i = n-1; i &gt;= 0; i--) { swap(tree, i, 0); heapify(tree, i, 0); }}int main() { int tree[] = {10,6,5,4,1,3}; int n = 6; // heapify(tree, n, 0); // build_heap(tree, n); // heap_sort(tree, n); int i; for (i = 0; i &lt; n; i++) { printf(“%d\\n”,tree[i]); } return 0;}","link":"/2019/11/20/堆排序/"},{"title":"吴恩达机器学习笔记","text":"写在前面 非常我流且敷衍 主要是记概念和要点 参考了黄海广博士的 笔记 第一章1. 机器学习是什么2. 监督学习的概念3. 无监督学习的概念第二章1. 单变量线性回归(Linear Regression with One Variable)2. 代价函数3. 梯度下降4. 梯度下降的线性回归第三章 主要是线性代数的内容 搜大学线代课获得更多内容第四章1. 多变量线性回归2. 多变量梯度下降3. 梯度下降法实践1-特征缩放4. 梯度下降法实践2 -学习率5. 特征和多项式回归6. 正规方程第五章 Octave教程 现在好像都没在用这个了 先不管它第六章1. 逻辑回归 (Logistic Regression)2. 假说表示 (Hypothesis Representation)3. 判定边界4. 代价函数5. 简化的成本函数和梯度下降6. 高级优化7. 多类别分类：一对多第七章1. 过拟合问题2. 代价函数3. 正则化线性回归4. 正则化的逻辑回归模型第八章1. 非线性假设2. 模型13. 模型24. 特征和直观理解5. 样本和直观理解6. 多类型分类第九章1. 代价函数2. 反向传播算法和直观理解3. 梯度检验4. 随机初始化5. 综合流程第十章第十一章第十二章周志华西瓜书参考答案","link":"/2019/11/05/吴恩达机器学习笔记/"},{"title":"南方","text":"写在前面二十年代芝加哥黑帮背景。希望能填完。明明硬盘里还有茸布的断头文稿啊哈哈哈哈哈。","link":"/2020/08/22/南方/"},{"title":"大数据相关基础概念","text":"简单的数据科学相关概念 1. 数据仓库、数据湖、数据流的区别是什么OLAP （online analytical processing，在线分析处理） 数据仓库-〉数据湖-〉数据流 数据仓库是存储经过全面处理的结构化数据的 数据湖是存储结构化和非结构化的原始数据 数据流是比较新的概念 当前大部分处理都将数据作为流来处理 ，分为有限数据流和无限数据流，无限是有始无终的，有限是固定大小有始有终的。 1. 那数仓如何分层源数据装载入数仓，进入数据缓冲区，经过抽取、清洗、转换刷新，进入基础数据层进行管理，然后在公共层汇总，进入OLAP服务器即数据集市，由前端工具和应用访问、分析和进行数据挖掘。 原始数据层：从不同系统录入原始的结构化数据和非结构化数据 数据集成产品（ 数据采集层）：对结构化数据进行数据抽取、清洗和转换，对非结构化数据进行内容分析 数据存储层：企业级数据平台，服务不同的部门如财务效手生产人力等 数据分析产品（数据展现层）：数据查询分析平台（固定报表、统计图表、多维分析、office应用、地图分析、电子报告等） 应用展现门户（信息交付展）：数据仓库内容访问平台（展示图表、报表、灵活分析、个性化设置、日志统计） 2.DM和DW的区别是什么数据集市和数据仓库 数据集市以某个业务应用为出发点而建设的局部数仓，只关心自己需要的数据而不全盘考虑企业整体的数据架构和应用，每个应用有自己的数据集市。 结构清晰、针对性强、扩展性好，因为仅对某一特定领域建立，容易维护修改。但建设任务繁重且更加消耗储存空间。 数仓是决策用的数据集合，效率高质量好扩展性好且面向主题。其中的数据只允许增加不允许删改，主要提供查询服务。 3.数仓跟中台区别是什么 怎么演变过来的 数据中台 数据仓库 部署架构 水平扩展 大部分水平扩展 数据类型 文件存储，没有数据类型 丰富的数据类型 数据模型 非常简陋的数据模型 完善丰富的数据模型 数据关系 没有数据关系描述 数据关系完善 数据一致 无一致性 强一致性 数据安全 安全性很弱 安全性很高 计算类型 离线批量处理，只读，低并发 离线批量处理，只读，低并发 使用场景 低密度数据海量存储，数据预处理计算 高价值数据统一存储和计算平台 人员要求和成本 高 适中 传统的数据仓库不再能够满足数据分析的需求（从统计分析走向预测分析，从单领域走向多领域，从被动走向主动，从非实时走向实时分析，从结构化数据向多元化数据转变），且对统一平台有强烈诉求，也对数据中台的运算能力、核心算法、数据的全面性提出了更高的要求。 数据中台的处理架构出现了变化。一是hadoop和spark等等分布式技术和组件为核心的数据处理架构能够支持批量和实时数据及灵活的业务需求，二是数据的与处理流程正在从ETL转向ELT。ETL是先从数据源抽取所需数据，然后数据清洗然后加载到数仓。ELT是根据上层应用的需求，随时从数据中台抽取想要的原始数据进行建模分析。 4.怎么给数仓做ETLETL是extract、translation和load三个单词的首字母，即抽取（从操作型数据源获取数据）、转换（转换数据，使之转变成为适用于查询和分析的形式和结构）、装载（将转换后的数据导入最终的目标数据仓库） 工具：数据抽取（kafka；flume；sync）；数据清洗（hive/tez；pig/tez；storm；spark）；数据存储（hadoop；hbase；redis）；任务管理（azkaban；oozie）；数据同步（datax；sqoop）。 抽取：把ODS源数据抽取到DW中，然后处理成展示给相关人员查看的数据 如果没有特殊要求可以一天一次，但是需要避开拉去日志的高峰期；对于有实时性要求的日志，可以一小时一次，或者直接使用kafka等相关工具收集，需要考虑到系统能否承受 由于数据量较大，一般都是采用增量抽取，但是对于一些特殊场景的数据，比如订单数据，由于订单的状态会发生变化，并且订单的量级是可预知和相对较少的，就需要采用全量拉取的策略；对于源数据的保留，考虑到突发情况，服务器上的源数据至少要保证2天以上的时间 转换（清洗）：把不需要的和不符合规范的数据进行处理。数据清洗最好不要放在抽取的环节进行，考虑到有时可能会查原始数据 a. 空值处理：根据业务需要，可以将空值替换为特定的值或者直接过滤掉； b. 验证数据正确性：主要是把不符合业务含义的数据做一处理，比如，把一个表示数量的字段中的字符串替换为0，把一个日期字段的非日期字符串过滤掉等等； c. 规范数据格式：比如，把所有的日期都格式化成yyyy-MM-dd HH:mm:ss的格式等； d. 数据转码：把一个源数据中用编码表示的字段，通过关联编码表，转换成代表其真实意义的值等等； e. 数据标准，统一：比如在源数据中表示男女的方式有很多种，在抽取的时候，直接根据模型中定义的值做转化，统一表示男女； 装载：数据拉取，清洗完之后，就需要展示了。一般是把清洗好的数据加载到mysql中，然后在各系统中使用，或者使用Tableau直接给相关人员展示 2. 数据中台和业务中台的区别是什么，中台如何分层数据中台成为热点，“中台”这个概念，是相对于前台和后台而生，是前台和后台的链接点，将业务共同的工具和技术予以沉淀。数据中台是指数据采集交换、共享融合、组织处理、建模分析、管理治理和服务应用于一体的综合性数据能力平台，在大数据生态中处于承上启下的功能，提供面向数据应用支撑的底座能力。广义上来给数据中台一个企业级的定义：“聚合和治理跨域数据，将数据抽象封装成服务，提供给前台以业务价值的逻辑概念”。 业务中台（企业核心金正能力的固化与赋能）：能力固化与赋能，固化通用能力，赋能前线部队，提升配置效率，加快前线响应，产品化业务化，开辟全新生态。 数据中台（企业核心数据资产的整合与共享）：资产整合与共享，整合多维数据，统一资产管理，连通数据孤岛，共享数据资源，深入挖掘数据，盘活资产价值。 业务中台实现各个业务模块功能的复用 数据中台对各个业务的数据进行集中的采集计算等操作 业务中台的分层不太清楚 数据中台的分层大致有采集、计算、统一对外接口和对外应用。 操作数据层，明细数据层，汇总数据层，应用数据层 1. 业务和服务的区别是什么业务更加中性 2. 什么是微服务spring_boot教程 3. 有的公司会做“技术中台” 这又是什么​ 将技术能力与业务能力分离，以产品化的方式向前台提供技术赋能 4. 中台上云的话 是IaaS（基础设施即服务）、PaaS（平台即服务）、DaaS(数据即服务)、还是SaaS（软件即服务）呢IaaS只提供基础设施，PaaS相当于基础设施加操作系统，SaaS提供软件用户只需要操作数据，DaaS用户可以只做读写。 3. Kafka里Stateful Stream Processing怎么理解无界数据流的处理 4. 如何用Flink设计一个实时训练系统5. 时序模型在深度学习领域有哪些模型 原理和应用场景是什么应用场景有时空分析 资源环境监测 地球空间认知 模型框架是依据单/多传感器节点和单/多维进行划分的 问题类型主要有：1. 通过其他时间序列和维度作为驱动来预测目标序列；2. 通过多元历史序列来预测未来t时间内的目标序列，将其他时间序列及维度作为目标的数据特征，同时预测多个目标序列；3. 通过多元历史序列及序列间的依赖关系来训练函数，预测目标序列 分析方法主要有：1. 仅根据历史时间序列的趋势发展预测未来时间序列的趋势发展，通过建立适当的数学模型拟合时间趋势曲线，根据建模预测未来时间序列的趋势曲线。常见模型包括平均自动回归模型。但是他们通常都不能对多个节点序列之间的关系进行建模，所以仅适合单节点单维度的。2. 为了提高预测的精度，非线性自动回归外生模型（NARX）或者机器学习算法被引入时序预测，此类方法根据具体的应用场景选取可能影响预测值的特征，引入模型，应用机器学习的回归模型进行预测。需要多个维度的数据建立模型较为复杂，预测精度高但仅针对特定的用用场景。且由于建模方式是预先定义的非线性形式，可能无法捕捉真正潜在的非线性关系。3. 序列生成模型主要是针对序列上下文关系进行学习，不能直接对空间关系建模，对于隐式空间关系也可以通过维度拼接、解点表示学习的办法进行建模。所以序列生成模型主要用来做单元或多元时间序列预测分析，而且主要还是以多维时间序列预测分析为主。4. 基于传统机器学习的方法是先抽取时间统计特征和空间结构特征再输入模型中，基于序列生成模型的方法主要学习序列上下文关系，而对空间关系建模能力弱（不是没有，可以维度拼接），所以有必要提出同时学习时间和空间关系的预测模型。忽略各个节点之间的网络关系结构的动态性，主要考虑静态的关系结构即图结构，所以大部分的时空序列模型都是基于时间图快照的时序图模型，即每个时刻所有节点的关系都是固定的静态图，或者干脆只考虑其间接隐含的、科学系的关系。这需要通过模型直接学习空间关系而不是手动抽取结构特征，通常需要结合空间卷积或图结构的学习方法，比如卷积网络和图神经网络等。 6. 海量实时物联网数据应该如何存储和管理 例如存在时空数据库中？时序数据库中？事件流？7. TOCC实时交通指挥平台怎么搭建 例如交通流模型怎么做 需要哪些数据和模型 系统架构如何设计TOCC是交通综合运行协调与应急指挥系统 服务政府决策、服务行业监管、服务企业运营、服务公众出行（服务用户为政府部门、行业管理、企业单位和社会公众） 四大应用系统：运行监测预警、应急协同指挥、辅助决策支持、公众出行服务 三大支撑系统：交通地理信息服务（基础地图服务、标志地标查找、地物添加）、统一身份认证平台（用户管理、身份认证、权限管理、单点登录）、统一视频监控服务（视频集成、视频功能整合、手机视频） 一个中心：综合交通大数据中心 包括（云、交通流理论、交通网络模型、交通需求模型、多模式仿真引擎、时空分析引擎）涉及 数据采集-体量；数据解析-价值；数据清洗-速度；数据分析-多样性；数据应用-真实性。 终端通过通信网络将数据传入 8. 深度学习的概念 可以突击一下 CNN RNN 反向传播 常用的激活函数 NLP 计算机视觉 GAN 迁移学习 强化学习 联邦学习CNN ：卷积神经网络​ 用传统的三层神经网络需要大量的参数，原因在于每个神经元都和相邻层的神经元相连接，但是思考一下，这种连接方式是必须的吗？可以用某种方式对一张图片的某个典型特征识别 ​ 同一层的神经元可以共享卷积核，那么对于高位数据的处理将会变得非常简单。并且使用卷积核后图片的尺寸变小，方便后续计算，并且我们不需要手动去选取特征，只用设计好卷积核的尺寸，数量和滑动的步长就可以让它自己去训练了 RNN：循环神经网络​ BP算法和CNN算法仅考虑一个输入的影响而不考虑其他时刻输入的影响，对于与时间先后有关的预测就不能准确预测。 ​ RNN是一种特殊的神经网络结构，与DNN和CNN不同的是它不仅考虑前一时刻的输入，也赋予网络对前序内容的记忆。具体的表现形式为网络会对前面的信息进行记忆并应用于当前输出的计算中，即隐藏层之间的节点不再无连接而是有连接的，并且隐藏层的输入不仅包括输入层的输出还包括上一时刻隐藏层的输出。 ​ RNN的应用：自然语言处理，机器翻译，语音事别，图像描述生成，推荐 反向传播（BackPropagation）：​ 损失函数，使用平均绝对误差等数学工具表达出的输出结果和真实结果的偏差 梯度下降 常用的激活函数在多层神经网络中，上层节点的输出和下层节点的输入之间具有一个函数关系，这个函数称为激活函数 ，引入非线性函数作为激励函数，这样深层神经网络的表达能力就更加强大 sigmod tanh ReLU ELU PReLU NLP​ 神经语言程序学 计算机视觉​ 从图像或者多维数据中获取信息 GAN​ 生成式对抗网络 一种复杂分布上无监督学习的深度学习模型，生成和判别互相博弈学习 迁移学习把任务A开发的模型作为初始点，重新使用在任务B的开发模型的过程中 强化学习不要求预先给定任何数据，而是通过接收环境对动作的奖励（反馈）获得学习信息并更新模型参数 联邦学习一个机器学习框架，能有效帮助多个机构进行数据使用和机器学习建模 9. 大数据那块 谷歌的三驾马车google的三驾马车：GFS（可扩展的大型数据密集型应用的分布式文件系统）、MapReduce（超大集群的简单数据处理）、Bigtable（结构化数据的分布式存储系统）","link":"/2019/10/30/大数据/"},{"title":"奔逃","text":"写在前面cp会发这个。向马老师约了稿所以会有插画。原本以为会写好几个小故事搞个本出来，结果只有一篇。没有做校对，因为有些部分自己还不是很满意，想之后再改一改。 另外值得一提的是这个小无料是我自己排版的，虽然字体选择上很受限制，但是……总之阿良都夸我可以了呢！ 他们不会再回来了。像没入丛林的山兔，汇入溪流的眼泪，泼向荒原的热血。 01-长夜大概是二月的一天，我实在忍受不了在东京生活，带着挎包就搭上了往老家的电车。因为是突然从公司跑掉的，脚上还踩着两个月工资换来的高价高跟鞋。“是的，是的，对不起给您添麻烦了。”我在电话里跟上司道歉，慌称自己身体不适，一边偷偷单手揭开内衣带子然后伏倒压低声音装成咳嗽的样子。路上健太打来的四五通电话都被我静音无视掉，只扭头看窗外越下越大的雪。手机电量也不足，就这么回家去大概也要被父母念叨，干脆随便找个车站下车算了。这么想着，我停在了一个叫空环的小城镇。 这边好像少有来客，我到站时又早已经天黑，冒着雪哆哆嗦嗦顺着大道走了好一会儿也没有找到旅店，推荐APP里也没有附近的民宿，只能随便钻进一间写着通宵营业的酒馆随便凑合混一夜。 就是在这里，一个男人给我讲了最匪夷所思的故事。 “您见过狐狸吗？”这个男人在我来之前就大概已经醉得不轻，这会儿眼睛亮晶晶的望着虚空某个方向。我坐在他旁边——只是凑巧，并不是因为他长得英俊什么的，实际上他看上去就像是年轻一点的我的混蛋老爹。“只在动物园见过，去的时候是夏天，因为毛换了一半所以光秃秃的，看着有些可怜。”我接过店家送上来的热乎乎的烤银杏一边拨一边搭腔。男人大概没想到我是这样的回答，愣得把酒举到嘴边却忘了喝：“我说的不是那样的狐狸呀……外面的狐狸原来是这样的吗？”“狐狸应该是什么样的？” 空环信奉的神明是狐狸，有银闪闪的皮毛和黄澄澄的眼睛。化作人形的时候会带上狐狸假面。 男人说了很多三流小说家喜欢写的都市怪谈。徘徊在街头的怅惘的人和隐藏在角落里的邪恶幽影，失踪的园长被抹除了一切痕迹和人们对他的记忆等等，我几乎要相信这个城市离奇的落后正是游戏人间的狐狸神明所作而不是地处偏僻了——可我能够到来本身就证明了所谓隔绝于世是假的。 狐狸神明爱上他的妻子，带走了她和她腹中的孩子。这个男人说着这个故事的时候带着不知是笑还是哭的表情，我却只觉得他遇上妻子不伦于是精神恍惚。当然，在那时我没有说出来。 那天是祭典。男人说。他用手肘撑着桌子，把下巴搁在拳头上，他的头发散落在苍白的脸颊两边。他的衬衫领子上有一块污迹，像是强力漂白剂染出的，他出门前应该已经把领子朝里掖了掖好把这一块藏住，只是这时候又松开了。他没在意这些，只是说个不停。 我和朱音约好了要一起，当然，还有我们的儿子。 灯吾——我们第一个也是唯一一个孩子，在那个时候已经很懂事了，而我哪怕过去这么多年，也还是个混账老爹。但也许他是从那个时候才开始懂事的，你知道的，小孩子嘛，总是不知不觉就长成了另一个样子。事实上，家里的活也是他来干。如您所见，我是一个粗糙的人，如果不是他，我大概没办法这么干净体面的和您聊天，也许随便找个垃圾堆就可以醉生梦死。幸好有他。只是对他而言，降生于这样的家庭，大约是一种不幸吧。宿命呀、血缘呀那一套我也觉得实在是无理，但是朱音和他都还是被这样的洪流挟裹着。 我们在祭典那天等了很久也没有等到她，我们在风车的摊位旁边，灯吾盯着旋转的红色风车看了一晚上，我给他买了一只，但他只是擎着想留给妈妈。我知道是由季带她走离开了。我们从小一起长大，但我知道他们之间有比和我更加亲密的连结在，哪怕是后来和朱音在一起，我也知道有一天她会离开。 但我低估了被留下的痛苦。这种痛苦仿佛是灵魂在缓慢地燃烧，一点点一点点像流萤一样飘散开去。谁知道呢，我总在梦里见到这样的场景，飘摇的魂灵、黑沉的黄泉，赤红的火焰和朱音。我想念他们，却又嫉妒他们。 而现在，狐狸山神又出现了。我知道不是他，不是由季。我终于得承认自己一直放不下的梦是假的。朱音和由季不是从此离开我，而是真真切切被神隐。我无法，也不能追随他们而去。 他大约是喝了太多的酒，说话颠三倒四毫无条理，却又情真意切，到动情时连昏黄的灯光也遮蔽不了他的泪痕。他时不时还会哼起歌来——你不能跟醉鬼讲道理，更不能和伤心的醉鬼讲道理。 赤红色灯火下的妖怪，赤红色音乐的彼端。 赤红色鸟居彼端，黄昏路上摇晃的影。 磷火狐烟笼着原野，入夜听见仙宫音兆。 …… 相比于费尽心思才理清楚头绪的故事，这首歌我记得倒是更清楚，毕竟整个后半夜我的脑海里都来回循环着它的旋律。 到应该是早上的时间，我准备结账离开，摸了摸口袋才发现自己钱包丢了，也不知道是在列车上还是过站台的时候……我身上唯一能抵押的大概就是脚上九成新的鞋，可是当场脱鞋老板怕也是要把我赶出去。夜市——就是这个男人，走过来替我结了帐。“就当我请你喝酒了吧。”他实在是个好人，只是运气坏透了。 远方的天空仍然是灰蓝的，近处却透着甜美柔和的玫瑰粉色，这景象实在是很不寻常，只可惜我的手机早已黑屏，没办法立刻拍下这样的风景。 我跟着夜市去他家暂时呆着。 “我经常捡一些奇奇怪怪的东西回家，灯吾和灯奈已经习惯了。”夜市看穿我的不安，随口安慰我。 我也知道现在这样的情节并不是通俗展开，但是总比我身无分文流落街头要好。而夜市身上有一股奇怪的令人安心的气质，让我忍不住想要相信他的善意。 然后他在家门口捡到了另一个奇怪的东西。一个戴着兜帽，围着毛皮围脖，身上有浓浓血腥气味的男人。男人看上去阴郁又狠厉——而且是那种非要拒绝所有人的好意，做头孤狼对抗一切的性格。 “椿？”这个男人眉头紧皱着，愈发凶神恶煞不像个好人，然后他做了个在我看来不可思议的举动，他和我一样，转身进了夜市的家门。 灯奈是个可爱的小姑娘，有点人小鬼大的架势，讲话声娇娇柔柔，做起家务来却一点也不含糊。灯吾就如同夜市说的那样，一看就是家里的主心骨，稳重又懂事，很不好惹。夜市匆匆吃了点东西扭头就准备回房间休息，留下我们两个不速之客和孩子们面面相觑。 我简单的做了自我介绍，只说自己是偶然经过。轮到男人时，他却一副不想和凡人搭腔的傲慢态度，让人火冒三丈。灯吾神思不定，似乎遇到了什么麻烦，没等我出声询问，他先开口说了出来。 “最近城市里不太安全，有不少起失踪案件。昨天晚上我有位朋友没有赴约……真是……净给人添麻烦。” “真的有失踪案件？”我有些后怕。 “我们家附近还好，高架和车站那边都出过事。灯奈，最近一定要等哥哥去接你，不要一个人乱跑，知道吗？” “知道啦知道啦，哥哥不用担心我，灯奈很乖的。” 我原以为这只是一次短暂的出逃，喘不过气的日常里的一段小小的反叛。但是我没想过会有这些我不曾理解也没有想要了解的事物出现。吃人的妖怪，尾巴变成的小姑娘、借着狐狸躯壳存活的千年前的人……也许在未来我会回忆起会感叹，但现在我只想好好休息，而曾经避之不及的日常，开始让我万分想念。 长夜结束，天光乍亮，嵯峨野死去，灯吾被妖怪带走，灯奈消失了。 我裹紧了棉衣，点了根烟和夜市一起迎接早晨的太阳。 “以后打算怎么办？”我问他。 “不知道。” “你呢？有回去的地方吗？”他问我。 “不知道。” 02-列车由在奔跑。他能嗅到自己的呼吸逐渐带上了一点腥甜的铁锈味儿，夜风刮得喉咙剧痛。黑狐攀在他肩上，爪子轻轻探出勾住衣服——一般来说是如此，只是现在，大约是害怕，也可能是自己的大幅度动作让黑狐难以保持平衡，黑狐的爪子刺破了他的皮肤，紧紧地抓住了他。由在闲逛的时候来过车站，向车站里的人类打听到了许多有用的东西，比如说，他知道乘坐电车需要买车票。 这让他准备翻越闸机的时候有些迟疑。但是谁还管得了那么多呢。 他们在紧急在列车准备关门开走的时候跳上了车。 “由，看看那边。”黑狐急急忙忙地催促着。 那是一个粉色的软皮小钱包，装饰着一只珐琅小兔子，它掉在座椅下方一个不易察觉的夹缝里。 “不愧总在寻找零钱的黑狐，居然这都能发现。”由非常衷心地赞美着。 “那是当然。”黑狐正洋洋自得，突然反应过来好像也不是什么好话。 “等等……你真的是在夸奖吗？” “当然，我最喜欢黑狐啦。”由笑眯眯地回答，伸手捡起了钱包。 黑狐早放弃了追究这个问题，饶有兴致得在由脖子上转了个向：“快打开看看。” 车厢里空空荡荡，后排有两个人各自靠着车窗打着盹。列车出站后逐渐提高了速度，风雪在车窗外模糊成了白茫茫的一片影子。他们随便找了个空位坐下。钱包里插着各种店家的折扣卡，纸币和便利店的票据胡乱地叠放着，夹相纸的地方塞了张揉皱了的温泉旅馆宣传单。由把东西展开又收拾好放回原位，只把宣传单展开铺平捏在手里。 车顶着风雪一路向北，大块雪片打着旋从窗外刮过，哪怕是车厢内开了暖气，由也似乎感受到了干燥又寒冷的风。好长一段时间内，由和黑狐谁都没有主动开口说话。他们聚精会神地读宣传单上的每一个字，他们能感觉到彼此之间有一种紧张的情绪，却又都保持警惕。那是什么呢？一触即发的，像是冰河下的一声闷响。他们都在等待一个时机，在一个恰当的时刻，宣泄出某种情绪，然后从这一个阶段走到下一个阶段。但是这样的紧张和忐忑对于刚刚逃脱追捕的两人又似乎太早了一些。 黑狐从由的脖子上跳下，坐在了邻座的位置上，前脚并住，尾巴松松地拢在上面。他清了清喉咙，仿佛不习惯开口那样：“所以，我们不如先去这个地方？”他指的是由一直无意识盯着的旅馆地址。由突然感到一阵轻松，却又随之而来一阵失望。由听见自己的声音也有些发紧，他说的是：“好。” 列车车窗上凝出的雾气终于汇聚成了水滴，在车窗上洇出一道道痕迹。黑狐伸出爪子胡乱抹了抹，向外看远方的灯火。空环早就被抛在身后，黑狐笃定不会有后续的追逐，又打破了一开始的沉默，开始感受到疲倦和困意，甚至因为之前情绪的剧烈波动，此时竟显出了一种拒人于千里之外的淡漠，这对于神社里的其他妖怪来说实在是常见，对于黑狐来说，展露这种成熟的妖怪气质还是头一回。 由盯着黑狐茸茸的后脑入了迷。车行向无人的平淡的山野，窗玻璃像镜子一样映出他们的样子。怎么就和黑狐一起逃出来了呢？由看着窗玻璃里自己那张总是显得很困乏的脸，它并不清晰，但这模糊和虚幻又好像更贴近他本人一些，让他有些心惊。他光滑、苍白的皮肤上有上挑的金色眼睛，然而这似乎与他自身毫无关系，他拥有的只有疲惫的、崇拜的、驯服于命运的神情。黑狐为什么要跟我一起离开呢？车窗里的黑狐对于身后的视线毫无察觉，像一尊凉冰冰的木头塑像。 车开了一夜，黑狐和由没过多久就挨在一起睡着了。由醒来的时候，看见远方橙黄的彩色云霞，这对他来说还是一番新奇的体验。太阳一边升高一边变得明亮起来，变得不可直视，由紧盯着太阳，眼睛很快就刺痛不已，流下眼泪。再睁开时总有一阵眩光，他索性又闭上眼睛歇着。 黑狐的绒毛在阳光下闪着光，每一根毛尖尖都亮晶晶的，被太阳晒得松软香甜。他在一阵熟悉的饥饿中醒来，却贪图温暖和安逸挣扎着想要再睡下去。 车厢尾部的乘客大概是在夜里经停的时候就已经下车，他们手脚很轻。黑狐听到了一点点动静，但也只是耳朵转了转，根本没起身。 由上手揉了一把黑狐的脊背。 “干嘛？”黑狐凶狠地摆动了下脑袋，身子没动，尾巴甩了半圈换了个方向团住身体。 “平时可都是黑狐叫我起床，今天难得我比黑狐醒得早。当然也要叫醒你。” 天地撕开了一层灰蒙蒙的影子。由不再盯着陌生的太阳，视线只追着阳光透过车窗在黑狐身上留下的漂亮斑纹。“平时”这个词语像个魔咒，又把他们拖回了昨天晚上避而不谈的话题。 “神社里的大家，现在都在做什么呢？”由镇定地、慢吞吞地保持着寻常。 “如果是在平时，大概是岚昼刚做好早饭招呼大家吃吧。狭塔先生带着金鱼们做清扫，足部先生们赶去卖那些毫无用处的签……啊，今天的伊势先生的节目我看不了了可恶……” 他们当然知道这日常已经被打破了。 由拒绝用膳，影子暴动，狭塔先生准备清扫由，岚昼选择偷偷放他们离开，而黑狐，他在信和由之间选择了由。从信动手锁住黄昏以来延续的几百年的闹剧终于要画上一个句点。 “由是不是从一开始就知道？” “知道什么？” “用膳的事情。” “多少知道一些。”由叹了口气：“信在持续的衰弱，但是他还是告诉了我很多事情。” “果然如此。” 黑狐顿了一下才接上之前的话：“没关系，有我在，我们已经离开了。” 黑狐的声音听上去像是含着什么糖果一样。妖怪的记忆比起人来说长久而清晰，他总还能记起信最初的样子。柔软又温和的白狐狸有流畅卷曲的蓬松毛发，对待每一个妖怪都细声细气。他同情又悲悯，是黑狐梦想着能够成为的。他们一族眼睛都不好，没有办法选择合适的用膳对象，注定难以像其他妖怪一样成长，黑狐以前从没想过放弃。但是唯一的一个，唯一的这一个，唯一它能够看见的这一个，他不能。 信，我大概没有办法成为你。对不起。 黑狐有无数声道歉要说，但是在一切结束以前，他要保护由。这些道歉声、他想和信说的一切，在黑狐脑袋里空荡荡地咯咯回响。 “不知道灯吾和秋良怎么样。昨天晚上没能去赴约他们会怎么想呢？难得成为朋友……” “还能见到新的朋友的，一定。” “黑狐，如果……”由吐出几个字，又吞回去：“不，没什么，一定还能遇上新朋友的，更何况黑狐一直在我身边。” 到下一处建筑物之前，再说点什么。到出站之前。到下一个隧道之前。电车速度太快了，他们总赶不上说话的时机。列车早已行驶到他们俩谁都不认识的地方，他们潦草地向往日的生活告别，来不及厘清他们如今的关系。 03-旅馆他们终于到达了票根上的温泉旅馆。 实话说，这个旅馆实在是偏僻到让人怀疑是否能赚够钱。他们下了电车又等了很久的巴士，最后还是一个杂货店的老伯说要去附近取货，才把他们带到了旅馆所在的山脚下。 等到由终于泡进池子里的时候，已经是又爬了半天山以后的晚上了。 “黑狐，你知道这里为什么这么偏僻吗？”由搭了条毛巾在头上，懒洋洋地漂着。 “别作弄我，你也感觉到了吧。” 黑狐不肯下水，只是尾巴轻轻搭在池子边蘸湿尖尖，偶尔扫过由肩膀上的伤痕。由哗啦一声猛地站了起来，黑狐被吓了一跳，随即就被由拖进了水里。 “喂喂喂，”他愤怒地变成人形跌坐进池子，伸手把由也扯倒。以人之姿触碰到对方的皮肤，在以往好像没有什么，可是这个蒸汽腾腾的温泉池里，好像一切都有所不同。黑狐看见由也有点呆愣，他漂亮的金色眼睛瞪圆了一些，笔直地砸向下方。他们抱了个满怀。 黑狐实在是太瘦了，由模模糊糊地想着。 他们洗了长长的热水澡，直到皮肤都微微发皱才出来，黑狐头发上还滴着水，也不乐意再变成狐狸形象。 旅馆主人家毫不意外，递上了两碗香香甜甜的黑豆粥，然后邀请他们一同去烤火。活动室里坐着许多客人，大家各自凑成一堆。主人家的小女儿正和另一个有白绒绒的长耳朵和玻璃珠一样的红眼睛的妹妹头小姑娘头凑在一起玩花牌。几只黄鼠狼在靠窗的一桌打着牌吃熏肉，角落里还坐着只打了一半毛线就睡着了的灰熊。 “平时也并没有这么多人的，”旅馆主人解释道：“他们来跟我母亲道别。” “正巧你们赶上了，就请留下一起看看吧。” 旅馆主人的母亲是个面庞很白净的老太太，穿着庄重的黑留袖礼服，头发一丝不苟的梳在后脑勺，发间簪着一小朵樱花，正从灰熊手里拿开毛线团，帮她披上了间绘着红叶图样的绒毯。 “这个季节怎么还有樱花开着？”由忍不住出声询问，黑狐却早已忍耐不住饥饿从他身边离开，去汤锅里盛了碗肉。白萝卜煮的肉汤上方漂浮着厚厚白白的蒸汽，蒸汽里面有野猪一整年的美好记忆，从春天的苜蓿草，夏天红艳艳的野莓，到秋天厚厚的金色落叶和橡子。 “我的父亲和母亲是春天认识的呀。”主人家笑起来。他是个胖胖的中年，眉眼间依稀能看出曾经的英俊。 黑狐不耐烦等肉汤凉下来就想尝尝，结果舌头被烫到，疼得呼呼直吹气，碗上方好不容易凝出的一小枝茎叶也被吹散开。店老板去厨房端了一盘冰草出来，顺便就坐在他们旁边。 那是很多年以前。那时候我母亲还是个小女孩。 我们家从祖上就在经营这个小旅馆，妖怪和人的生意都做，可是最早的时候主要还是做人的生意。那时候我们这里还没通巴士，去进货要走很远的山路。有一次我外祖父出门进货，被头上长着犄角的青灰色鬼怪拦住了。 “小太郎，有没有红豆呀？我三天后就要结亲，现在种红豆就赶不上娶媳妇了。我拿花豆跟你换。” 一捧红豆换回了三捧花豆之后，我们家就开始做妖怪生意啦。 照我外祖父的话，他后来娶到了山婆婆的女儿，生下了我母亲。可是我们都知道，外祖母以前是北川——就是你们坐电车到的那边的百货店员，家里是开点心铺子的。不过我母亲是真的从小就和妖怪打交道，歌子姑娘同她做了几十年的小姐妹。喏，正在和我女儿玩的就是她。 老板提到的那位兔子小姐似乎能听见这里的小声谈话，仰起脸冲着黑狐笑了下，又埋头看起手里的牌。 黑狐看着那边玩心起了有些坐不住，只又从盘子里薅了小半根冰草假装咀嚼。吃着却发现滋味好极了，店里特调的酸甜酱汁裹着一包鲜甜的汁水，随着咀嚼迸出雪的清香。 “由，快尝尝这个。”黑狐嚷嚷着招呼，用三根指头捏起就往由的嘴巴里送。 店老板也不着急讲故事——反正也只是长夜里的消遣。他扭头看了看自己女儿，小女孩双手撑着地板，聚精会神对外界毫不关心，头上顶着的粉白色堆纱蝴蝶结长长的飘带垂在地上也不管，便又转身讲起古。 我讲到哪里啦？我母亲和歌子姑娘——哦哦，那是一年秋天，歌子姑娘像往常一样进入了写作赶稿期。红叶对山兔来说是最好的材料，他们一族在秋天都非常忙碌，赶把故事写在红叶上，好让故事顺着北上川漂到别的地方去。歌子姑娘在故事里偷偷塞了自己的信。 “给谁的信？” “随便谁都好，谁捡起来就归谁啦。” “我知道，一定是你母亲捡到了信！” “黑狐，不要随便打断别人的故事。”由叹了口气：“然后呢？” 是河岸那边的槐树捡到了信，她用信和我母亲换了头花，如今每到槐树掉光叶子，我都会用丝带在树枝上扎蝴蝶结。喏，就是那种。 黑狐和由探头向外面看，雪还在下，积了小半个窗户，隐隐能看到的远处的确有一棵树枝上扎着花花绿绿的廉价丝带的树，好多被冻在冰凌里，显得有些滑稽。 她们通信了一整个秋天，成了非常要好的朋友。到了冬天，我们家破天荒接到了一整个兔子旅行团。我们家在镇上定做的浴袍一向是两种纹样，一种是艾草纹的，一种是红叶纹的，每天交替轮换。打电话预定的时候领队就跟我姥姥强调了好几遍坚决不要红叶纹，她赶忙又下了一批加急订单，才勉强让兔子们都有浴袍穿。 樱花开始冒出花苞的时候，我母亲收到了邀请信去参加妖怪集会。那是一场鹿的婚礼，邀请了山里山外年轻的家伙们和新人一起庆祝，除了我们家以外，卖手工艺品的那家的儿子还有那边的作曲家一家都去了。我父亲也在场。他在篝火会上邀请我母亲：“你好，人，我喜欢你的眼睛。你要跟我一起跳舞吗？” 老太太收拾了一圈屋子，拎着装着五颜六色的毛线团的藤编包走过来。“三吉，你在说什么呀？”她年纪很大了，眼白已经变成淡淡的黄色，睫毛灰白稀疏，眼皮像塌方的奶油布丁一样遮住瞳孔。浅褐色的斑点融化在她的脸上和手上。和同样外表年老的狭塔先生完全不同，她身上有一点气味——经过了仔细地打理却依然难免会有的，除了厨房的油烟以外的，一点点靠近死亡的，隐隐的陈腐气味。黑狐吸了吸鼻子，打了个喷嚏。 你们在聊这个呀。她一边说一边在店老板搬过来的铺着厚厚一层棉花垫的摇椅上坐下来。 那时候呗也只是一只小鹿，头上的角茸茸的，眼睛清粼粼像金棕色的蜜糖，我一看就喜欢的要命。他跪坐在靠近水獭合唱团的那边，和一只长尾山雀说话。那只长尾山雀非常非常圆，按照歌子的话来说是毫无身段，简直要怀疑她还能不能飞。她站在呗的角上，在他身上跳来跳去。我心酸极了，除了紧紧攥住歌子的手以外不知道还能做些什么。歌子，满怀着对我的同情和对故事素材的渴望，在默默承受我通过手指甲传递给她的痛苦以外，帮我牵了线。后来我才知道，妖怪们看我和人看妖怪们完全不同，呗从一开始就注意到我啦，不过如果不是歌子牵线，他也很烦恼要怎么才能跟我搭上话。 “好。”我这么回答他，一手提着裙子，一手搭在他角上。 我们跳舞跳了一整天，合唱团累得不肯再唱歌的时候刚结束巡回的狐狸乐团从东京的大饭店赶了回来，红先生拉小提琴实在太美，谁也不想停下舞步。对了，红他最近在免费为他表亲开的冰下餐厅表演，你们记得去尝尝。到后半夜宴会终于散场，新婚的鹿顶着大家新编好的花环和大家告别，奔跑起来准备去海边度蜜月。来宾们各自回家，只留下新郎新娘的近亲收拾残局。我跳舞跳得太久，停下来才感觉到两条腿沉甸甸又酸又痛，简直不像自己的，完全没办法动弹，只好让其他人先走。 “这太危险了。”由在很多时候会忘记妖怪是一种什么样的生物，小命大人对待他就像对自己的亲弟弟一样疼爱，他总忍不住沉溺于其中。但是有时候，他总还是会记起梦里偶尔浮现的无法对抗无法填埋的饥饿，和七年前泛着水腥气的饱胀的夜晚。 老太太看起来知道他在说什么，但她还只是笑眯眯的。 呗把我载回了家。他们汲水熄灭了火堆，把没吃完的和果子埋好，等到最后一只醉醺醺的水獭也翻身噗通一声倒进洞里才准备一起离开。我坐在他背上，他的毛皮亲亲热热贴着我的纱裙。他跑得又轻盈又稳重，蹄子踏在泥土上柔得像只是碰了一下，不像他弟弟那样跳来跳去的一会儿踩在石头上，一会儿去树干上借个力，我喝了很多果子酒——我当然会饮酒，我们参加的可是婚宴，但是在他背上时一点没觉得晕。分开的时候我在他脑门上亲了一口。 黑狐不知道想到了什么，突然害羞起来。他脸红透了，耳朵背到脸后又转回来，尾巴甩来甩去。被由一把摁住又趁手捋了一把尾巴后吓得差点跳起。“后来呢？”他强作镇定又坐了回去，瞪了由一眼，在桌子下猛踢由的小腿。 第二天呗就在我家门口扔了两筐山货要提亲啦。筐子里堆了满满的菌菇竹笋板栗什么的，最上面还放了一把新鲜的水芹。我们的父母都不乐意见到我们的婚事，但是他们才不能阻挡我们相爱。我们俩在河谷那边搭了一间小窝，每天都呆在一块儿。 但是后来就不行啦，我受不了冬天没有暖炉，也放心不下家里的生意。他也总忧心忡忡的，生怕伤到我。你们知道的，总有一些难以忍耐的时刻，他还很年轻，也不总是能很好的压抑食欲。但最重要的是我们始终没有一个孩子。我们还是分开了。 “是因为用膳。”由默默想着。而黑狐很久都没有捣乱，连喘息声都轻了些。 我们分开以后，呗还是会来见我。头几年我们见面很频繁，有时候他会夜里来，也不让我点灯，这些时候他会和平时有些不同。三吉就是在这样的某天晚上来到我们身边的。三吉出生以后我高兴疯了，整日计划着再给三吉添个弟弟或者妹妹。呗被我缠得没法子，但有一次我实在忍不住，偷偷点了夜灯看了他的脸，因为太陌生了我吓得大叫起来。他什么也没解释就只是盯着我看了很长的一眼，之后再也没跟我见面。 “是凭依吗？” “是呀，他借了凭依。” “你后悔吗？” “后悔什么？和妖怪相爱？生下孩子？还是发现爱人的秘密？我不后悔，因为人生来就是只能往前走的呀。这么有趣的人生是我最骄傲自满的宝物。”老太太似乎感觉到了什么，看向门口的方向。 由这才发现所有的动物都停下了手中的动作，看向门口。不知什么时候开始，那里立着一位英俊的男士，他有一双焦糖色的迷人的眼睛，棕栗色的短碎发被梳得很整齐。他很高大，与故事中的年轻小鹿已经截然不同，却显然还处在并将长期处在妖怪最黄金的年龄。 “我要把我最珍贵的宝物交给你作为最后的嫁妆啦。”老太太向着他伸出双臂。 呗把老太太从摇椅上扶起来，仿佛她还是年轻的样子，眼睛里的浓情让人眩晕。 “我来接你回家。” 04-祭典他们在旅馆呆了很久。 仪式当然没有在旅馆进行，他们和其他客人一样，都只是远远目送那只漂亮雄壮的公鹿载着老太太奔向河谷那一边，好像要去补回他们应有的蜜月。 客人们一直留到了葬礼之后。步美每天都和歌子小姐以及黑狐玩得很晚，早上总是赖床不肯去上幼儿园。 葬礼定在春天，老太太亲口圈定了日期，那是樱花开始落下的日子。骨灰罐子里空空的，呗先生也来了，他向里面撒了一把花的种子。他和店老板很少交谈，这对父子在很多时候都太不像一对父子，周围的人反而对他们之间的冷漠气氛更加习以为常。 “父亲，步美的生日会您会来吗？她很崇拜您。” “我不会再出面了。”鹿摆了摆头，准备离开，最后望了一眼自己的孩子：“她应该多一些人类朋友。” 葬礼之后，他们也不好意思再住在旅馆，倒是店老板很开明。 “如果没有地方可去，也不知道怎么维生，就帮我干一段时间的活吧。” 因为这句话他们又在这里住了大半年。快到夏天的时候，他们用一只非常漂亮的丝绒蝴蝶结和槐树换了一大锅槐花，去了冰下餐厅。尽管冰下餐厅在雪化的时候就搬离原址建到了树上，大家还是习惯叫过去的名字。红先生早已经离开，他们没能听见精妙绝伦的小提琴演奏，但是他们还是吃到了很美味的烤鱼，已经能排入黑狐个人口味榜前三名了（这是非常高的评价）。秋天的时候，河边果然漂来了兔子们在红叶上连载的故事，但是黑狐和由一致认为还是伊势先生的节目更有趣一些。步美的生日宴会上邀请了许多小葵花班的小孩子们，店老板定做了三层的樱桃奶油蛋糕，给每一个到场的人类娃娃都发了温泉券和一包巧克力糖带走。步美清点礼物的时候发现有一只多出来的金色的摇铃，装在亮闪闪的包裹里，没有署名也没有贺卡。她偷偷摸摸告诉了黑狐：“这是爷爷给我的。我新年的时候只跟他说了我想要这个。” 北川的祭典在入冬之前。这是一场庆祝一年的丰收的节日。店老板一早就准备好了许多宣传单，到车行租了一辆小面包车准备去祭典上摆个摊子派发。据说政府要修一条通向山顶的路，附近的物产店都摩拳擦掌准备大干一番。 黑狐恳求他：“卖章鱼小丸子吧！一定能大赚一笔的！谁不爱吃章鱼小丸子呢。” 他们卖的当然不是章鱼丸，而是玉之汤的招牌豆粥和野菜沙拉。豆粥用非常薄的塑料小碗装着，每碗附赠一把竹勺和一张染的非常漂亮的红叶传单。沙拉用蛋筒盛着，裹一层牛皮纸递给客人，牛皮纸上也提前印了玉之汤的招牌和电话。黑狐和由都觉得沙拉可能卖不掉，在路上争论了一路该如何处理剩下的野菜，没想到沙拉竟然是最受欢迎的小吃之一，摊位上忙得不可开交。 快到巡游的时候店老板才放由离开：“好啦，去玩会儿吧。”他从零钱盒子里摸了一把，胡乱塞到由手里。 由和黑狐散漫地逛着摊。黑狐立在由的脑袋上指了方向，总之先得吃到章鱼烧。 “黑狐，我们会一直呆在这里吗？” “啊……我不知道。黑狐大人在哪里都能过得很好的。由呢？想一直呆在这里吗？” “未来啊……难得我也在考虑未来的事情了呀。” “说什么傻话。” “是是是。”由眯着眼睛笑出声。他买了两盒章鱼烧，店家帮他包好装在袋子里。 “从葬礼那天以后，信再也没在我的梦里出现，也没有再跟我说过话。” “有段时间我总分不清自己和祂有什么不同，不清楚自己究竟是谁。祂的记忆又长又波澜壮阔，即使我只能看到一点片段，也还是容易沉溺其中。如果不是靠着黑狐，我大概根本没有办法成为一个可以称为人的个体。因为有黑狐在，所以我是由。拥有黑狐大概是我最幸运的事了。” “现在我只是我自己了。” “你还有我。” “嗯。我还有你。” 章鱼烧的老板送的礼品是免费的观览地图，沿着红笔的痕迹可以不走回头路的逛遍物产商会的所有店家，然后到达“最佳”的巡游观览地点。黑狐指挥着由冲冲冲，经过每一个摊子都要玩上一阵子。所有曾经因为没有零花钱而不敢尝试的项目都非常奢侈地来一回。听到巡游队伍的声音时，他们距离那边还有好远，前方则是密不透风的人群。 “啊——，都怪店老板准备了太多材料不妨我们离开，在这个位置根本什么都看不到嘛。”黑狐大声嚷嚷着。 “安心，别着急，店老板说在哪里都能看到的。” 那是一辆巨大的花车。花车上有摇着金铃的巫女，端坐着的戴着假面的祭祀顶着一双树杈形的威严而锋利的角。乐师隐在帷帐后吹奏乐曲，推着花车的人们和着鼓点喊着号子。 那双角上分明还有些什么，只是他们离得太远有些看不清。他们被人潮推着挤进里层，黑狐被挤落下来差点被踩到，他赶忙变成人的样貌，趁着无人注意直起腰来。由伸出手臂抓住黑狐伸过来的手：“我抓住你了。”他们的手再也没分开。 那双角上插了几只彩色的毛线团，如今已经显得陈旧，颜色变得有些灰暗。祭祀扭过头朝他们这边望了一眼又端正坐好。他们跟着人潮随花车一起向前，但还是距离越来越远。 “那是奶奶的毛线团。” “嗯。” 他们看着对方，然后就接吻了。这个亲吻没有预谋，没有犹豫，没有过分仓促，却也不像是暧昧之后的水到渠成。它只是发生了。他们很不熟练，有好久都只是贴在一起什么也没做。黑狐眼睛瞪得很大，直视着正同样眼睛大睁着的由。 “我听说人类接吻会闭上眼睛。” 两个家伙又靠到一起，用嘴唇在对方脸上、下巴上、喉咙上来回摩挲。 “这还是不对，接吻的范围应该没有这么大。” 然后终于某一个，经常看电视的那一个反应了过来：“由应该知道怎么做的吧？” 金色眼睛的那个坏家伙这会儿终于笑出了声：“对不起，我也忘记了嘛……”他张开手臂把另一个拢在怀里，闭上眼睛亲上去。 “唔……” 黑狐感觉到了一种没有任何责任的情绪高涨，兴奋的、飘忽的想要傻笑的冲动，还有一点点痒。由的舌尖在他出声那会儿伸进了他的口中，在他上下两颗犬齿间。微微的眩晕感伴随着一点逃避和放纵，让他空空的胃袋泛出一阵欲望。这突然袭来的饥饿让他清醒，这恶毒的提示让他僵硬着脊背，任由做出花样而不能回应。这是一个漫长又青涩的吻。黑狐终于捱过了突然袭来的饥饿后也热切而甜蜜地学习了由的动作，直到两个人都厌烦了这个新游戏为止。 巡回结束，零用钱花了个精光，由和黑狐往停车场那边走去提前等着店老板。 “黑狐的用膳对象，会是什么样的呢？” 会是什么样呢？黑狐回想起好多年以前，他见到的小少年，他和此前的许许多多任凭依一样，在神社的空房间等着自己，但是他和前面所有的人类都不一样。具体是哪里不同他当然不晓得，因为他只看得见这一个。从此，他了解了爱、认识了饥饿和焦渴、学会了忍耐和克制。他从所有人手中保护这个脆弱的宝物，包括他自己。 “你、你说什么呢！明知道黑狐大人眼睛不好，是在捉弄我吗？” “那，如果黑狐一直找不到自己用膳对象的话，就请吃掉我吧。” 黑狐喉咙里发出了一声短促的元音，挣脱开两人牵着的双手：“再说这样的话我要生气了。” “我是认真的。在我死去之前，黑狐把我吃掉吧。长久的、永远的记住我，记住我们的回忆。”由声音轻快，把黑狐的手重新握到手里：“约定好了。” 过了很久黑狐才找回自己的声音：“嗯，约定好了。”","link":"/2020/01/04/奔逃/"},{"title":"常见面试问题2","text":"编程基础和操作系统 1. 编程基础概念辨析多态：类的多态和函数的多态一个实体同时具备多种形式，在特定情况下，表现不同的状态，对应不同的属性和方法。C++中主要体现在运行和编译两个方面。C中通过钩子函数挂接才能达成同样的效果。 C++中主要通过虚函数实现，也可以通过抽象类、覆盖（重写）、模板。（重载和多态无关） 封装：将抽象的道德数据和行为或功能相结合，形成有机整体“类”，数据和函数都是类的成员。 封装增强了安全性，简化了编程。 重载和重写：重载overloading：不同的函数，相同的函数名不同的参数个数或者类型。调用的时候根据参数来区别。对权限没有要求。 重写overriding（覆盖）：在派生类中重新对基类中的虚函数重新实现。函数名和参数都一样，只是函数的实现体不一样。调用的时候根据对象的类型来区别。被重写的方法不能拥有比父类更严格的权限。 重写是子类和父类之间的关系，是垂直关系，发生在继承中。重载是同一个类中的方法之间的关系，是水平关系，发生在一个类中。 虚函数：用virtual关键字申明的函数，虚函数一定是类的成员函数。虚函数理解教程 纯虚函数是虚函数再加上=0 纯虚函数：virtual void fun()=0;即抽象类，必须在子类中实现这个函数，即先有名称，没有内容，在派生类实现内容。 继承派生：闭包、垃圾回收的概念和过程：java中的概念 不懂 例题：多集成中派生类对象结构例题：虚函数表构成存在虚函数的类都有一个一维的虚函数表叫做虚表，类的对象有一个指向虚表开始位置的虚指针。虚表和类对应，虚表指针和对象对应。 例题：虚函数实现多态的原理在基类函数前加上virtual关键字，在派生类中重写该函数，运行时根据对象的实际类型来调用相应函数。如果对象类型是派生类，那么就调用派生类的函数，如果对象类型是基类，那么就调用基类的函数。 例题：构造函数可以定义为私有吗？ 将构造函数声明为私有,可以确保本类以外的地方都不能实例化这个类 。 标准的单例模式就是构造函数私有。 1234567 class A{ private: A() {} static A a; public: static A&amp; Instance() { return a; }}; 编程语言的区别JAVA/C/C++/SCALAC是面向过程的。JAVA和C++是面向对象的。SCALA比较新。 面向对象编程与函数式编程面向对象编程：封装、继承、多态；相对于面向过程而言的 基于对象编程：支持类但不支持多态，不提供抽象、继承和重载等有关面向对象语言的功能。 例题： C++弱指针，智能指针weak_ptr 防止内存泄漏STL提供的智能指针一共有四种：auto_ptr(已经淘汰)、unique_ptr、shared_ptr和weak_ptr。 unique_ptr： shared_ptr：shared_ptr使用引用计数，每一个shared_ptr的拷贝都指向相同的内存。在最后一个shared_ptr析构的时候，内存才会被释放。 weak_ptr：是一个引用计数型智能指针，不增加对象的引用计数，即弱引用。弱引用并不修改该对象的引用计数，这意味着弱引用并不对对象的内存进行管理，只要把循环引用的乙方使用弱引用即可解除循环引用。 弱引用的智能指针weak_ptr是用来监视shared_ptr的，不会使引用计数加一，它不管理shared_ptr内部的指针，主要是为了监视shared_ptr的生命周期，更像是shared_ptr的一个助手。weak_ptr没有重载运算符*和-&gt;，因为它不共享指针，不能操作资源，主要是为了通过shared_ptr获得资源的监测权，它的构造不会增加引用计数，它的析构不会减少引用计数，纯粹只是作为一个旁观者来监视shared_ptr中关连的资源是否存在。 weak_ptr还可以用来返回this指针和解决循环引用的问题。 strong_ptr是强引用，只要有一个指向对象的shared_ptr存在，该对象就不会被析构，直到指向对象的最后一个shared_ptr析构或是reset()时才会被销毁。利用weak_ptr可以解决常见的空悬指针问题以及循环引用问题。 例题：C++的内存和memory leak，编译过程中的内存分配内存泄漏(memory leak)是指由于疏忽或错误造成了程序未能释放掉不再使用的内存的情况。内存泄漏并非指内存在物理上的消失，而是程序分配某段内存后，由于设计错误，失去了对该段内存的控制，因而造成了内存的浪费。 （1）堆内存泄漏 （Heap leak）。对内存指的是程序运行中根据需要分配通过malloc,realloc new等从堆中分配的一块内存，再是完成后必须通过调用对应的 free或者delete 删掉。如果程序的设计的错误导致这部分内存没有被释放，那么此后这块内存将不会被使用，就会产生Heap Leak.（2）系统资源泄露（Resource Leak）.主要指程序使用系统分配的资源比如 Bitmap,handle ,SOCKET等没有使用相应的函数释放掉，导致系统资源的浪费，严重可导致系统效能降低，系统运行不稳定。 例题： const的使用（指针数组和数组指针辨析）12345678const int *p; //修饰int 即*p指向的内容不变int const *p; //修饰int 即*p指向的内容不变int* const p; //修饰int* 即*p不能改变指向的地址const int* const p; //都不能变const int a = 10;const int &amp;b = a;const int &amp;c = 20; 2. 操作系统进程和线程：一个进程可能包括多个线程线程是操作系统能够进行运算调度的最小单位，它被包含在进程之中，是进程中的实际运作单位，可以使用多线程对进行运算提速。 进程之间通信：管道：半双工；只用于具有亲缘关系的进程；特殊的文件，可以read、write但只存在内存中；速度慢，容量有限 FIFO：命名管道；任何进程间都能通讯，但速度慢 socket： 消息队列：消息队列，是消息的链接表，存放在内核中。一个消息队列由一个标识符（即队列ID）来标识； 容量受到系统限制，且要注意第一次读的时候，要考虑上一次没有读完数据的问题 信号量：不能传递复杂消息，只能用来同步 共享内存区：能够很容易控制容量，速度快，但要保持同步，比如一个进程在写的时候，另一个进程要注意读写的问题，相当于线程中的线程安全，当然，共享内存区同样可以用作线程间通讯，不过没这个必要，线程间本来就已经共享了同一进程内的一块内存 例题：线程如何创建？如何实现互斥？线程池怎么创建？有几个线程？都执行一个函数吗？线程锁？有两种常见的创建线程的方法，一种是继承Thread类，一种是实现Runnable的接口，Thread类其实也是实现了Runnable接口。但是创建这两种线程在运行结束后都会被虚拟机销毁，如果线程数量多的话，频繁的创建和销毁线程会大大浪费时间和内存，因为线程执行完毕后死亡，线程对象变成垃圾。使用线程池可以让线程运行完后不立即销毁而是重复使用，继续执行其他的任务。参考执棋手的博客 C++中的多线程类Thread。头文件为#include,通过std::thread应用。 构造函数 ThreadPool()： 开启一定数量的线程，每开启一个线程，让该线程进入死循环，对接下来的操作，先利用互斥锁先加锁，再利用条件锁判断线程任务列表是否为空，若为空即阻塞该线程（就是没人办理业务时进入待机状态）。接下来，从任务列表中取任务，然后解开互斥锁，让其执行完后再重复以上操作。对于开启的每一个线程都是如此。 添加任务函数 enqueue()： 先获取任务，加互斥锁，将该任务加入任务列表，解锁，然后唤醒一个任务，让其进行等待。 析构函数 ~ThreadPool()： 唤醒所有的工作，让线程一个个的执行。 12345678910111213141516171819202122232425262728293031323334353637#include blablablatypedef struct { int first; int last; int result;} MY_ARGS;void* myfun(void* args){ int i = 0; MY_ARGS* my_args = (MY_ARGS*) args; int first = my_args -&gt; first; int last = my_args -&gt; last; pthread_mutex_lock(&amp;lock); for (i = 0; i &lt; 10000; i++){ s = s + arr[i]; } my_args -&gt; result = s; pthread_mutex_unlock(&amp;lock); return NULL;}int main (){ int i; pthread_t th1; pthread_t th2; pthread_mutex_init(&amp;lock, NULL); MY_ARGS args1 = {0, 2500, 0}; MY_ARGS args2 = {2500, 5000, 0}; pthread_create(&amp;th1, NULL, myfunc, &amp;args1); pthread_create(&amp;th2, NULL, myfunc, &amp;args2); pthread_join(th1, NULL); pthread_join(th2, NULL);return 0;} 例题：在Windows的一个磁盘下新建文件夹的系统操作过程例题：在Linux系统中如果已知一个进程名，怎么输出PID号？ （ps和top命令？ ps -ef |grep “name” | grep -v grep ps -ef | awk ‘/[n]ame/{print $2}’ ps -x | awk ‘/[n]ame/{print $2}’ pgrep -f name 例题：Linux的进程调度在处理器资源有限的系统中，所有进程都以轮流占用处理器的方式交叉运行。为使每个进程都有运行的机会，调度器为每个进程分配了一个占用处理器的时间额度，这个额度叫做进程的“时间片”，其初值就存放在进程控制块的counter域中。进程每占用处理器一次，系统就将这次所占用时间从counter中扣除，因为counter反映了进程时间片的剩余情况，所以叫做剩余时间片。 Linux调度的主要思想为：调度器大致以所有进程时间片的总和为一个调度周期；在每个调度周期内可以发生若干次调度，每次调度时，所有进程都以counter为资本竞争处理器控制权，counter值大者胜出，优先运行；凡是已耗尽时间片（即counter=0）的，则立即退出本周期的竞争；当所有未被阻塞进程的时间片都耗尽，那就不等了。然后，由调度器重新为进程分配时间片，开始下一个调度周期。 目前，标准Linux系统支持非实时（普通）和实时两种进程。与此相对应的，Linux有两种进程调度策略：普通进程调度和实时进程调度。因此，在每个进程的进程控制块中都有一个域policy，用来指明该进程为何种进程，应该使用何种调度策略。 Linux调度的总体思想是：实时进程优先于普通进程，实时进程以进程的紧急程度为优先顺序，并为实时进程赋予固定的优先级；普通进程则以保证所有进程能平均占用处理器时间为原则。所以其具体做法就是： 对于实时进程来说，总的思想是为实时进程赋予远大于普通进程的固定权重参数weight，以确保实时进程的优先级。在此基础上，还分为两种做法：一种与时间片无关，另一种与时间片有关； 对于普通进程来说，原则上以相等的weight作为所有进程的初始权重值，即nice=0，然后在每次进行进程调度时，根据剩余时间片对weight动态调整。 例题：日志分析用到的shell命令CSDN上的一个总结博客 例题：Linux地址管理，分段，分页例题：进程内存总大小，虚拟内存和物理内存，砖石继承","link":"/2019/11/15/常见面试问题2/"},{"title":"丧尸狗","text":"写在前面因为咕咕了所以只有一个章节，我真的因为这篇学到了很多吉儿的说法。个站最好的就是可以随意开黄腔了对吧？反正也没人看也没人理哈哈哈，理我了我也看不到的，没设提醒。 第一章IT WAS so hot you could stick a chicken in the trunk of your car and two hours later it would be parboiled to perfection. I would have passed out from the heat, but the mere thought of having to pick myself up off the ground later was too much to bear. A few moments before, I had peeled off my shirt. Now I was seriously considering ripping off my baggy cargo shorts too. Sweat burned my eyes. I took a moment to wipe my brow with a sodden forearm, which did no good whatsoever. With a monumental sigh, I took a firmer grip on the shovel and proceeded to dig the goddamn grave a little deeper. 天气太热了——如果把活鸡放进车的后备箱，两小时后它就能熟透。我总觉得我会因为这样的高温昏倒，但仅仅是想一想之后得自己从地上爬起来就让我感到精神受创。几分钟以前，我扒下了衬衫。而现在，我正认真地考虑把工装短裤也脱掉。汗水灼烧着我的眼睛。我用湿漉漉的手臂擦了额头，理所当然的一点作用也没起到。深呼吸一口气，我握紧了铲子，把那该死的坟墓挖得更深。 And while I was at it, I thought I might as well make the hole a bit longer too. The last visitor who’d discovered our little corner of paradise had been a tall sucker. He had probably been a real hunk back in the good old days. Not now, of course. Now he was just ugly. And tall and beefy and smelly and cranky and harder to kill because of his size. Just my luck. If left to rot beside the front porch where I had knocked his brains out earlier with a claw hammer, he would have stunk up the place in no time flat. Especially in this heat. 我想过也许可以把这个洞穴挖的更长一些。我们天堂般的安乐窝的上一个访客是个高个儿家伙。在过去他也许是个真正的帅哥，但现在显然不是，现在他只是个丑东西。他高大、肥胖、难闻、恶心而且因为他的身高而极其难搞。我杀死他只是因为足够幸运。我在前廊用羊角锤把他的脑浆砸了出来。如果放着他这滩东西不管，显然会让整个地方都立即发臭，尤其是在这种高温下。 I don’t know why we couldn’t have our lives threatened by a nice midget now and then. Or a third-grader. Or maybe some feeble ninety-two-year-old grandmother with a walker. But no. All our homicidal visitors looked like lumberjacks. Even the girly visitors were brawny and mean. Back before the world went to shit, those girly visitors must have been cranky motorcycle chicks with leather boots and spiky hairdos, who never got laid because they were just too damned ugly, which I suppose would go a long way toward explaining their nasty attitudes now that they were, for all intents and purposes, as dead as mackerels. 我不知道为什么我们时不时面临的生命威胁不能是一个可爱的小矮人，或者一个三年级小学生，又或者某个带着助步器的92岁的老祖母。但事与愿违，所有那些杀人访客都强壮得像伐木工人。即使是看起来曾是女性的那些访客也孔武有力。在整个世界变成一坨屎之前，这些女孩儿们一定都是那种穿着皮靴留着爆炸头的古怪的机车女，因为太丑从没跟人上过床。我想这在很大程度上可以解释她们现在的恶劣态度，她们不管在什么意图和目的还是什么上，都死得和鲭鱼一样死。 I use the word “visitors” loosely, you understand. It’s just I have a real hard time admitting, even now, after the past two months of dealing with them, that what I had just banged on the head with a hammer on the front porch—rather like driving home a railroad spike—and was now trying to bury underneath the front lawn before it started to reek to high heaven, was actually a fucking zombie. One of thousands. Maybe millions. In the city. In the country. In the world. Yep. You heard me. Zombies. Just like in those annoying old horror movies. Only now they had climbed down off the silver screen and were trying to kill us in real life. And that was really annoying, don’t think it wasn’t. 你知道，我用“访客”这个词其实不太严谨。即使是已经和他们打了两个月交道的现在，我还是很难承认，那位刚刚在前廊被我用锤子敲碎脑壳的（手感像是猛扎了根铁路道钉进去），在开始臭气熏天之前被我试图埋在前面草坪下面的，实际上就是该死的丧尸。他是成千上万的丧尸中的一个。他们在城市里，在乡村中，在整个世界出现。没错，就像你听到的这样，他们是丧尸，就像那些烦人的老式恐怖片里说的一样。直到现在他们才从银幕上爬下来，想在现实中杀死我们。而这的的确确很烦人，别不以为然。 Actually, when I use the word “zombies” to describe these murderous poopheads, it is more of a euphemism than anything else. They aren’t real zombies, you understand. They didn’t claw their way up out of the grave. And they don’t infect you when they bite you either. The world hasn’t gone that screwy. No, these are just people. Sort of. People who used to be our friends and neighbors. Like the guy down the street who mows his grass every Saturday whether it needs it or not, or the florist on the corner who always waves hello when you walk by, or your kid’s first-grade teacher who says she’s sorry she stood your kid in a corner for two hours but good lord that kid’s annoying. People like that. Just ordinary people. But now, of course—well, now, they’re something else. 事实上，当我用“丧尸”这个词语去描述他们的时候，已经非常委婉了。他们并不是严格意义上的僵尸，他们并不是从坟墓里爬出来的，他们咬你的时候也不会让你被传染。世界还没有变得那么糟糕。他们某种程度上来说还是普通人。那些曾是你的朋友或者邻居的普通人。就像街尽头住的那个不管是否有必要都在每周六固定修剪草坪的家伙，或者是街角花店里那个每次你经过都跟你挥手打招呼的老板，又或者是你孩子在一年级时的老师——她曾经为了罚你的小孩在墙角面壁两个小时而向你道歉，但是天知道那小子真的很烦人。他们就是这样的人，这样的普通平常的人。只是当然，现如今，他们已经成为了别的什么东西。 I should also add that when I use the word “dead” to describe these creatures, that is pretty much a euphemism too. Don’t ask me what it’s a euphemism for. Because these guys sure as hell aren’t alive. They just aren’t quite dead either. 我还得加一句，当我用“死”这个词去描述这些生物的时候，还是一个很委婉的说法。别问我这哪里委婉了。因为这些家伙确定肯定一定是死了，但也没有死得那么彻底。 But boy, are they mean. And driven. We assume they’re trying to kill us so they can eat us, but thank God that theory hasn’t been tested yet. If I could have my druthers, I’d rather not test it. 我们预设他们想要杀了我们吃，但是谢天谢地，这个假说目前还没有被验证。如果我还有选择，我就选不去亲身验证它。 I suppose I should introduce myself. My name is Charlie Pickett. That good looking guy lying over there in the hammock, as naked as a jaybird and acting like he’s asleep, is Bobby. Bobby Greene. Bobby’s my lover. We’ve been lovers for about three years now. And a happy three years it was, too, until a couple of months ago when the zombies started showing up. 我想我还做一下自我介绍。我叫 Charlie Pickett。那个光着身子躺在吊床上装睡的帅哥叫Bobby，Bobby Greene。他是我爱人，我们的稳定快乐的恋情保持了三年，直到几个月前丧尸开始出现。 And it isn’t only zombie people Bobby and I have to worry about now. When I say the world went to shit, I mean the whole planet. Now there are zombie bugs and zombie Chihuahuas and zombie grizzly bears and zombie cows and zombies of every size and shape and species imaginable. And if that isn’t enough, we have to deal with the screwy weather. One day it’s freezing, the next day it’s a scorcher, the day after is one continuous lightning storm, and the day after that there’s a tornado whizzing past your head. Jeez, you never know how to dress in the morning. Or what will be trying to kill you before the day is over. 现在，我们要担心的当然不仅仅只有丧尸人。当我说整个世界变成了一坨屎的时候，我指的是整个星球。现在出现的除了丧尸人以外，还有丧尸虫子、丧尸吉娃娃、丧尸熊、丧尸奶牛等等各种你能想象的大小形状和物种的丧尸。如果你觉得这还不够，我们还得对抗糟透了的天气。第一天极寒，第二天就会极热，再接下来是一整天的雷暴，然后紧跟着又是一天有龙卷风从你脑袋上方掠过。你永远无法知晓明天早上该穿多厚的衣服，或者是什么会在今天结束前试图弄死你。 I suppose you’re wondering why Bobby and I aren’t zombies ourselves. Well now, there you have me. Bobby and I have talked this over countless times in the past two months. It seems to us that if God was going to push the reset button and start all over from scratch to repopulate the world with people a little more in line with His own sensibilities—in other words, nice people, as opposed to the bungholes and politicians he had been filling it up with lately—to our way of thinking, surely God would plan ahead and not try to repopulate the joint with a couple of gay guys like me and Bobby. You see what I’m saying? Admittedly, we’re nice enough and all that, but there’s not much chance of building up a new world order with homosexuals, seeing as how homosexuals can’t breed. Not with each other, at any rate. Although, God knows we try often enough. 我猜你很好奇，为什么Bobby和我自己还不是丧尸。好，我来告诉你们。在过去的两个月，我和Bobby已经就这个话题讨论了无数次。在我们看来，似乎上帝在决定摁下重置键选择重构世界，让世人更符合他的喜好——也就是说让好人充满世界，而不是如今的这批烂人和政客时，一定会提前算好，我和Bobby这样的同性恋人群排除在外。你懂了吗？不得不承认的是，虽然我们都是足够好的人，但建立新世界的秩序没可能通过我们这样的同性恋来做，我们是无法繁衍后代的，至少我们俩不能。尽管，天知道我们尝试的足够频繁了。 Plus, as far as we know, Bobby and I are the only two people left standing. We are, in toto, the only non-zombie beings we have seen. Can you believe that? We used to be known as gay people, Bobby and I, but now I guess we’re just people. Or survivors. Or remnants of a civilization. I don’t much care for the sound of that. Anyway, there’s not much need for labels when it’s just you and your lover and a couple of million zombies running around. 再加上，据我们所知，Bobby和我是仅存的两个未丧尸化的人类，也是我们所见到的仅存的非丧尸的生物。你敢相信吗？过去大家叫我们同性恋，而现在我们就能直接被称为人类，或者说被称为幸存者，又或者叫文明的残骸也行。我不太在乎具体的名称。不管怎么说，当这个世界仅剩下你和你的爱人，你们周围还上百万的丧尸在漫游的时候，给自己打标签就真的没有什么必要。 Here’s what happened. 现在来说说之前发生了什么。 A couple of months ago, we woke up one morning in each other’s arms, just like we normally do. Bobby and I have always been snuggly sleepers. We were jarred awake by the screeching of a car alarm outside our two-bedroom San Diego apartment. That car alarm just went on and on and on. Finally, after an exasperating twenty minutes of trying to stuff our pillows in our ears, we tugged on some clothes and stumbled outside to investigate. And lo and behold, that’s when we discovered we were the only two people left. Anywhere. The streets were empty. No hum of traffic or lawn mowers, no rumbling of skateboards, no distant thumping of car radios pounding out rap or golden oldies. Nothing. 几个月前的一个早上，我们像往常一样在对方的臂弯里醒来。Bobby和我一向都是深睡眠者。但这一次我们是被惊醒的。我们当时在圣地亚哥一个两居室的公寓里，门外有个汽车警报器持续响个不停。大概有二十分钟我们都在愤怒中徒劳地用枕头捂住耳朵，但最后我们还是披上了衣服，跌跌撞撞走出门去了解情况。也就是在那时，我们发现自己成了被留下的两个人。街道是空的，没有车流和割草机的轰鸣，没有滑板的声音，没有远处车载收音机播放的rap或是劲舞金曲的鼓点声。任何地方都空无一人。 And while we were standing on the street corner rubbing our eyes and wondering where everybody had gone, the power went out. What was silent before, except for that damned car alarm screeching across the neighborhood, had become dead silent. Stone silent. And then, five seconds after the power went out, the car alarm stopped screaming. 当我们傻站在街角，揉着眼睛思考问什么所有人都走了的时候，停电了。之前就安静着的，除了邻居家那该死的汽车警报器以外的那些，仍然一片死寂，像石头一样默然无声。接着，大概五秒钟后，随着电池被耗尽，汽车警报声也停止了。 We’ve not heard another sound since that moment from another living soul that we did not make ourselves. 从那以后，我们再也没有听到另一个除我们以外的生灵发出的声响。 There had been some talk about massive sunspots before the day of the car alarm, but we’re not sure if that was the cause for everyone disappearing or not. Don’t see how it could be, really. Suffice it to say, they were simply gone. Vanished. Every single person, everywhere. And no bodies were left behind. 在那天以前，我们听过有人谈起突然增多的太阳黑子，但我们并不确定这是否就是所有人消失的原因。我们真的不知道怎么会这样。可以说他们只是走了、消失了。每一个人，在每一个地方的每一个人。而他们没有留下任何尸体。 Bobby and I were alone. And with no electricity, no TV, no radio, no telephones, no traffic noises, no milling throngs of humanity rushing off to work on that eerie Tuesday morning, the silence was absolutely deafening. And creepy. Bobby和我只有彼此。在那个离奇的周二，没有电力，没有电视、收音机、电话，没有交通的噪声，也没有一大群人匆忙赶着去工作的声音。那诡异的寂静震耳欲聋，令人不寒而栗。 But enough about God unplugging and depopulating the world. 但是关于上帝重启或者说毁灭世界的假说就到此为止吧。 In the meantime, the goddamn grave still needed digging, and since it was my turn to dig and bury and Bobby’s turn to nap and look sexy, here I was still slaving away with the blasted shovel and occasionally leering at Bobby’s gorgeous nakedness over there in the hammock. He knew I was watching too. He had his strong, bare legs splayed wide and an arm dangling over the side of the hammock, exposing one beautiful fuzzy armpit and a neatly muscled bicep. He was trailing his fingers back and forth in the grass as he lazily swung there in the nonexistent breeze. Every now and then, I was almost sure I could see one of Bobby’s eyes peek open just to make sure I was watching. When he thought I might be, he nonchalantly readjusted his dick as if by accident. But it was no accident. And if he didn’t stop it soon, I was going to start mistaking the shovel handle for my own dick. One was getting to be just about as hard as the other, if you get my drift, and since it isn’t exactly rocket science, I’m sure you do. 与此同时，这个该死的坟墓还是需要继续挖掘。既然轮到我挖和埋，那么Bobby只需要打盹和看起来性感。我用着该死的铲子埋头苦干，只是偶尔才淫笑着看几眼Bobby在吊床上的绝美裸体。他当然知道我在看他。他光裸的强壮的双腿张开着，一只手臂空悬在吊床的一边，露出毛绒绒的漂亮腋窝和肌肉分明的手臂。他在不存在的微风里懒洋洋地晃来荡去，手指来来回回在草地上划着。时不时的，我几乎可以肯定，我看到他偷偷睁开一只眼睛好确定我在看他。在他觉得我也许在看的时候，他漫不经心地调整了一下他的阴茎的位置并假装只是一个意外。但这当然不是一个意外。如果他不赶快停下来，我大概就要开始把铲子把误认为是自己的老二了。它们很快就会一样硬，如果你明白我的意思，这又不是什么火箭科学，我知道你懂的。 It was late afternoon. Maybe four o’clock or so. Since it was summer, and this was California, the sun was still high in the sky. High and hot. Hotter than usual, of course, since the world had taken a screwy turn for the worse as far as weather went too. I figure the temperature was at about 110. It was humid as hell because two days ago it was snowing. That’s right. Snowing. In San Diego. And as of this morning, the blazing sun began turning that snow into steam. For a while you could actually hear it sizzling on the street like bacon grease popping in a red-hot skillet. Digging the grave, and simmering in my own juices, I was starting to feel like that parboiled chicken I mentioned earlier. 到了下午晚点的时候，大概四点钟左右。一如往昔的夏天的加利福尼亚，太阳仍旧高悬在天上。高，而且热，比一般情况下还要热。当然，世界就和天气一样，已经变得越来越糟糕了。我估计温度是110度左右。两天前的降雪带来了地狱般的潮湿。没错，下雪，在圣地亚哥。而从今天早上开始，炽热的太阳迅速把雪融成了蒸汽。有一阵子你真的能听到地上的雪像热锅上的培根爆出油时一样嘶嘶作响。挖着坟墓，被自己的汗水蒸煮着，我开始觉得自己就是开始提过的那只半熟鸡。 Bobby had a full-fledged hard-on now. He was watching me from the hammock and idly stroking himself at the same time, one hand gripping his cock, the other hand tucked behind his head. He was smiling, no longer feigning sleep. Now he just looked mischievous. God, he was gorgeous. 现在Bobby完全硬了。他在吊床上看着我，懒洋洋地自慰。他的一只手握在阴茎上，另一只手垫在后脑勺下。他笑眯眯的，不再假装睡着。看上去带着点恶意的促狭。他实在是太美了。 “Need some help?” he called out. “需要帮助吗？”他大声问道。 “No,” I said, rubbing my own crotch now. I loosened my belt and eased my shorts down past my knees, watching Bobby all the while I did it just to see what his reaction would be. The open air felt wonderful rustling the hair on my balls, almost like one of Bobby’s gentle caresses. Or the way it felt when he nuzzled me there with his nose. “But it looks like you might need some assistance,” I added with a smile. “不用，”我一边回答一边揉着自己的裆下。我松开腰带，短裤松松垮垮挂在膝盖，做着的时候一直看着他，我想知道他对此会做什么反应。户外的空气拂过睾丸上的毛，那感觉好极了，几乎就是Bobby温柔的爱抚，也像是他在用鼻子摩挲那里。“但看起来你那里可能需要一些帮助，”我笑着补充。 I gave my thickening dick a good shake and a nice long stroke, just to make it stand up proud. Bobby whistled softly. “Bring that over here into the shade where I can get at it,” he said. 我使劲撸了几下，好让欲望骄傲地升起来。Bobby轻轻吹了声口哨。“把它带到这边阴凉一点的地方我好够得着，”他说。 Then I managed to get a grip on something besides myself. Namely, the situation. I reluctantly tugged my shorts back up and tucked Charlie Junior away for another time. Charlie Junior wasn’t happy about it either, I don’t mind telling you. Neither was I. 然后我勉强抓住了自己以外的东西。也就是说，现在的事态。我灰心丧气地把短裤拉了起来，又再一次把小查理塞好。小查理对此表示不满，而我不介意告诉你，我也一样。 “Let me get this Neanderthal underground first. He’s already starting to stink up the place.” “让我先把这个尼安德特人弄到地下。他已经开始熏臭这个地方了。” Bobby gave a monumental sigh and dropped his dick too. Being the gentleman that he is, he hauled his ass up out of that hammock and came over to help. He was still stark naked, of course, and he was still a beauty to look at, don’t think he wasn’t, but to be honest, I didn’t mind putting off sex for a while if it meant I would get some help planting this latest visitor. I did take a moment to bend over and give Bobby’s boner a gentle squeeze and a kiss on the top of its firm little head, just by way of saying hello. The crystal drop of precome glistening there tasted delicious. Bobby heaved up a pretty big moan of discontent when I stopped what I was doing, but it was planting season, dammit. There was work to be done. So after we got the sex out of our heads, we went back to grave digging. Bobby叹了口气，也放下了他的阴茎。作为一个绅士，他从吊床上抬起屁股，走过来帮我的忙。他仍然赤裸着身体，当然，那看起来很美，别以为他不是，但说实话，我并不介意推迟一段时间再做爱——如果这意味着在安排访客这件事上我能得到帮助。我的确花了一点点时间，弯腰轻轻捏了捏小Bobby，在它硬硬的顶端上吻了一下，但只是通过这个打声招呼。顶端渗出的晶莹闪光的一滴味道好极了，当我停下的时候，Bobby发出了相当大的一声不满的呻吟。但该死的我们还有活儿要干。所以当我们终于把性这回事抛出脑海，我们又回去挖坟墓了。 After ten minutes of shoveling and sweating and bitching about the heat, our hard-ons were history. 经过了十分钟的挥汗如雨和咒骂，我们的工作终于告一段落。 When the grave was at a satisfactory depth and width and length, we each took a leg of you-know-who, dragged our visitor to the edge of the hole, and with our naked feet, tipped the bastard in. He landed flat on his back with a thud that sounded pretty doggone eternal, if you know what I mean. Yessir. He was home for good. The creep. 当这个坟墓终于有了我们满意的深度、宽度和长度，我们一人拖住了你知道的那个“人”的一只脚，把这位访客拖到了洞穴的一边。我们光着脚，把这个混蛋扔了进去。他砰的一声背部着地，听上去到达了永恒。是的，那个怪物，他永远地回到家了。 It took Bobby and me another thirty minutes to cover the guy up. When we were finished, we were just about done in. We flung our shovels across the lawn and headed for the backyard of this magnificent San Diego property we’d commandeered a few weeks earlier, and which must have cost several mil back in the days when that stuff mattered. 我们又多花了三十分钟把这个家伙埋好。当我们快要结束的时候，我们把铁锹扔到草坪上，朝着几周前我们征用的这个宏伟的圣地亚哥庄园的后院走去。在还能用金钱衡量物价的过去，这个庄园起码值好几百万。 Behind the mansion was an Olympic-size pool. Since Bobby was still naked, all I had to do was drop my cargo shorts to put myself in the same condition, and hand-in-hand, we cannonballed into the deep end of the pool with a humongous splash. The water was damn near hot from the sun, but still it felt fabulous. 宅第后面是一个奥运会标准尺寸的泳池。Bobby仍然是全裸的，我所要做的就只有脱下短裤，让自己处于和他一样的状态，然后手拉手，像炮弹一样冲进泳池的最深处，激起巨大的水花。水被太阳晒得滚烫，但还是感觉好极了。 For the first time that day, I came to the conclusion that maybe I wouldn’t really die of heatstroke, after all. 在那时，我才得出结论，自己大概不会真的死于中暑。 The pool had not been cleaned for quite a while, since there was no longer electricity anywhere in the city, or pool boys either, for that matter. Not live ones, anyway. As I floated there in the still water, splashing leaves away from my face, Bobby swam up behind me and pulled me into his arms. He nibbled at the back of my neck while his hands reached around to stroke my stomach. His fingers traveled a wee bit south and twiddled with my pubic hair as I tilted my head back to nuzzle his cheek. 泳池显然很久没被清理了，城市里各处早已经停电，这里当然也不再存在清扫工——至少是活的那些。我在静水里漂浮着，叶子在我脸边分开，Bobby游到我身后，把我拉到了他怀里。他轻吻我的后颈，而他的手绕过来放在我的小腹上。我转过头去吻他的脸颊的时候，他的手指向下探了一点，在我的毛发上捻弄。 “I love you,” he said into my ear, and with a giggle, he pulled me beneath the surface. “我爱你，”他在我耳边说，轻笑着把我推到了水面下。 “Glug, glug, glug, glug,” I answered, trying not to drown. “咕噜咕噜咕噜，”我只能勉强不溺水。 We laughed and roughhoused and grappled with each other as we spun around in circles beneath the water, first him on top, then me on top, then him again, then me, like a couple of frenzied crocodiles rolling over and over, tenderizing their dinner. Arms and legs flailing, Bobby’s naked body felt wonderful squirming next to mine. His arms strong. His flesh hot and firm and heavenly. 我们在水中兜着圈子，笑着玩闹撕打，先是他在上，然后是我，然后又是他，接着我，像是一对疯狂的鳄鱼翻来覆去戏弄他们的晚餐。我们的四肢随着水波摆动着，Bobby赤裸的身体在水中有了奇妙的触感。他的手臂强壮，他的肉体滚烫、坚硬，像是天堂。 The water was glorious. Our hard-ons came back to life in about six heartbeats. It was great being twenty-five and being in love and being perpetually horny. I was pretty sure Bobby felt the same way, since he was also twenty-five. God knows he was perpetually horny. Even with the world fizzling out around us, nothing could have been finer than being naked and in love on this steamy California evening. 水中流淌着光辉。我们在六个心跳内就又硬了。处在二十五岁的当下，在一段恋爱关系中，永远性致蓬勃，这三条每一条都值得赞美。我知道Bobby肯定也这么想，因为他和我同岁。天知道他的性欲有多旺盛。即使我们周围的世界分崩离析，也没有什么能比得过如今这个热气腾腾的加利福利亚的傍晚，我们赤身坠入爱河。 Well, that and the fact we weren’t zombies. That was pretty much a plus too. 当然这也是我们不是丧尸的又一有力证明。 I wondered how long we would be able to keep it that way. 我好奇我们能保持这样的热情多久。 BEFORE that disastrous Tuesday morning when everything changed, I was a waiter at Mr. A’s, an upscale restaurant perched atop a high-rise office building just up the hill from downtown San Diego. Mr. A’s had a reputation for offering its customers a resplendent view of the city and an even greater reputation for overcharging them to the hilt for the opportunity to take advantage of said view. The joint was a bastion of snootiness: the food exquisite, the service spectacular, the prices astronomical, and as if all that wasn’t pissy enough, you couldn’t get in without a tie. If you don’t mind my saying so, being a waiter there was rather a plum job. I made more in tips in a year than a cousin of mine who lives in Kansas City made teaching school. Of course, she’s probably dead now. Or zombified. Who knows? Anyway, as I was saying, I had a good job and I was perfectly satisfied with my measly little existence. Being happily entrenched in a loving relationship with Bobby played no small part in that satisfaction. 在那个让一切都改变了的灾难般的周二早上之前，我是Mr.A的服务生。Mr.A是一家高档餐厅，位于圣地亚哥市中心山上的一幢高层办公楼的顶部。它以为顾客提供瑰丽的城市景观和为此收取高昂的费用闻名。这家店是用势利构筑的堡垒：食物精致，服务上乘，天文数字一般的价格，如果这还不够恶心——没有领带你会被禁止出入。如果你并不在意我说的这些，在那里做服务生就还算相当不错。我一年的小费比我一个住在堪萨斯做老师的表亲赚的还多。当然，她现在应该已经死了或是丧尸化了。谁知道呢。总之，就像我说的，我有一份很好的工作，而我对自己微不足道的生活感到非常满意。当然，和Bobby建立的恋爱关系在我的满足感中占了很大比重。 Bobby was considerably less enamored of his own place in the business world than I was with mine. On that eventful Tuesday morning when God took the world and stood it on its head, Bobby was earning his keep by holding down two jobs. Neither job was what you would call stellar. He was a dog walker in the evening and a San Diego Zoo snack bar clerk during the day. As he continually pointed out in his sweetly self-deprecating way, he was not exactly on the fast track to having his mug plastered across the cover of CEO Magazine. But even with all that, I think I can safely say he was, on the whole, satisfied with his life. And I like to think being happily entrenched in a loving relationship with me played no small part in that satisfaction. 相比我而言，Bobby更讨厌曾经的那个现代商业世界中自己的位置。在那个上帝接管世界的周二之前，Bobby打两份工维持生活。两份工作都和明星不沾边。他晚上代人遛狗，白天则是圣地亚哥动物园小吃店的店员。正如他不断用自嘲的说法指出的那样，他并没有走在把自己的傻脸印刷到CEO杂志封面的快车道上。但即便如此，我想我可以肯定，总体而言，他对自己的生活还是满意的，而我自认为与我相爱是其中的一个重要因素。 Simply put, we were nuts about each other. 简单来说，我们疯狂迷恋着彼此。 If I had any lingering doubts about that belief, the feel of Bobby’s stiff dick whapping me in the leg as we wrestled around in the pool and washed away the day’s miseries would have pretty well cleared it up. And if even that wasn’t enough to demonstrate the fact that we loved each other, the stiff he helped me plant in the front yard was surely more than enough to prove it. Bobby didn’t have to help me at all, you know. I had the watch. It was my turn to do the grunt work of slaughtering zombies and sticking them underground if one should happen along. Bobby just lent a hand because he loves me. That thought made my heart swell up. Rather like my dick at the moment. Only bigger, of course. And with less drippage. 如果我对此产生了怀疑，我们在泳池里交缠，洗去一天的痛苦时，Bobby硬硬的阴茎拍在我腿上的感觉就能消除它。如果这还不足以表现我们相爱，被我们埋在前院的死尸足以证明。你知道的，Bobby根本不用帮我。我有手表，如果有丧尸，那时轮到我结果它们并把它们埋到地下。Bobby帮我只是因为他爱我。这样的想法让我心甜蜜得肿胀起来，就像我此时的阴茎一样，当然，要比它更大，也少一些滴液。 Bobby and I were a team. Period. We had been a team before the world fell apart, and we were even more of a team now. As a matter of fact, now we were the only team. Bobby和我永远是一队。在世界崩溃前是这样，现在更是如此。事实上，我们是唯一的一队了。 Ain’t love grand? 爱不是很伟大吗？ IN REPOSE, when he’s sleeping or pretending to sleep, Bobby looks a bit like a very young and very innocent Brad Pitt. In other words, handsome and sexy as hell. Blue-eyed. Trim, athletic body. Gorgeous round ass. Strong, fuzzy legs. Not much hair on the upper body, aside from a little trail of peach fuzz that travels down from his belly button until it’s lost in a swirl of blond pubic hair that surrounds a substantial, and remarkably lovely and uncut, piece of man meat. Well, you know. You had a glimpse of it earlier, when he was stroking it in the hammock. Nice, huh? 当他在睡觉或是假装在睡觉时，Bobby看起来像年轻和天真很多的布拉德皮特。换句话说，超级帅和性感。他有一双蓝眼睛、修长的身形、健美的身材、绝美的翘屁、强壮又毛茸茸的腿。他上半身毛发不重，只有一小段桃金色绒毛从肚脐往下延伸连接着一片卷曲的金色阴毛。阴毛围绕着他重要的，非常可爱又原生态的那里。好吧，你知道的。当他刚才在吊床上自渎的时候你看过的。很不错，对吧？ Currently Bobby’s sun-lightened hair was too long and usually dangled in his eyes. I didn’t mind. I loved the way it made him look. Wind-blown and perfect. Like a god. Of course, Bobby continually bitched that his locks could be so much more casually poofed if we just had electricity for five minutes a day. Lord, he missed his blow dryer. 目前Bobby阳光般的头发有些过长，常常会遮住他的眼睛。我不在意这个。我还蛮喜欢他这个造型的。风吹的正好的时候他看起来像天神一样。当然，Bobby持续不断的嘲讽我，说如果我们每天有五分钟电力，他的造型会更随意的好。他真的很想念他的吹风机。 As for myself, I’m afraid I’m a little less than godlike. Still, I’m not exactly disgusting to look at. A head taller than Bobby, I have the slim build of a long-distance runner. Long legs. Lean torso. In fact, up until about two months ago, I used to jog religiously. But that was back when the world expected that sort of thing from young gay males. Nowadays, I just dig graves to stay in shape. Or run for my life. Works like a charm too. Both of them. 而我自己就相对而言逊色了很多。当然，我并不是看起来恶心或是什么。我高出Bobby一头，我有长跑运动员所需要的纤瘦的身体。长腿，躯干上脂肪很薄。事实上，直到两个月前，我都还一直虔诚地进行规律的慢跑训练。那个时候全世界都觉得年轻的男同性恋该做这个。而现在，我依靠挖坟墓，或是逃命来保持身材。这两项工作都很不错。 My hair is dark, my eyes are brown, my skin is a little darker than Bobby’s. My body is almost hairless, except for a healthy patch of pubic hair surrounding my dick, which, in case you’re wondering, is neatly circumcised. Bobby tells me I resemble Brendan Fraser. Back when there was a Brendan Fraser. In fact, last year for a Halloween party, I donned a teeny loincloth and running shoes, while Bobby slipped into a pair of baggy blue jeans, and nothing else, after decorating himself with a few clever dabs of makeup to simulate scrapes and contusions and a horrendous black eye. He was portraying good old Brad in Fight Club, you see, and I was Brendan Fraser in George of the Jungle. We made quite the couple that night. Walked off with “Most Original Costumes” and “Most Adorable Couple.” Later, with his head under my loincloth and his blue jeans flung across a shower rod in our host’s upstairs bathroom, we had a vigorous and most memorable bout of celebratory sex. Aah. Fond memories all around. 我头发是深色的，我的眼睛是棕褐色的，我的皮肤颜色也比Bobby要深。我身上没有什么毛发，只除了围绕着阴茎的阴毛。另外，以防你想知道，我的阴茎割过包皮。Bobby说我长得像布兰登·弗雷泽，在过去有布兰登·弗雷泽这个人的时候。事实上，去年的万圣节派对上，我穿了一条小腰带和一双跑鞋，而Bobby除了一条宽松的蓝色牛仔裤意外什么也没穿。他巧妙地给自己涂了几层化妆品来模拟擦伤、挫伤以及吓人的黑眼圈。他扮的是搏击俱乐部里的老布拉德，而我是丛林里的乔治中的布兰登弗雷泽。那天晚上的我们非常成功。我们离开的时候带着“最原汁原味的服装”和“最可爱的一对”的赞誉走了。在那天晚些时候，我们进行了一次酣畅淋漓的难忘的庆祝性性行为，那时候蓝色牛仔裤被甩在了派对主人楼上洗手间的浴帘杆上，而Bobby的脑袋在我的腰带下方活动。啊，到处都是美好的回忆。 God, I love movies. Or used to. It’s one of the things I miss most about living without electricity. Bobby misses his blow dryer, and I miss my DVD player. I also miss the cappuccino machine in the Starbucks around the corner from where we used to live. But don’t get me started on that. We did try hooking up a gas-powered generator shortly after the world went dark, but since neither of us is mechanically inclined, we damn near blew ourselves up. Now, rather than trying to make electricity, we just bitch about not having it. We’re healthier for it too. But I mustn’t complain. At least I still have Bobby. And even without movies and poofy hair and four-dollar shots of caffeine, Bobby and I still have sex. Every chance we get, in fact. 我喜欢电影。或者曾经喜欢过。这是我在没有电力的世界里最怀念的事物之一了。Bobby怀念他的吹风机，而我怀念我的DVD播放机。我也怀念我们住处街角的星巴克里的卡布奇诺机器。但别让我自己去操作它。在世界刚开始变坏那会儿我们试过组装一台燃气发电机，但是我们俩没一个擅长机械，我们差点把自己炸飞。现在，相比于自己动手发电，我们更倾向于只是抱怨没有电力。我们也能活得更健康一些，但我不能抱怨。至少我仍然拥有Bobby。而就算没有电影，没有蓬松的头发和四美元的咖啡因，Bobby和我还拥有性——每一次我们有机会的时候。 Rather like this very moment. 就比如此时此刻。 Our hands were all over each other as we splashed around in the pool. 我们的手在对方身上游走，在泳池里踩着水。 You would think after I had just murdered and buried someone (or something) I wouldn’t be in the mood for fooling around. It’s a funny thing. Weeks ago, after about the third or fourth time we took a hammer to a visitor’s head, Bobby and I both agreed it didn’t bother us at all. We looked on it as taking out the trash. Only with a bit more violence and a lot more stress and mess. 你也许会觉得，我刚杀和埋了某个人（或者某个东西），我一定没心思鬼混。这件事说来有趣。在几周前，在第三或是第四回我们用锤子猛敲来客的头知乎，Bobby和我达成了共识，这件小事将不再困扰我们。我们把它当作和倒垃圾一样的小事。只是多了一点暴力和更多的压力和混乱。 I stopped thinking about visitors when Bobby hoisted me into the air and plopped me down on the edge of the pool with my legs still dangling in the water. Bobby floated there between my knees, stroking my thighs and hugging my ass and burrowing his nose into my crotch. My cock was poking straight up like a fence post and bonking him in the head, and Bobby was under it licking and nibbling away at my nuts. My toes curled and I started trembling in anticipation. God, Bobby was a good boy. 我不再去想访客的事儿了——在Bobby把我举到半空然后咚的一声把我坐到了水池边的时候。我的腿还在水里晃来晃去。鲍比漂浮在水里，在我的双膝之间，他抚摸我的大腿，抱住我的屁股，鼻子探进我的裤裆里。我的阴茎像栅栏一样直挺挺地向上戳，打在他的头上，Bobby头埋在它下面，舔舐啃咬我的阴囊。我的脚趾蜷曲起来，我开始在期待中颤抖。天哪，Bobby真好。 He smiled when he felt me trembling, and with one hand reaching up to caress my chest, he gripped my rigid cock with his other hand and tilted it toward his mouth. In less time than it takes to tell about it, my dick was totally enveloped by those satiny lips, his hot tongue stroking and circling and teasing me, as the heat of his mouth carried me away to that place where all you can do is close your eyes and pray the sensations will never stop. 当他感觉到我在战栗时，他笑了起来，伸出一只手抚摸我的胸脯，另一只手抓住我硬挺的欲望，使它向他的嘴巴倾斜。用不了多久的时间，我的阴茎就被他光滑的唇舌完全包裹了，他热腾腾的舌头抚摸着我，打着旋，戏弄着我，他嘴唇的热度把我带到了一个你唯一能做的就是闭上眼睛，祈祷这种感觉永远不会停止的地方。 Bobby stared up into my face as he savored my dick, grinning at my look of ecstasy, tweaking my nipples now and then or bringing his free hand down to cup my swollen balls. His legs clamped onto one of mine like a vise and he started humping away at my shin under the water. 鲍比帮我口的时候盯着我的脸，一边嘻笑着看我沉湎的表情，一边时不时拧拧我的乳头，或是把另一只手伸下去，揉捏我肿胀发硬的蛋蛋。他的腿像老虎钳一样夹在我的腿上，开始在水下磨蹭起我的小腿。 I steered his mouth back over my dick and lay back onto the apron of the pool, my hips moving to the rhythm of his lips circling me, sucking me, taking me closer and closer to climax with every passing second and every worshipping stroke. I knew I should be reciprocating, but God, I was in such heaven I couldn’t move. Except for my dick and my hips. They were moving plenty. 我引导着把我的欲望塞回他嘴边，躺倒在泳池的围护上，我的屁股随着他嘴巴的画圈和吮吸有节奏的移动，每一秒每一次抽插都让我离高潮更近。我知道我应该回报他，但是天哪，在这样天堂般的享受里我实在是懒得动，只除了我的老二和我的屁股，他们正在大量的运动中。 Bobby was still humping my leg and I was getting that “uh-oh, I’m getting close” feeling, when Bobby let out a gasp, and even under the water I could feel his hot come shooting across my leg. Bobby还在撞击我的腿，而当Bobby喘了口气的空档，我有了“哦，要到了”的感觉，哪怕是在水下，我也能感受到他滚烫的精液射在了我的腿周围。 That’s all it took. 就这些。 My own come erupted out of me like a spray of fireworks, splattering Bobby’s throat, ricocheting off the roof of his mouth, slipping and sliding down his gullet. He pulled away for a moment to take a desperate breath of air and my come spurted across his face and into his hair. He laughed and brought his mouth back down to finish the job properly. 我的精液像烟花一样喷出来，溅射在Bobby的喉咙上，从他的上颚反弹开来，顺着他的食道滑下去。 他扭过头去，绝望地吸了一口气，我的精液从他的脸上喷到他的头发上。 他大笑，把嘴巴放回去，好好地把活干完。 My hips were arched, my butt cheeks so tightly clamped together, I thought I’d get a muscle cramp and be crippled for life, or else a diamond was going to pop out of my ass, one or the other, and as the last drops of semen shot from my cock and into that heavenly hot receptacle, which was still eagerly and hungrily sucking away for all it was worth, I gave a final thrust upward and collapsed back with a groan of contentment onto the hot concrete. 我的屁股拱起，屁股瓣紧紧地贴在一起，我想我会肌肉痉挛直到终生残疾，或者一颗又一颗钻石会从我的屁股里蹦出来，当最后一滴精液从我的老二射入那个天堂般温热的，仍然在急切地、饥渴地吮吸着的容器时，我最后向上一推，然后倒在滚烫的水泥地上，发出一声心满意足的呻吟。 Bobby gently played his hands across my stomach as his mouth continued to taste and suckle and coax until I could feel my cock soften and slide from between his lips. With a sigh of contentment, Bobby pushed his nose into my groin and just lay there like that, floating in the water between my legs. He still gave my shin an occasional hump as he continued to breathe in the scent of me, still relishing the taste of my come inside his mouth, still letting that secretive little smile twist the corners of his mouth. 鲍比轻轻地用手抚摸着我的肚子，他的嘴一直在品尝、吮吸、哄骗着我，直到我感觉到我的老二变软，从他的嘴唇间滑出。 鲍比满足地叹了口气，把鼻子探进我的腹股沟，就那样躺在那儿，在我两腿之间的水上漂浮着。 他继续闻着我的味道勃起并磨蹭我的小腿，还在享受着我进入他嘴里的味道，让那神秘的微笑挂在嘴角。 I knew from long experience this was Bobby’s favorite part of sex. The aftermath. The gentle unwinding. The snuggling and savoring of juices. The remembering. 根据我的长期经验，我知道这是鲍比在性爱中最喜欢的环节。 余波、 温柔的放松、依偎、品尝汁液。 回忆。 I reached down to stroke his hair as he buried his nose between my balls. 当他把鼻子埋在我的蛋蛋之间时我伸手揉他的头发。 He kissed me there. Sweetly. Like you might kiss a favorite aunt on the cheek. Then Bobby’s tongue came out and licked away an errant drop of come. You usually don’t do that to aunts. Favorites or otherwise. At least not in my family. Back when I had a family. 他非常甜蜜的吻我那儿，就像亲吻一个最喜欢的阿姨的脸颊。 然后博比伸出舌头舔掉了一滴渗出的的液体——你通常不会对阿姨做这样的事情，不管是喜欢的还是不喜欢的。至少在我的家庭里是这样。 我是说当我还有家庭的时候。 When the sun began to pound down on us a bit more cruelly than either of us liked, Bobby pulled his face out of my crotch and looked up across the expanse of my tummy and chest and asked with a contented sigh, “You ready for dinner?” 当太阳开始愈发残酷地照射到我们身上时，鲍比从我的裤裆那里抬起头来，越过我的肚子和胸膛看我，满足地叹了口气，问道: “准备好吃晚饭了吗? ” I touched his cheek and was about to say “Sure,” when we were suddenly interrupted by what sounded like a snarling, spitting, slavering creature from hell. Don’t you hate those? Bobby and I jumped about two feet straight up into the air. The damn thing came at us like a Mack truck, barreling through the backdoor from somewhere inside the house. Its toenails clattered madly on the wooden deck, then changed to a higher clattery pitch when they hit the concrete surrounding the pool. From there, the animal leapt into the air and headed straight for us, slobbers flying every which way, a thin trail of runny poop squirting out its back end with every bark and growl and snap and snarl. Yuk. Suddenly I wasn’t so hot on the dinner idea. Assuming we lived that long. 我摸了摸他的脸颊，正要说“当然可以”时，突然被一个听起来像是来自地狱的咆哮、吐痰、流口水的生物的声音打断了。 你能不讨厌这些吗？ 鲍比和我直接跳了大约两英尺高。 那该死的东西从房子里的某个地方穿过后门，像一辆麦克卡车一样向我们冲过来。 它的爪子在木饰平台板上摩擦发出疯狂的咔哒咔哒的声音，踩在游泳池周围的混凝土时，又变成了调更高的咔哒咔哒。 从那个地方，这只动物跃上空中，径直向我们飞来，到处都是口水，伴随着它的每一声吠叫、咆哮、猛咬和龇牙都有一条稀粪从它的尾部喷出。 恶心。 突然之间，我对晚餐不再那么热切了。 假设我们还能活到晚餐时间。 God only knows where the beast came from. We had been in the mansion for two weeks and, trust me, if we had noticed any slavering hounds from hell lingering in the cupboards or under the stairs, we would have vacated the joint before now. 天知道这野兽是从哪里来的。我们在这栋豪宅里带了两个多星期，相信我，如果我们注意到有地狱猎犬在橱柜里或是在楼梯下徘徊，我们早就会去清理了。 Of course, this wasn’t your typical hound from hell. In fact, for all the enthusiasm it was demonstrating, it was actually a pretty pathetic example. Seeing as how it was so cute and all. Or probably was once. It had been (in life) a French poodle. And a small French poodle, at that. A white one. There was still a tinge of pink about its haunches where the mistress (or gay-as-hell master) had had the unfortunate animal dipped in food coloring, or whatever the hell it is rich people use to humiliate their poor beasts and turn them various colors of the rainbow. A pink bow was still knotted between its ears. It hung there bloodied and limp. A rhinestone collar dangled around the animal’s neck with colored gems that glimmered and sparkled in the sunlight. Under its chin, the sparklies spelled out the word MIMI. 当然，这不是你熟知的那种地狱犬。实际上，尽管它表现出了极大的热情，它实际上是个可悲的例子。看它是多么的可爱，或者是曾经多么可爱。它曾经是一条法国贵宾犬，还是一只白色的小狗。它的屁股上还有一点粉红色，显然是女主人（或者是gay主人）让这只不幸的动物浸在了食用色素或是别的有钱人用来羞辱这些可怜的动物好让它们变成不同色彩的不管是什么的东西里。一只粉色的蝴蝶结还系在它的两只耳朵之间血糊糊地歪斜地挂着。一个水钻项圈挂在它脖子上，项圈上面镶嵌着彩色宝石在阳光下闪闪发光，拼出了MIMI这个词。 Funny. Except for the remnants of red toenail polish and that stupid collar and that pathetically filthy bow, she didn’t look like a Mimi. Her eyeballs were bloodshot, with goop running down from the corners like you see on dogs that have one foot in the grave and the other three on banana peels. Her coat was matted with globs of some sort of vile substance, like maybe she had been rolling around in the refuse pile at the local butcher shop and feeding on the intestinal rejects. 除了残留的红色指甲油和愚蠢的项圈，她看起来并不像一个咪咪。她的眼球充血，从眼角流下来的粘液就像是你在一只脚踏进坟墓另外三只脚踩在香蕉皮上的狗身上看到的一样。她的皮毛缠结成球块，沾满了邪恶可鄙的东西，好像是她曾在肉食店的垃圾堆滚来滚去好在肠道排泄物里找吃的一样。 My first instinct was to laugh. But that didn’t last long. 我的第一反应是大笑，但这念头没有维持多久。 What Mimi lacked in size, she more than made up for in attitude. And she did seem to have an inordinate number of pointy yellow teeth snapping away in that cute little homicidal face, so I thought it prudent to scurry back into the pool with Bobby to get away from the creature. 虽然咪咪体型很小，但她的态度足以弥补这一缺憾。 而且她那张可爱的杀人小脸上确实长着数不清的尖尖的黄牙，不停地咬着，所以我觉得和鲍比一起冲回到泳池里好躲开那个生物是明智的选择。 Bobby and I dogpaddled into deeper water, safely away from the edge. And we didn’t dawdle about it either. 鲍比和我一起划进了更深的水里，安全地离开了边缘。 我们也没有浪费时间。 “It’s just one thing after another, isn’t it?” Bobby wryly commented. “Now insane poodles are trying to kill us.” His eyes were still bright and his cheeks still flushed from sex. Or maybe it was from Mimi’s sudden, heart-stopping appearance. Who the hell knew? “事情一件接着一件，不是吗? ” 鲍比挖苦道。 “现在疯狂的贵宾犬想要杀死我们。” 他的眼睛仍然明亮，他的脸颊仍然因为性而发红。 又或者可能是因为咪咪的样子实在是能让人心脏骤停。 谁他妈知道？ “Should I kill it?” I asked. “我该杀了它吗？”我问。 Bobby looked at me like a palm tree had just sprouted out of my forehead. “Well, of course you should kill it! I’ll wait here. Do hurry.” Bobby看向我，好像我的额头上刚长出了一棵棕榈树。“你当然应该杀了它！我会在这里等你，快点。” Hmm. I looked down at myself drifting there in the water, naked, soaking wet, and about as unarmed as a person can get. And it wasn’t the first time I had found myself in this predicament. 嗯。 我低头看着自己，漂浮在水中，全身赤裸，浑身湿透，手无寸铁。 这并不是我第一次发现自己陷入这种困境。 “How many times have I told you, Robert Randolph Greene, we need to get ourselves a gun?” “罗伯特 · 伦道夫 · 格林，我跟你说过多少次了，我们需要搞把枪? ” Bobby groaned as he treaded water, like I had already mentioned this a thousand times before, which indeed I had. “I hate guns,” he declared, also for the thousandth time. “One of us will end up accidentally shooting himself in the foot, then he’ll die a slow miserable death from blood poisoning because there aren’t any doctors around, in case you hadn’t noticed, and then the other one will be left all alone in a world full of fucking zombies. Is that what you want?” 博比一边踩水一边咕哝抱怨着，就像我之前已经提过了无数次似的（我确实这样）。 “我讨厌枪，”他也第一千次重申。 “我们中的一个一定会意外地射中自己的脚然后慢慢地死于血液中毒，友情提醒以防你没注意到，因为周围没有任何医生。然后另一个会孤零零地留在一个充满他妈的僵尸的世界里。 这就是你想要的吗? ” I felt the urge to get huffy. “Well, compared to the possibility of being eaten by a zombie-ass poodle, getting shot in the foot doesn’t actually sound so bad. At least it’s butch!” 我感到一种要发脾气的冲动。 “相对于被丧尸贵宾吃掉的可能性，脚部中弹的死法听起来并不是那么糟糕。 至少它是爷们儿的! ” “Butch smutch. What if I’m the one who gets shot and you end up having to masturbate all by your lonesome for the rest of your life because I’m not there to carry the weary load?” He stuck his face into my neck and cooed apologetically, “Not that I mind carrying that weary load, precious.” Then he looked me in the eye again and nailed me with a steely glare. If we hadn’t been floundering in the water, he would probably have been impatiently tapping his foot with his fists stuck on his hips like Mrs. Butterworth. Did I mention that Bobby is a wee bit effeminate at times? “Well, Charles Millburn Pickett?” he annoyingly persisted. “How would you like that? Solo sex for the rest of your life! And no more blow jobs!” “男子汉斯马奇。 如果我是那个中枪的人，而你却因为我不在而孤独地一辈子只能打飞机，那该怎么办? ” 他把脸贴在我的脖子上，略带歉意地说: “宝贝，我并不介意背负着这么沉重的包袱。” 然后他又看着我的眼睛，用钢铁般的目光盯着我。 如果我们没有在水里挣扎，他可能会像巴特沃思太太一样，拳头扶在屁股上，不耐烦地用脚打拍子。 我有没有说过鲍比有时候有点娘娘腔？ “嗯，查尔斯 · 米尔本 · 皮克特? ” 他不厌其烦地坚持。 “你觉得怎么样？ 在你的余生中只有左手相伴！ 再也没有人给你口了! ” I tried not to grin. “Okay. You’ve proved your point. And please don’t use my middle name again. You promised you wouldn’t, you know.” 我尽量不露齿假笑。 “好吧。 你已经阐明了你的观点。 请不要再喊我的中间名了。 你答应过我不会的，你知道的。” He tried to look contrite, but it wasn’t very convincing. “Sorry. Forgot.” 他试图表现出忏悔的样子，但是没有什么说服力。 “对不起， 忘了。” I gazed across the water at Mimi, spitting and snarling and pooping and shaking her bling and looking like she was about to dive headfirst into the pool like a pissed-off Greg Louganis throwing an Olympic-sized fruit snit. “So how do we kill this bitch? I’d like to get out of the pool sometime today. I’m starting to prune.” 我隔着水凝视着咪咪，她不停地吐口水、咆哮、喷粪，抖动着她的装饰，看起来就像一个生气的格雷格 · 洛加尼斯扔一个奥运会标准大小的水果蛋糕一样，正准备头朝下跳进游泳池。 “那么我们怎么才能杀死这个碧池呢？ 我想在今天的某个时候离开游泳池。 我开始脱水了。” Bobby rolled his eyes. “God, it’s always something with you. Help me dig this grave. I want a gun. I’m starting to prune. Don’t stop, I’m going to come.” Here he relented. “Well, okay. I begged for that last one.” 博比翻了个白眼。 “天哪，你总是出状况。 帮我挖这个坟墓。 我要一把枪。 我开始脱水了。 不要停，我就要到了。” 在这一点上，他让步了。 “好吧，好吧。 最后一个是我求着要的。” “You sure did.” I smiled and felt a stirring in my crotch. Boy, that didn’t take long. “你确实做到了。” 我微笑着，感觉到胯部有一股骚动。 好家伙，才没过多久呢。 It seemed awfully quiet all of a sudden. I tried to push sex out of my mind as I looked over once again at the demon dog. Mimi seemed to have lost her train of thought. She was sitting at the edge of the pool licking her snatch. With all the horrible stuff that had been shooting out of her back end, from a health perspective at least, she should have probably rethought that urge. On the other hand, she was already dead. What’s it going to do—kill her? 突然之间，一切都显得异常安静。 我试图把性从我的脑海中赶走，因为我又一次看了看那只恶魔狗。 咪咪似乎失去了她的思路。 她坐在池边舔着她的小弟弟。 至少从健康的角度来看，有那么多可怕的东西从她的后脑勺喷射出来，她可能应该重新考虑一下那种冲动。 另一方面，她已经死了。 它能做什么? 杀了她吗？ “If you had saved an arm from that guy you buried earlier, or a foot, we could have used it to play fetch, and while Mimi was fetching the body part, we could have made a run for the house.” “如果你从你先前埋葬的那个家伙那里留了一只胳膊，或者一只脚，我们就可以用它来玩巡回游戏，当咪咪去捡尸块的时候，我们就可以跑回屋子了。” “Sorry. Didn’t think. I’ll saw something off the next one.” “对不起。 没想到。 下一次我会提前预知的。” Bobby tsked. “You always say that, but you never do.” Bobby阴阳怪气。“你总是这么说，但你从没那么做。” Mimi gave herself a good shake and stopped licking her zombified twat long enough to look around and see where she was. She appeared to have forgotten. Zombies are pretty stupid. All of them. Bugs, people, pussycats, dogs. Bobby and I had noticed that right off the bat. It didn’t make killing them any easier, but it did make outwitting them a breeze. Even for us. And we weren’t exactly Mensa material. 咪咪甩了甩自己，然后不再舔那个丧尸化的阴道，仔细地看看周围好确认自己在哪里。 她似乎忘记了。 丧尸都是相当愚蠢的。 所有的一切。 虫子、人、猫、狗。 博比和我一开始就注意到了这一点。 这并没有让杀死他们变得更容易，但的确让智取他们变得轻而易举——即使是对我们这种显然不是门萨的料的人来说。 Finally, Mimi’s gaze drifted out across the pool to where our two heads were poking up out of the water. She took in the sight of us, blinked, squirted another bit of crap onto the edge of the pool as sort of an afterthought, and dove right in after us. As she sailed through the air, her ugly yellow teeth were snapping like those wind-up dentures kids play with. Snap-snap-snap-snap. A no-nonsense snarl rumbled like thunder in her throat. She seemed to have regained her sense of purpose. It’s always disheartening when zombies do that. 最后，咪咪的目光扫过游泳池，看到我们两个的头探出水面。 她看着我们，眨了眨眼睛，又不假思索往池边喷了一点屎，然后就跟在我们后面跳进池子。 当她在空中飞行时，她丑陋的黄色牙齿像孩子们玩耍的发条假牙一样啪啪作响。 咔哒-咔哒-咔哒-咔哒。 咆哮像雷声一样在她喉咙里隆隆作响。 她似乎又恢复了使命感。 丧尸这样做时总是令人沮丧。 Bobby and I were halfway to the other side of the pool before Mimi hit the water. And we didn’t get there with any sense of panache either. Nothing like terror to get your ass moving. 在咪咪掉进水里之前，我和鲍比已经快到游泳池的另一边了。 我们到达那里也没有任何炫耀的感觉。 没有什么比恐惧更能让你动起来了。 We scrambled over the edge of the pool, screaming like little girls, water flying everywhere, dicks and assholes pointing off in every direction imaginable, bare feet slapping the flagstones as we hightailed it to the house hand in hand. 我们爬到泳池另一边，像小女孩一样尖叫，水飞溅到各个地方，阴茎指向任何你可以想象的方向。我们赤脚手拉手飞跑回屋子里。 We flew through the patio doors, slammed them shut behind us, and turned to see what had happened to our tormentor. 我们飞快地跑过露台门，砰的一声把门带上，然后转身去看折磨我们的家伙怎么了。 The pool was empty. 泳池里空空如也。 All that was left of Mimi, the demon poodle from hell, was a trail of little wet doggy footprints heading off toward the cabana. 咪咪，这只来自地狱的恶魔贵宾犬，只留下一串湿漉漉的小狗脚印，朝着小屋走去。 “She’s had a stressful day,” Bobby commented. “Maybe she’s off to browse a gay romance novel while nursing a banana daiquiri and unwinding in the Jacuzzi. Girls love that shit.” “她今天压力很大”Bobby说。“也许她应该去翻翻耽美小说，一边享用香蕉代基里鸡尾酒，一边在按摩浴缸里放松。。女孩子都喜欢这些。” “Hope she drowns,” I said. “希望她淹死，”我说。 Bobby tsked again. “Well, my goodness, aren’t you the grump today.” Bobby又啧了一次。“天哪，你今天脾气真暴。”","link":"/2020/03/03/丧尸狗/"},{"title":"搭建博客和遇到的常见问题","text":"我的过程和踩的坑 搭建博客5. 域名买！！！！ 我遇到的问题因为是现在才想起来记录，之前遇到的问题可能会有遗漏，但应该也能作为参考了 1. ERROR Deployer not found: git在博客对应目录下执行： npm install –save hexo-deployer-git 2. 头像和LOGO可以使用gravatar，但是把图片放在所用的主题的对应文件夹的source/images里，也挺好的。 3. 新建about页面在博客对应目录下执行： hexo new page “about” 在主题的_config.yml中将menu中about选项前的注释删掉。 4. 首页不显示全文在摘要后手动写这一行 5. 文章中添加图片在博客对应目录下执行： npm install hexo-asset-image –save 之后再hexo n xxxx 的时候会在/source/_posts文件夹内生成与xxxx.md同名的xxxx文件夹。 (不过我自己暂时还没成功 6. 评论系统大部分主题都集成有评论系统，以我现在用的icarus为例，要在_config.yml文件中将comment模块的注释取消掉。icarus支持的评论系统还挺多的，在阿良的推荐下我用了valine。 步骤是注册Leancloud并创建一个免费开发版应用，然后然后进入应用-&gt;设置-&gt;应用key获得appid和appkey。 Leancloud -&gt; 设置 -&gt; 安全中心 -&gt; Web 安全域名，把自己博客的域名加进去。 comment:​ type: valine​ app_id:​ app_key: 注意app_id格式不要写错啦，写成appid是不能识别的。 邮箱提醒功能没开，毕竟也没有人给我评论的OTZ。 7. 多个账号“ERROR: Permission to XXX.git denied to userb”为了试验gridea新申请了github账号，结果这个仓库没法推上去了……重新申请公钥没什么用处，发现的解决办法是： win10 系统下进入控制面板 》 用户帐户 》 管理你的凭据选择 [Windows 凭据]git 保存的用户信息在普通凭据列表里&gt;&gt;删除 再次hexo d的时候会让重新填写账号密码，就ok了。 不过这个方法大概治标不治本，每次切换博客都得来这么一遭，但是别的方法用起来太复杂了有点麻烦，所以还是别搞两个帐号了……","link":"/2019/10/08/搭建博客和遇到的常见问题/"},{"title":"心形线","text":"完成日期随便标的，实在是不记得啥时候写的了。 1234567891011*现代paro，歌仙（国文老师）X（理科脑的）JK*OOC预警，作者的文盲程度连小学生看到了都要大吃一惊！*JK单箭头，但是只放开头结尾应该连感情线也看不出来【住嘴*怎么都觉得顶着刀的名字做教师太奇怪了所以文中出现的别的角色也都是随便取的名字……*不满意的话可以痛殴作者一顿，不要钱！＊对方不懂也想要传达的就只是爱了这个梗源自知乎。 『听说了吗？三班的石田老师怀孕了。新来的代课教师是个超帅的家伙。』『真的么？真羡慕呐，吧唧看起来就很健康的样子，大概不会有让我们见到代课老师的机会啊。』『代课老师也有满脸横肉的中年老师的吧？』『谁知道，反正三班运气太好了。』 石田是个超无聊的家伙。不论是讲课还是占用课堂时间理所当然的进行思想教育都很无趣。自以为激情无限，实际上买她账的大概只有那些她的宠儿——就是那些看完了电影以后，可以写出长篇大论的观后感的那群人，引用了大段的名人名言，或者一些别的什么伎俩。我讨厌国文。我写不出什么观后感来。迎合人什么的也很讨厌。 『大家好，我是歌仙兼定，是个文士。从今天起担任国文老师一职。请多多指教。』相比于别的老师而言，他连穿着都显得过分庄重了。剪裁良好的西服更衬出他的文质彬彬，连制式的橡胶室内拖鞋也不能减少他的风姿。『我对现代科学不是很熟悉，因此没有手机，如果学习上遇到什么困难的话，欢迎到办公室里找我喝茶——顺便一提，我还蛮擅长泡茶的。』他说着，露出了一个漾人心神的笑容，完全没有理睬底下因为他不用手机而产生的种种讨论，以及在他露出笑容之后遮掩不住的吸气声。 泡茶成了一种新的风尚。学校周边的书店里，《万叶集》补了一批又一批的货。说起来，明明如今电子书籍已经逐步取代纸本书了，歌仙老师经过的地方，手里抱着一摞古典文学作品的姑娘却出奇的多。『这种年纪的小妞，根本不在意长着这样脸孔的男人是什么样的人，就能前仆后继了。哪怕这个新老师之前是个强奸犯——不对，连环杀人犯，她们也不会管的。』吧唧从歌仙老师桌子上的茶叶罐里狠狠抓了一大把茶叶放进自己的不锈钢杯子里，恶狠狠的发着牢骚。没有发现教职员室已经安静了下来。歌仙老师把外套架在衣架上，微笑着走近自己的座位：『哦呀哦呀，被发现了自己连杀了三十六人的事实呢。』『开个玩笑，请不要在意。』，他笑容里多了点说不清道不明的东西：『泡茶时并不需要这么多茶叶的，八级老师。』这样的修罗场看的我愉快至极。但是能够欣赏到这幕滑稽戏的原因只是我历史考试又砸了，阿梅直接把我带到了教职员罚抄写。和佳子分享的话，很快全班的女生都会知道『只要历史考差到被罚抄写的程度，就能近距离观赏歌仙老师的风姿』这样经过重新解读定义的结论了。我就不是唯一一个历史不及格的女生了吧？ *（正文略，有空就补充） * 五年过去了我还是一点补充的欲望都没有不愧是我爽完就跑 石田要回来了。歌仙老师毕竟只是代课教师，石田回来，他就必须要离开了。『呐，阿织，你说，怎样表白才最能打动人心啊？』，佳子手里的诗集几乎磨出了毛边：『真是的，所有人都打算从和歌下手，要怎样才能别出心裁嘛。』『这个怎么样？』我指着数学书附录上的心形线。『啊，歌仙老师不懂的吧？真是的，有没有认真出主意啦，对方完全看不懂的话就没有意义了吧？』佳子用手使劲揉着脑袋：『可恶，不论怎样都想要胜过那些小娘们啊！』 即使你看不懂也想要传达给你，这样的心情才是喜欢吧？r＝a（1－cosA） 发下来的作业本上画着极坐标和心。『虽然最初的确不擅长理学，但是也不要太过小瞧一个文士啊。世间真理本就值得潜心钻研，我又怎么会不被吸引呢？用这样的问题，是难不倒我的。』果然，歌仙老师是知道的。","link":"/2015/07/06/心形线/"},{"title":"端午流水账！","text":"写在前面搬了新家在自己家里招待朋友实在是太快乐了。 day0前一天晚上先在南京站接到了铁牛哥哥。因为过于兴奋我走的有点早，到的早了一个小时，等到回味都下班了哈哈哈。 晚餐是花味烤肉味道很一般，但是两个服务生小哥很有意思。 day1早餐是一鸣的三明治和酸奶提前让老婆梳妆打扮得到的回应是：“不。”这样坚决的她在看到盛装打扮的我和铁牛哥哥之后就后悔了。 午餐是海底捞好吃！番茄汤真好喝啊！呜呜呜呜 下午的活动是逛六朝博物馆和1912街区以及优衣库（欸六朝博物馆是湘鹅大推荐，跟湘鹅逛博物馆就真的很快乐。比解说好一万倍的百科全书！！！ 在1912小商品街区给老婆买了老虎糖画 然后毫无购物打算的我在优衣库又买了条裙子…… 晚餐是寿司和蛋糕和烤鸭蛋糕并不好吃做道具也很寒碜，早知道不如自己烤嘛。 寿司味道不错，烤鸭也很好 深夜活动是拍小裙子！！！总算等到啦跟老婆整了很多活嘻嘻，铁牛哥哥是个妹摄真是太好了。我老婆真的是仙女 day2早餐鸡鸣汤包以及我煮的粥午餐是蒜泥和十三香两种口味的小龙虾配了便宜的小甜酒和金汤力，绝赞好吃 晚餐烤了蛋糕嘎嘎嘎因为不小心多加了可可粉所以很苦，但是分着吃很快就吃完了 这一整天都在看隐秘的角落以及乘风破浪的姐姐原计划是去动物园，但是前一天跑太狠这天真的是动不了了。 day3早餐是外卖的粥午餐是猫抓烤肉猫抓是真的好吃呜呜呜我爱猫抓。可惜只抢了一次券，应该多搞几次的。 下午急匆匆赶去考了烟草丢下了朋友们我去受了两个小时的苦 晚上赶回来上了趟钢琴课然后结束假期钢琴课还是很快乐的。每当钢琴老师问我手指酸不酸要不要歇一下甩甩手的时候。我表面：哎呀好的不过没关系的。我内心：当代少年少女敲击键盘的时间真的很多手指力量完全足够的一点都不用练（。 另外虽然带了电脑回家，但是我根本就没有打开过！自信嘎嘎嘎。 然后回公司以后莫名其妙就连着一周都在加班，其实算的话只加了三天，但是因为这周格外漫长，所以整个人都有点疲惫。然后我又赶在这期间把我的无料小薄本给排了…… 周五的时候又发现有些问题遗留，本来说带了笔记本想回家搞，昨天又是一点开机的欲望都没有，折腾着给自己排了个封面我的小笔电就抖得像帕金森十年患者我真的无能狂怒。把自己水平烂完全归结于了笔电不行。不愧是我！ 总之存到八月我的钱肯定就能完全cover定制橱柜费用了，还有一些我就直接买成品就行（比如我已经下单了的海德薇藤编柜子，藤编真的看起来好有趣）。剩下四个月我的目标就是新电脑和电钢琴……各有一万块预算但我总觉得我会超……我这种垃圾别的不行，花钱就是第一名的。","link":"/2020/07/05/端午流水账/"},{"title":"网络基础知识和TCP/IP协议","text":"所有我还记得的知识点 网络模型 OSI七层 功能 相关概念 TCP/IP五层 TCP/IP四层 应用层 应用程序之间的通信 HTTP/Telnet/FTP/Ping 应用层 应用层 表示层 确定数据格式和加密 会话层 建立、维护和管理会话 传输层 建立主句端到端的连接 TCP/UDP 传输层 传输层 网络层 寻址和路由选择 IP 网络层 网络层 数据链路层 提供介质访问和链路管理 ARP/RARP 数据链路层 物理层 物理层 比特流的传输 物理层 基础二三层转发MAC以及它的学习和老化过程 MAC是什么 MAC帧格式:DAMC|SMAC|LENGTH/TYPE|DATA|FCS MAC单播、多播和广播地址 MAC学习和老化 VLAN以及QinQ和SuperVlan vlan的产生原因：由于广播风暴，需要通过路由器将网络分段 vlan的优缺点： 优点：限制广播域，抑制广播报文；隔离用户保证网络安全；虚拟工作组，组网灵活扩展灵活。 Vlan帧格式：DA|SA|tag|type|data|CRC Trunk和Vlan：主机之间报文是untagged报文，access link；交换机之间用tagged报文，trunk链路；hybird link两者皆可。 一个vlan原则上对应一个IP网段 QinQ技术是什么： vlan mapping：用配置的外层vlan tag替换用户的vlantag vlan stacking： 根据用户的vlan tag 添加配置的外层vlan tag SuperVlan是什么： SuperVlan内的两个子网如何通信： 环路检测： 环路可能导致的问题：MAC地址不稳定；广播风暴 要做的：阻断冗余链路，当前活动路径发生故障时激活冗余备份链路 IP IP是什么 IP头格式 IP地址划分，共ABCDE五类 TCP/IP组播 组播概念 组播的优势 组播的泛洪和剪枝 ARP和RARP ARP是什么 ARP的过程 ARP报文格式 RARP是什么 RARP的过程 RARP报文格式 PING PING是什么 PING的过程 ICMPTCP TCP是什么 面向连接，可靠，字节流 仅有两方彼此通信（广播、多播不可用） 应用数据被分割成TCP认为最合适的数据块（segment） 启动定时器，等待目的端确认收到该报文段 收到另一端的数据，发送确认 保持首部和数据的校验和 封装在IP datagram中可能失序需要对收到的数据进行重排 丢弃重复数据 流量控制，连接的每一元都有固定大小的缓冲空间 TCP的格式 HTTP HTTP和HTTPS之间的区别 二层转发和三层转发过程区别在于是否跨vlan，跨IP网段通信。 转发过程 判断是二层转发还是三层转发的依据是”接收到的报文是否是本机IP“ 二层转发过程 三层转发过程 查表流程 二层查表流程： 三层查表流程： 七元组/五元组 五元组： 七元组：SIP、DIP、SPORT、DPORT、Vrfid、VLAN、protocol FIB表和RE表的增改删查芯片相关协处理器有哪些 分别是什么作用数据结构分类线性表：SE表：EM表：LPM表：TCAM表：实现FIB表和RE表的增改删查NST和NHP的区别用HASH实现EM软表","link":"/2019/11/11/网络基础知识和TCP-IP协议/"},{"title":"算法课笔记1","text":"一篇平平无奇的课堂笔记 内容长且无规则 普适思想 coding style 考虑全面各种情况（第一步永远是边界检测） bug free 交流-思考-渐进的过程 例题：strstr重点：不要总想着kmp算法，因为它仅仅只是一个算法 第一步库函数(int pos = haystack.find(needle);) 第二步暴力解法 (for循环嵌套) 第三步优化 递归recursion的思想重点：使用深度优先搜索DFS实现递归==使用回溯的思想。 递归的三个要素：第一步：定义要用递归完成的事情 第二步： 如何将问题变为子问题 第三步： 什么时候退出递归（什么时候给返回值） 使用深度优先搜索的情境or排列组合模板总结： 适用范围：几乎所有的搜索问题 需要做出的改动：1. 什么时候输出；2. 哪些情况需要跳过 试着举例： permutations/unique permutations combination sum/letter combination of a phone number palindrome partitioning restore ip address 例题：subsets两种解法需要掌握： 递归实现DFS 1234567891011121314151617181920void helper(vector&lt;vector&lt;int&gt; &gt;&amp; res, vector&lt;int&gt; tmp, vector&lt;int&gt;&amp; nums, int level) { if (level &gt;= nums.size()) { res.push_back(tmp); return; } tmp.push_back(nums[level]); helper(res, tmp, nums, level + 1); tmp.pop_back(); helper(res, tmp, nums, level + 1);}vector&lt;vector&lt;int&gt;&gt; subsets(vector&lt;int&gt;&amp; nums) { vector&lt;vector&lt;int&gt; &gt; res; vector&lt;int&gt; tmp; helper(res, tmp, nums, 0); return res;} 考虑层序遍历求解，每次加入一个元素就扩充res的长度，直到所有元素添加完毕 123456789101112131415class Solution {public: vector&lt;vector&lt;int&gt;&gt; subsets(vector&lt;int&gt;&amp; nums) { vector&lt;vector&lt;int&gt; &gt; res(1); for(int i=0;i&lt;nums.size();i++){ int cnt=res.size(); for(int j=0;j&lt;cnt;j++){ vector&lt;int&gt; tmp=res[j]; tmp.push_back(nums[i]); res.push_back(tmp); } } return res; }}; 二进制位运算解法 12345678910111213141516class Solution {public: vector&lt;vector&lt;int&gt;&gt; subsets(vector&lt;int&gt;&amp; nums) { int S = nums.size(); int N = 1 &lt;&lt; S; vector&lt;vector&lt;int&gt; &gt; res; for (int i = 0; i &lt; N; ++i) { vector&lt;int&gt; v; for (int j = 0; j &lt; S; ++j) if (i &amp; (1 &lt;&lt; j)) v.push_back(nums[j]); res.push_back(v); } return res; }}; 基础算法问题的 Time ComplexityO(1) 极少 O(logn) 几乎都是二分法 O(n) 遍历 O(nlogn) 一般都需要排序 O(n²) 数组、枚举、动态规划 O(n^3)数组、枚举、动态规划 O(2^n) 与组合有关的搜索 O(n!) 与排列有关的搜索 二分法binary search的思想二分法中的循环仅仅是为了缩小范围，而不是获得结果，二分法的核心就是将答案的范围缩小。 ** 比O(n)更优的时间复杂度几乎只能是O(logn)的二分法**。 T(n) = T(n/2) + O(1) = O(logn) 通过O(1)的时间把规模为n的问题变为n/2=O(logn) 通过O(n)的时间把规模为n的问题变为n/2=O(n) recursion or Loop？一般使用loop，因为recursion涉及到了调用栈，占用内存较大，所以recursion不是常用解决办法。但如果recursion会更简单，可以先用recursion解决。 通用的二分法模板： while (start + 1 &lt; end) 不用start &lt; end 或 start &lt;= end 或start + 1 &lt;= end 是为了防止死循环，确保在只剩最后两个数时就开始做判断 int mid = start + (end - start)/2 不用(start + end)/2是为了防止溢出，因为int型最大只有2^32-1 A[mid] == , &lt; , &gt; 不管是否可以&lt;=或&gt;=，都先判断三种情况，以确保条件判断正确。 A[start] , A[end] ? target first-pos-of-target时先判断start；last-pos时先判断end start = mid 不使用mid + 1是为了防止死循环（极端情况只有两个数时） end = mid 例题：binary-search/first-or-last-pos-of-target /search-a-2d-matrix /search-insert-pos /search-in-a-infinite-sorted-array /search-a-rotated-sorted-array /Find-peak-element 二叉树T(n) = 2T(n/2) + O(1) = O(n) T(n) = 2T(n/2) + O(n) = O(nlogn) 前中后序遍历 递归方法 123456789101112131415161718192021222324252627282930313233343536typedef struct BiTNode{ TElemType data;//数据 struct BiTNode *lchild, *rchild;//左右孩子指针} BiTNode, *BiTree;/*二叉树的前序遍历递归算法*/void PreOrderTraverse(BiTree T){ if(T==NULL) return; printf(\"%c\", T-&gt;data); /*显示结点数据，可以更改为其他对结点操作*/ PreOrderTraverse(T-&gt;lchild); /*再先序遍历左子树*/ PreOrderTraverse(T-&gt;rchild); /*最后先序遍历右子树*/}/*二叉树的中序遍历递归算法*/void InOrderTraverse(BiTree T){ if(T==NULL) return; InOrderTraverse(T-&gt;lchild); /*中序遍历左子树*/ printf(\"%c\", T-&gt;data); /*显示结点数据，可以更改为其他对结点操作*/ InOrderTraverse(T-&gt;rchild); /*最后中序遍历右子树*/}/*二叉树的后序遍历递归算法*/void PostOrderTraverse(BiTree T){ if(T==NULL) return; PostOrderTraverse(T-&gt;lchild); /*先后序遍历左子树*/ PostOrderTraverse(T-&gt;rchild); /*再后续遍历右子树*/ printf(\"%c\", T-&gt;data); /*显示结点数据，可以更改为其他对结点操作*/} 非递归方法-利用栈进行遍历 前序12345678910栈S;p= root;while(p || S不空){ while(p){ 访问p节点； p的右子树入S; p = p的左子树; } p = S栈顶弹出;} 1234567891011121314vector&lt;int&gt; preorderTraversal(TreeNode* root) { stack&lt;TreeNode*&gt; S; vector&lt;int&gt; v; TreeNode* rt = root; while(rt || S.size()){ while(rt){ S.push(rt-&gt;right); v.push_back(rt-&gt;val); rt=rt-&gt;left; } rt=S.top();S.pop(); } return v; } 后序1234567891011栈S;p= root;while(p || S不空){ while(p){ 访问p节点； p的左子树入S; p = p的右子树; } p = S栈顶弹出;}结果序列逆序; 123456789101112131415vector&lt;int&gt; postorderTraversal(TreeNode* root) { stack&lt;TreeNode*&gt; S; vector&lt;int&gt; v; TreeNode* rt = root; while(rt || S.size()){ while(rt){ S.push(rt-&gt;left); v.push_back(rt-&gt;val); rt=rt-&gt;right; } rt=S.top();S.pop(); } reverse(v.begin(),v.end()); return v;} 中序1234567891011栈S;p= root;while(p || S不空){ while(p){ p入S; p = p的左子树; } p = S.top 出栈; 访问p; p = p的右子树; } 123456789101112131415vector&lt;int&gt; inorderTraversal(TreeNode* root) { stack&lt;TreeNode*&gt; S; vector&lt;int&gt; v; TreeNode* rt = root; while(rt || S.size()){ while(rt){ S.push(rt); rt=rt-&gt;left; } rt=S.top();S.pop(); v.push_back(rt-&gt;val); rt=rt-&gt;right; } return v; } 层次遍历（BFS-Queue）1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465typedef struct Node{ //定义二叉链 struct Node *lchild; //指向左孩子节点 char data; //数据元素 struct Node *rchild; //指向右孩子节点 }BTNode; //struct Node 的别名 typedef struct Quene{ //定义顺序队 int front; //队头指针 BTNode *data[MaxSize]; //存放队中元素 int rear; //队尾指针 }SqQueue; //struct Queue 的别名 //初始化队列 void initQueue(SqQueue * &amp;q){ q=(SqQueue *)malloc(sizeof(SqQueue)); //分配一个空间 q-&gt;front=q-&gt;rear=-1; //置 -1 }//判断队列是否为空bool emptyQueue(SqQueue * &amp;q){ if(q-&gt;front==q-&gt;rear){ //首指针和尾指针相等，说明为空 return true; //返回真 } else{ return false; //返回假 }}//进队列bool enQueue(SqQueue * &amp;q,BTNode * &amp;BT){ if(q-&gt;rear==MaxSize-1){ //判断队列是否满了 return false; //返回假 } q-&gt;rear++; //头指针加 1 q-&gt;data[q-&gt;rear]=BT; //传值 return true; //返回真 }//出队列 bool deQueue(SqQueue * &amp;q,BTNode * &amp;BT){ if(q-&gt;front==q-&gt;rear){ //判断是否空了 return false; //返回假 } q-&gt;front++; //尾指针加 1 BT=q-&gt;data[q-&gt;front]; //取值 return true; //返回真 }void levelOrder(BTNode * &amp;BT){ SqQueue *q; //定义队列 initQueue(q); //初始化队列 if(BT!=NULL){ enQueue(q,BT); //根节点指针进队列 } while(emptyQueue(q)!=true){ //队不为空循环 deQueue(q,BT); //出队时的节点 printf(\"%c\",BT-&gt;data); //输出节点存储的值 if(BT-&gt;lchild!=NULL){ //有左孩子时将该节点进队列 enQueue(q,BT-&gt;lchild); } if(BT-&gt;rchild!=NULL){ //有右孩子时将该节点进队列 enQueue(q,BT-&gt;rchild); } //一层一层的把节点存入队列 } //当没有孩子节点时就不再循环 } maxlength/minlength of B-tree : Traverse or Divide-Conquer 分治的方法优于遍历的方法 这是因为分治不会一直传结果，而遍历会把结果当成参数传下去，造成冗余。 动态规划链表 linked-list声明： 1234567//struct CacheNode { int key; int value; CacheNode *pre, *next; CacheNode(int key, int value):key(key), value(value), pre(NULL), next(NULL){}}; Dummy Node12ListNode* result = new ListNode(0);result-&gt;next = head; 两两翻转链表主体： 12345678while (p != NULL &amp;&amp; p-&gt;next != NULL){ q = p-&gt;next; p-&gt;next = q-&gt;next; q-&gt;next = p; //q-&gt;next = pre-&gt;next; pre-&gt;next = q; pre = p; p = p-&gt;next; } k个一组翻转链表主体： 123456789101112for (i = 0; i &lt; loopNum; i++){ for (j = 0; j &lt; k-1; j++){ if (p != NULL &amp;&amp; p-&gt;next != NULL){ q = p-&gt;next; p-&gt;next = q-&gt;next; q-&gt;next = pre-&gt;next; pre-&gt;next = q; } } pre = p; p = p-&gt;next;} 全部： 1234567891011121314151617181920212223242526272829303132333435363738class Solution {public: ListNode* reverseKGroup(ListNode* head, int k) { if (head == NULL || k &lt;= 0){ return nullptr; } int count = 0; ListNode* cur = head; while (cur != NULL){ count++; cur = cur-&gt;next; } int loopNum = count/k; int i, j; ListNode* result = new ListNode(0); result-&gt;next = head; ListNode* pre = result; ListNode* p = head; ListNode* q = head; for (i = 0; i &lt; loopNum; i++){ for (j = 0; j &lt; k-1; j++){ if (p != NULL &amp;&amp; p-&gt;next != NULL){ q = p-&gt;next; p-&gt;next = q-&gt;next; q-&gt;next = pre-&gt;next; pre-&gt;next = q; } } pre = p; p = p-&gt;next; } return result-&gt;next; }}; 快慢指针删除倒数第k个节点 数组 array声明： 123456789101112131415161718192021222324252627//type arrayname[arraysize];int array[10] = {1000.0, 2.0, 3.4, 7.0, 50.0};//vector容器vector&lt;int&gt; a1;vector&lt;int&gt; a2(2, -1); //2个int元素值均初始化为-1vector&lt;int&gt; a3(10); //10个int元素值均初始化为0vector&lt;string&gt; svec1 ={\"the\", \"three\", \"kingdoms\"};vector&lt;string&gt; svec2(10); //10个string对象初始化为空v.push_back(temp); //向vector中添加元素v.empty(); //检查是否为空v.capacity(); //返回当前vector中最大可以存储数据的容量v.begin();v.end(); //v.size(); //返回v中元素的个数v[n]; //获取v中第n个元素//特别注意：对于一个空的vector,不能使用下标向其中添加元素。只能使用push_back. 只能对确知已存在的元素执行下标操作。vector&lt;int&gt;::iterator it; //it是能读写的vector中的元素string::iterator it1; //it1是能读写的string对象中的字符//字符串char string[10] = {'h', 'e', 'l', 'l', 'o','\\0'};char string2[] = {\"hello\"};strcpy(s1,s2); //复制s2到s1strcat(s1,s2); //连接s2到s1末尾strlen(s1); //长度 strcmp(s1,s2); //比较 双指针问题（Two Sum） two sum可以用hash做，也可以用相向双指针做 three-sum/two-sum-closest 用相向双指针 partition-array 思想和快排类似，典型题可以分为两部分和三部分 1234567891011121314while (i &lt;= j) { while (i &lt;= j &amp;&amp; a[i] &lt; target) { i++; } while (i &lt;= j &amp;&amp; a[j] &gt;= target) { j--; } if (i &lt;=j) { swap(a[i], a[j]); i++; j--; }}return j+1; SubArray best time to buy and sell stock/数飞机/Maximum Array prefix sum问题 Sorted Array merge-two-sorted-array 一是可以开辟新空间的 二是存在同一个数组中的，反向比较 两个有序数组中的中位数/第k个数 一是O(m+n)的双指针寻找 二是O(logn)的二分法，两个数组的前k/2 1234比较nums1[k/2]和nums2[k/2]的大小 小的那个数组count+k/2； k = k - k/2;直到取到第k个 数组内积（点乘） intersection-可以用哈希 数据结构Queue == BFS支持操作：O(1) push; O(1) pop; O(1) top Stack == DFS支持操作：O(1) push; O(1) pop; O(1) top 数据结构实现题/非递归问题（DFS问题）/单调栈问题 例题：min stack构造一个存放最小值的栈，同步更新 例题：largest rectangle in histogram例题：两个栈做一个队列两个队列做一个栈HASH实现原理，减小冲突： array+list形式；多个hash function； rehashing很复杂所以要避免！ 支持操作：O(1) insert; O(1) find; O(1) delete 构造： 123456789// 定义一个map对象map&lt;int, string&gt; mapStudent; // 第一种 用insert函數插入pairmapStudent.insert(pair&lt;int, string&gt;(000, \"student_zero\")); // 第二种 用insert函数插入value_type数据mapStudent.insert(map&lt;int, string&gt;::value_type(001, \"student_one\")); // 第三种 用\"array\"方式插入mapStudent[123] = \"student_first\";mapStudent[456] = \"student_second\"; 查找： 1234567map&lt;int,CacheNode*&gt;::iterator it = mp.find(key);// find 返回迭代器指向当前查找元素的位置否则返回map::end()位置iter = mapStudent.find(\"123\"); if(iter != mapStudent.end()) cout&lt;&lt;\"Find, the value is\"&lt;&lt;iter-&gt;second&lt;&lt;endl;else cout&lt;&lt;\"Do not Find\"&lt;&lt;endl; 删除： 123456789//迭代器刪除iter = mapStudent.find(\"123\");mapStudent.erase(iter); //用关键字刪除int n = mapStudent.erase(\"123\"); //如果刪除了會返回1，否則返回0 //用迭代器范围刪除 : 把整个map清空mapStudent.erase(mapStudent.begin(), mapStudent.end());//等同于mapStudent.clear() 其他基本函数： 123456789101112131415161718C++ maps是一种关联式容器，包含“关键字/值”对begin() 返回指向map头部的迭代器empty() 如果map为空则返回trueend() 返回指向map末尾的迭代器size() 返回map中元素的个数count() 返回指定元素出现的次数 equal_range() 返回特殊条目的迭代器对get_allocator() 返回map的配置器key_comp() 返回比较元素key的函数lower_bound() 返回键值&gt;=给定元素的第一个位置max_size() 返回可以容纳的最大元素个数rbegin() 返回一个指向map尾部的逆向迭代器rend() 返回一个指向map头部的逆向迭代器swap() 交换两个mapupper_bound() 返回键值&gt;给定元素的第一个位置value_comp() 返回比较元素value的函数 Hash Table/Hash Map/Hash Set的区别是什么？hash table支持多线程 多线程的producer/ consumer模式LRU-cache算法hashmap&lt;key, DoublyListNode&gt;; Heap == Priority Queue支持操作：O(logn) add; O(logn) remove; O(1) min or max 例题：ugly-number123456789101112131415161718192021O(n)heap + hashmap O(nlogn)queue&lt;long&gt; Q;vector&lt;long&gt; primes;primes = {3,5,7};hashmap&lt;long,Boolean&gt; mp;for (int i = 0; i &lt; 3; i++){ Q.add(primes[i]); mp.put(primes[i],true);}long number = long.value?;for (int i = 0; i &lt; n; i++){ number = Q.?(); for (int j = 0; j &lt; 3; j++){ if (!mp.containskey(primes[j]*number){ Q.add(number*primes[j]); mp.put(number*primes[j],true); } }}return number; 例题：top-k-largest-numbers例题：data-stream-median例题：merge-k-sorted-list/array","link":"/2019/11/27/算法课笔记1/"},{"title":"遇难船与北极星（1986）","text":"写在前面是阿良主催的恋光本，某一日大家突然就兴起要攒一个时代剧的本出来。当时非常迷恋昭和歌姬的我就选了这个时间段，虽然通篇看下来好像也没有很强的那个年代的感觉，但是以考据为名我真的看了好多打歌舞台和奇妙广告，快乐无边嘻嘻嘻。另外写的时候有看《女人的食指》，对里面的莺宿梅真的念念不忘，真想吃呀！ 幕1“谁是爱城华恋？有人找。”拐角那里探出了一个金色的脑袋。 “都说下次不要留公司的电话号码了你怎么总也不听。”久志皱着眉头呵斥。 “没有办法嘛，上次打电话的时候忘记还炖着咖喱，谁知道多走两步电话线就会被扯断掉。”女孩子笑盈盈的会了一嘴：“你知道我的嘛，零存款，实在是没有办法。” 她朝着金色脑袋招了招手：“这边，我过来了。” 坐在工位上的女孩穿着规规矩矩的黑色西装，只在小指上涂了金色的指甲油。她趁着华恋打电话照了照镜子，又折腾了一下卷发，到了两分钟以后才假装不耐烦的抬手看着表。华恋用脑袋和肩膀夹住话筒，双手合十，一边嗯嗯啊啊的应付着电话那头。电话那头的可恶老头还在没完没了的说话，无非就是担心日元急剧升值带来经济大萧条，电视台不想冒险采用新人那一套，哪怕是已经按照要求逐字逐句改了十八遍的剧本也还是没有通过的可能性。 “嗯嗯，我知道了，谢谢您给的机会。”她这么说完，听了一会儿电话那头的忙音，也挂断了。她把听筒扣好，呼了一口气，又跑回去拉了把椅子坐到久志旁边。 “所以呢，今天有活干吗？” 久志看了她一眼：“所以说，当兼职模特不长久，在片场找个有钱男人嫁掉不就好了，哪怕你早几年决定出道也比一门心思当编剧要值得。剧本又被拒了？”他没有等待华恋的回答，只是翻了翻笔记，然后给了她时间地点。 拍摄地点离模特公司的距离堪比月球到火星，华恋没来得及吃午饭就匆匆上路。勉强在开拍前到了现场华恋才知道内容，她得扮成女高中生啦啦队员。也好，在二十代后半还能理直气壮做回高中生的机会常人实在是难有，她给自己打着气，好说歹说才让实在缺人的主管给她留一个后排只露半个脑壳的位置。 换上橙红色的半截式上衣和白色的百褶裙，拎上金属色的手摇花。华恋跟着小妹妹们上上下下左左右右挥动着彩花，在汽水广告里做尽职的背景板。 晃了半个下午胳膊导演也还是不满意，但好歹放了他们中场休息。华恋趁着没人，偷偷把内衣往下勾了勾——手臂晃动的幅度太大，内衣时不时就往上滑一点，卡得她以为自己要断气了。然后她听到了一声伴随着闪光灯的脆响。 “——？” 摄影师在业界还算有名，但是干这种事显然不是第一次。闹哄哄的环境是最好的遮掩，加上大家都是想要出名，基本上什么时候都卡着模子假装自己天生好仪态，多数时候他看起来只是在拍花絮写真——一个高雅的，烧钱的爱好。 华恋紧盯着他。摄影师暧昧地笑笑，比了个下流姿势，举起相机就走向向了另一个方向。那边的妹妹看到摄影师，拍拍身边人组好了造型。 “好哦，相机调好了哦，要拍啦。”他拖着长音吸引姑娘们的注意。 “请等一下。” 出声的是一位女性。她穿着宝蓝色的垫肩西装，蓬蓬松松的头发披在脑后，用一枚金色星星别住。刘海烫得弯弯的，一半用啫喱水定出皇冠的形状，留下疏疏落落的一小把半遮住粗黑平直的眉毛。她的眼神里有种不容拒绝的意味，讲话的时候红唇衬着白生生的牙齿愈发显出她美得不近人情。一时间摄影师看得愣住了，周围的吵闹声都静了一瞬。她踩着高跟鞋大步走近，抓住相机拉出胶片曝光。 摄影师这才反应过来：“你在干什么啊？” “抱歉，胶卷的费用我会负责赔偿，但是我想你知道我为什么要这么做。” 摄影师心虚气短，一时间竟忘了反驳。愣是接了女性从手包里拿出的钞票，然后看着她干脆利落地走开，和制片公司的高层一起越走越远。 华恋有点愣住了。是因为我吧。她是谁？她为什么要帮我？ “刚刚那是谁啊？”女孩子们四散开来，嗡嗡交谈声复又响起。 神乐光在面对秃头老板的时候总是很头痛。想要抽烟，或者捏捏藏在手包里的白熊吉祥物挂件也好。对面那位的推脱和不屑都写在脸上。 一个女人。一个没有才能的女人。 自打她归国空降进框框电视台之后她听到了太多类似的评价。她知道自己在英国永远的失去了那闪耀的，光辉的，某一样很重要的什么。在她项目失败输掉全部只能回过头来到日本重新发展的时候就知道，但是她仍然是个斗士。只是换了个角斗场。 “你这样的提案我们很难做。技术上我们是世界一流没错，但是所需要的经费不是你能承担的。更何况就算顶着归国派的名头，你能接手的最多也只有周五的深夜档。”秃头老板下了定论：“没人想看深夜档的。主妇们需要睡眠，年轻人们也才刚开始夜生活，谁会看电视呢。” 老板说的没错，在此之前，深夜档只是聊胜于无。但是神乐光笃定如今是最好的时候。于大多数人而言，连续升值的汇率导致的供给积压将经济萧条的阴云带到了这里，政府生怕出现严重衰退采取的紧急对策更像是一个信号，寒冬给黄金时代镀上阴影，努力就会赚到钞的神话正在失色。然而与经济危机相伴而生的却是娱乐业的繁荣，需要购买实体的唱片业近几年持续走低，只需要摁摁遥控器的电视剧是愈发流行，如果萧条真的要到来，那么深夜档也会是她的良好开端。她抿了抿唇，告辞离场。 “你是小光吗？”爱城华恋小跑着从门口的廊柱迎过来：“太好了，你还没走。我还以为要错过了，跟自己说再等十分钟就放弃呢。”她仍旧穿着啦啦队服，橙红色的半截式上衣包出了饱满的圆弧，小跑过来的时候百褶裙飘飘摇摇，露出细腻白皙的大腿。她染着浅棕色的头发却疏于打理，发顶已经有些泛黑。她本人的衣服胡乱塞在背包里，撑得背包只能拉上半边拉链。 “这个啊，我不小心洒了一大块酱汁在自己衣服的前胸，只能团团收起来，换上这套。不过也不赖，我穿的还挺好看的。”华恋摆了个定点，见没有回应又追上神乐光跟着她一起往厅外走：“你是小光没错吧，你记不记得我们小时候一起玩过。你是什么时候回来的？自从你去英国留学……” “不记得了。”光冷淡的回复了一句，挥挥手招来了计程车，只准备用高跟鞋的红底跟聒噪的少女说再见。然而华恋直接把包从半敞着的车窗扔进计程车内，然后轻车熟路挤上，给司机报了一串地址。 “小光根本不会撒谎嘛，不认识的人是不会说‘不记得了’的。”华恋的脸映着霓虹，眼睛里亮晶晶的：“那么庆祝小光归国，今晚就到我那边好好玩一宿。” 幕2光被华恋带到一栋看起来破破烂烂的公寓楼，昏黄的月光让遮蔽小楼的衰草显得精神了些，白天怕是更加不像样。华恋刚踏出车外就是一哆嗦。六月才没过几天，白天温度再高到了晚上风都还是凉的，更何况华恋还露着半个肚皮。 “好冷。”华恋抱着手臂搓了几下。 “活该。让你不好好穿衣服。” 爱城华恋拖着神乐光进了自己家。少女伸胳膊在衣服团块底下捞了好久，又颠了颠包确认位置，终于摸到钥匙开了门，进门鞋子一蹬就换了拖鞋大步向前，一边招呼神乐光进门换鞋，一边打开冰箱确认食材。 “小光，啤酒还是茶？”她停顿一下：“虽然一般要这么说，但是非常遗憾只提供啤酒。”她拎出两罐冰啤酒放在小几上，关上冰箱门。 神乐光刚刚把鞋子摆放整齐，转过身来就看见华恋正站在沙发边上把体操服换成宽松的白T，连忙扭过头去。 “冰箱里最后一盒中华料理包也不见了。一起工作的真昼酱前段时间送我的腌梅干还剩半罐，梅肉拌昆布味道妙极了小光你要不要尝尝。” “好，决定了，今天就吃茶泡饭。虽然刚刚说只提供啤酒，但我这里其实也还是有从公司茶水间顺回来的绿茶包的，让我找找。 “小光你在沙发上坐一会儿，我去把茶煮上。” 少女神色自若地从挂在衣橱把手上的夹克口袋里摸出了茶包，把堆在沙发上的一摞衣服和好几只熊猫宝宝“童童”的纪念玩偶推倒在同样堆放在沙发上的几本杂志上，给神乐光挪出一个比早高峰地铁座位还狭窄的缺口，然后拿上蛋和冷冻米饭跨过了山和海，去料理台折腾。 神乐光挪到沙发上坐下，沙发坐垫经过长时间使用早就出了凹坑，她毫无经验又没防备，当即陷了进去，把旁边岌岌可危的服装小山也带得散落了一地。光赶忙伸手去扶，然后把地上的那些也拾起来堆好。 她就是在这个时候看见那个剧本的。她很快就入了迷。 那是一个讲述少女和星空的故事。在孤独的红色的荒漠里，通过电波传达思念的故事。 “小光。” “小光？” 神乐光像是从一个似曾相识的梦境中醒来，混沌得不知身处何地。 “小光在看什么这么入迷？”华恋把铺在茶几上的杂志翻过一页，垫在茶壶下面，用满不在乎的口气说着：“啊这个，是被拒绝的丢人稿件啦。大概不是什么有趣的东西。相比而言，小光还是快来看看我倾情制作的豪华茶泡饭——” “这不是什么丢人稿件。”神乐光抓紧了手里的几页纸：“虽然还有一些很明显的新人作家的瑕疵，但是这绝不是随随便便就可以写出来的。这是非常优秀的剧本。” 华恋稍微有点不好意思，又的确惊喜极了，嘿嘿笑了两声。 “稍微改动一两处的情节设置，比如这一幕，其实可以这样……” “啊是的，我也觉得这里这么安排更好，guwa一下出现，让人一看就嘭——，心脏像被击中一样，忍不住掉下眼泪的冲击力。但是，前面和我对接的老师说要考虑一下经费限制不允许出现咚咚咚咚这样过分宏大的场景。” “嗯，经费的确是个问题，啊，不过我们可以用这样的方式替代一下呢。”神乐光像来过许多次一样，从奇妙的沙发坐垫缝隙里摸出了笔，趴到地上就在文稿的空白处画起了示意图：“像这样，这一段的对话放到后面，然后给长长的特写，镜头转过去就是这里。”她画了个箭头把下一页的场景提过来。 “这样如何？” “是的是的，不愧是小光，一下子就知道我想要什么了。” …… 她们讨论得热火朝天，茶水很快冷掉，两人却都没顾得上吃。 “那么，请让我买下你的剧本。为我工作吧，华恋。”神乐光抬起头，看着不知不觉和她头对着头的爱城华恋。 可是华恋犹豫了，漂亮的蜂蜜色眼睛映着昏了的老式吊灯闪闪烁烁：“啊，可是这是被拒绝掉的……我也只是新人初次尝试……” “你宁愿剧本堆在地上和垃圾一起丢掉都不愿意给我吗？我开出的价码比你去当临时模特高多了！” “那么，失礼了。” 神乐光怒气冲冲地离开。 爱城华恋想要挽留，却又不知道该怎么做。她追到门口叠声呼唤着神乐光的名字，却只听到碎碎密密的高跟鞋跺在地上的脆响。 但她终究没有追出门去，只是沉默的回身收拾好文稿，用夹子夹住，然后踢进了沙发底下。桌上两碗米饭上薄薄覆着一层海苔碎，正中是梅干和黄澄澄的蛋，以她自己的手艺来说可以叹一声准备精心。 “太浪费了啊……” 幕3生活还是要继续下去，爱城华恋还是在各个广告片里串场打着零工，没工作的时候就奋力写各式各样的征集剧集，能入选的少，大部分的时候只是陪跑，但是的确攒出了不少经验。 她频繁的出入各个电视台，但很少有机会和光碰面。 又是一次去送稿件，她看见了神乐光。她穿黑色的长裙和白色绣星星的廓形外套，长长短短的珍珠项链叠在胸口，有非常漂亮的层次。神乐光在向洗手间走，却在进门前突兀得停在了门口，静止了数秒又若无其事得转了个方向向前。 华恋看着远去的神乐，走进了洗手间。洗手间里有好几个女孩子在聊天和补妆，看见有人进来停了一瞬，发现是不认识的人，穿着也随意极了并不是在这里工作的同事，便又放心得说起八卦来。她们先是嘲讽起某个色老头高层都硬不起来了还非要搞潜规则那套，然后又说起神乐光明明是海外归国派却连队伍都拉不齐。“深夜档”，她们用这个来代指神乐光，唧唧啾啾，从她可笑的的努力说到她过分精致和昂贵的穿着。 “看她的姿态能保持几天啦。”说着这个的女孩子一派天真孩子口吻，话里却浸着泡到极地冰水都洗不尽的酸苦毒汁。 华恋终于听不下去，冲出隔间维护神乐光。女同事想不到一个路过的也会有如此大的战斗力，一个扯一个，心怀背后恶言被当事人听到的恐惧，窘迫又愤怒地走掉。 华恋顺着走廊走，凭着直感进了楼梯间，果然发现了在天台呆着吹风的神乐光。她翘着脚，高跟鞋只挂在脚尖上，两只指头捏着燃了一半的柔和七星。 她听见玻璃移门发出的咯吱声，侧头往这边看了一眼：“是你啊。”平静地像被迫抽支烟再回头使用化妆室的不是她。 “你怎么学会抽烟了呢？” “之前有上司抽烟，头脑风暴和工作安排都在吸烟区完成，想要融进圈子，自然就会了。” “好臭。” 光看也不看贴着她坐下的华恋，吐了长长一口烟：“所以呢？看到洗手间的闹剧了？想帮我，那就把剧本卖给我吧。” “我不卖。” 光什么也没说，却也没走开，等着华恋接下来的话。 “让我加入你的团队吧。从头到尾和你站在一起，有什么我们都一起负责。” “你给我的价格远高于市价，这是不可以的。深夜档期风险本就不小，使用新人的剧本风险就更大，这对你来说太不公平。所以我不卖。 “我们一起制作，不管收视好坏，做出最棒的剧集吧。” 光先是愣住，然后低头发出抑制不住的笑声，她站起来，正面对着爱城华恋：“我们会做出最棒的剧集，当然也会创造出最高收视的剧集。”","link":"/2020/05/24/遇难船与北极星/"},{"title":"胃疼","text":"写在前面伯爵咕哒子 拖了蛮久 不过我终于写完并且搞完了校对排版准备带去CP24当无料发啦 希望大家找我玩wwww 幕1立香知道海黛是个漂亮姑娘。 这不该成为他们之间的话题。无论什么时候，情侣之间说起前任都是艰涩的苦战，而他们有很多别的话题可以聊。 立香在厨房烘焙配咖啡的点心，最普通的戚风蛋糕配方，步骤简单明了，立香把蛋糕胚送进烤箱后盯着暖黄色的烤箱灯看了一会儿，终于还是决定出去走走。 她想象过海黛的样子，柔顺得像金羊毛似的长卷发，嘴唇柔软鲜艳，穿着薄纱或是蕾丝裙，裙下的小脚系着银铃铛。 他有的时候会提起海黛，用非常随意的态度，仿佛海黛只是他某故交家的晚辈，或是他在另一个世界认识的人。 的的确确是另一个世界了。 想到这里的时候，立香猛然感受到鼻腔里渗出的一点湿意，她把外套裹得更紧些，往山上走去。她顺着他们常常散步的那条小道，依稀能闻见他身上绸缎、羊毛、皮革、烟草和硫磺火焰的味道，她知道这是错觉，哪怕之前他们并肩走在这条路上，她也从未闻到硫磺火焰——这是她想象中的构成他的味道。 他离开所在的那个世界，来到迦勒底，很多时候她会忘记这一点，忘记他不完全属于她。 立香迈着大步加快前进，好忘记一些经历——他们在路边干过一些坏事，这成为他们之间心照不宣的默契，在经过时，她有时候会悄悄去捏他的手。 那么他们也有过这样的……他会亲吻海黛的长卷发吗？他们也曾经有过心照不宣的牵手吗？ 立香站在断崖前，远处的山谷有一抹绿色，这片绿色是纯白色迦勒底为数不多的消遣。有一些树是他曾经教她认过的，然而这一次，立香遗憾地发现，那些不同深浅的绿色已经被埋在上周末的风雪里，而她总是不能区分。 他能区分吗？ 立香曾经迷信这个男人，他先天的聪慧和他后天训练得到的知识量都让她感到自身的贫乏——那么，事件结束以后，我可以嫁给他吗？为他的晚饭保温，为他把衬衫熨烫好，把裤子烫出笔挺的褶。立香有点被自己的想法逗笑，又有些伤感。这些日常场景实在是不太可能在他们的生活中应用得上。 然而海黛可以。海黛可以理直气壮地做一位女主人，然后笑着和仆从或是某一位上门拜访的夫人抱怨他不吃纳豆（或者别的）。 一阵熟悉的眩晕和下坠感包裹着立香，像是每次去特异点时那样，然而这种令人恼恨的心或是肝胆什么的落差只是来自于嫉妒。 她得承认，的确是嫉妒。 她在熄灯后偷溜去他的房间，橘色的感应灯在屋顶画出一条长线。她披着细羊毛的毯子，头发半湿，发圈套在手上。她输入密码推开房门。 立香一向喜欢爱德蒙的房间，整洁，不会做过多装饰，又隐隐约约透露出一些主人的品味。桌上成套的瓷器里突兀地多出一只粉色兔子图案的保温杯——这是她更喜欢来他房间的原因，她喜欢让这间屋子沾上她自己的一点气味。她轻手轻脚地走到床边，爱德蒙在睡梦里皱着眉。立香不知道为什么他没有等自己。也许只是因为今天他过分劳累。 立香掀起被子钻到爱德蒙身边躺下，突然的一阵凉风让爱德蒙动了动，然后他喊出一个名字。 立香躺在床上，柔软的床垫承托着她，她枕边是自己的爱人，他曾经像毛毯一样粗糙又温柔可信。 迦勒底在群山之间，而很久很久以前，这里也许是一片海。立香坐在海底，睁着眼睛到天亮。 只是前任而已，没什么大不了，立香想要这么去说服自己，然而海水灌进她的嘴巴，盐水从她的眼眶里迸出来浸湿枕头。 “怎么了立香？”恋人在晨光里醒来，他的卷发用丝带在尾端轻轻束着，丝带的宝石系脚把阳光折出绚丽的彩光。他在阳光下糊成温柔的影子，一个浅淡的印象。 立香把在脑袋里盘旋整夜的那段人尽皆知的故事清空，挤出惨兮兮的笑来：“早，我做了超惨的噩梦……” 她的嗓音听起来有些奇怪，像是含着一只肿胀的水母。 “你生病了？”爱德蒙又皱起了眉毛。 她内心深处在焦急地大喊，不要皱眉啊……她不想，不想回到昨夜的噩梦，不想再听到那个名字。 “又忘记把头发吹干了吗？” 他起床倒一杯热茶给她。她注意到，他尽管看向了那只突兀的粉色兔子保温杯，却还是理所当然地拿起骨瓷的茶杯，用小小的盘子托着递给她。 “我去找南丁格尔，你换只枕头乖乖躺好——” 接下来的事情她记得并不清楚，也许是热茶，也许是阳光，让夜晚的梦魇不再真实和赤裸，她换了枕头——他昨夜使用的那只，还带着一点轻微的凹陷——就昏昏沉沉地睡了。 立香猛吸一口山顶的冷空气，决定往回走。 “你的感冒还没有完全好，吹太久的凉风会加重的，走吧，我们回迦勒底，等天气再好点我们可以去那边野餐。”赶来的恋人什么也没发觉，只以为她的疲惫、精神紧张和沉郁只是由感冒、噩梦和生理期叠加造成的。而他一贯体贴，在这种时候只希望顺着她的心意让她开心一点。 那么—— 立香几乎就要问出那个问题了。然而那只剧毒水母仍然盘踞在她的喉头，让她觉出一丝腥甜。 她知道某一天，当她在海底吐出肺泡里的最后一口气的那一天，也许她就必须直视这个问题，必须直视他，逼问他的感情在哪里。 幕2黑胡子在迦勒底申请了一间活动室做酒馆。说是申请，其实也不过是收拾出间空房而已，把原本的清洁光源换成了昏黄的煤气灯，薄薄的杉木板拼成几张桌子，再从船上搬几桶劣质麦芽啤酒和兑水的朗姆，没有任何宣传就草草开业。 生意倒是不错。 迦勒底的生活过于一成不变，英灵们也都想找点乐子。在招待完几波出手阔绰自带饮料的客人以后，黑胡子的酒馆越发有声有色，有了下酒菜不说，还多出一堆风格各异的桌椅。 立香去酒馆找爱德蒙。她知道他最近总爱在那里玩牌。 酒馆里的环境说不上差，只是因为太多老烟枪聚集而烟雾缭绕。立香看见爱德蒙斜倚在他自带的沙发上同福尔摩斯说着话，他手里拿着烟斗，不知道因为什么爆发出一阵大笑。 “你们在聊什么？”她有点好奇，在沙发上坐下，随手抱过来一只织花蓝缎软垫。 爱德蒙给立香递了杯苹果酒，浅金色的气泡饮料里甜蜜的花果味道把立香从屋子里烟臭和啤酒酸的地狱里解放出来。 “刚刚在聊停尸房里的恋尸癖和宣称见了鬼的保安。”大侦探微笑着朝立香致意。 “你只是纯心要吓唬我。”立香蹙了蹙眉，猛灌一大口。 爱德蒙为侦探先生作证，他们的确在聊怪谈，那之后不知不觉就转向悬而未决的案件。他明黄色的眼睛比煤气灯都要更亮一些，亮晶晶地闪着光。 “这保安和恋尸癖准是一伙的。”立香凑过去发表意见，“这位恋尸癖和尸体原本是一对罗密欧朱丽叶，可惜一人死掉，另一位只好培养出怪癖。保安收了恋尸癖一百磅放他去和恋人再见一面，但他偷偷带走尸体，保安只好自己报案说半夜见鬼。” “事实上，除掉罗曼蒂克的部分，你猜得很对。”大侦探吐出烟圈，“保安为发财做买卖，允许其他人，不管是谁，做对逝者不敬的事情，反正火化后谁也看不出。不过通常是死者的仇人，案件里也是一样，死者是个‘体面’的商人，暗地里放贷、参与黑帮，他强占了鞋匠家的女儿和水果摊的小儿子。他偶然有一天吃牡蛎噎死了，鞋匠找门路，水果摊帮忙运送，把商人送给了恋尸癖。” “朝死人发泄怒火着实是无能了些，而且远不能遣散愤懑和痛苦，算不上什么复仇。不过故事还算曲折有趣。”爱德蒙的眼睛沉下来。 爱德蒙和夏洛克谈够了层出不穷的案件，转头谈起政治、战争、小说和现实、伦敦和其他城市。有些立香插不上话，有些立香可以，对于有些地方——比如远东，立香比他们还熟悉些。 黑胡子的酒馆没有歇业时间限制，说实在的，在店主人只提供桌板的情况下，连收费都主要靠黑胡子本人卓越的心理素质和厚脸皮。 立香在酒精的熏蒸下（她喝下了好几杯伏特加）没能支撑到后半夜，她靠在爱德蒙怀里，脸颊蹭着他的丝绸衬衫，脚尖飘飘荡荡，也不知有没有踩在实地上。爱德蒙架着她，胳膊卡得她肋骨痛，她发出不舒服的哼声。 立香有过一任男友。 虎牙，明亮的眼睛和宽额头，粗短的手指上有很笨拙的指甲，总是假装什么也不在乎，走路的时候稍微有些外八。他在什么部来着？应该是很多人的运动部门。立香对庆祝宴会上的烤猪梅肉和菠萝啤酒还留有印象，却也只记得这些……她被他的庆功宴会排除在外，不被允许加入他和他朋友的话题——他们似乎认为女生天生就该什么也不说地沉默着。立香和他的恋爱维持了不到一周。那之后他很快就有了新的女友，会在赛场外为他尖叫加油递水杯。 爱德蒙是不同的。他真诚、得体、足够坚固、足够尊重。立香对此感到安心和放松，就像史莱姆找到一块被太阳烘烤过的温度适宜的花岗岩。她可能在现实里也笑出来了，因为她贴近恋人胸膛的耳朵听见一声短促的叹息。 她在迷糊中被喂了解酒的梅子汤，然后被剥掉衣服塞进被子里。她想抓住恋人的指尖然后说些什么，可其实只是手指蜷了一下，嘴里嘟囔着——每一个醉鬼都这样。 爱德蒙替她熄了灯关上房门。她听不见他是怎么离开的，她生气他就这么走了，又觉得他离开也很好——自从立香上次“感冒”以来，他们有一段时间没睡在一起。因缘巧合，也可能是立香没理清自己的想法而爱德蒙察觉了立香的后退。而每一次，每一次立香都无法说出口。 “我要失去他了。”立香翻了个身，蹬开被子。她想起海黛，想起雪中的松树和浅金的气泡，她觉得自己没有再为此感到焦虑和痛苦。 幕3立香在头痛和背痛中醒来。 她躺在地板上，身下是厚厚的织毯——但并不在迦勒底。日光透过房间顶上的玫瑰色玻璃窗落在她脸上和她脑袋下的蓝缎软垫上。立香认识这只软垫，这是她在酒馆常抱的，上面还有她指甲勾出的划痕和偶然沾上的酒渍，可是她并不认识这间挂满织锦帘的、地上堆着同款软垫们的房间。 她意识到了什么。 然后她看见房主人，耳朵上戴着钻石耳环，身上穿着绣金线玫瑰的长裹身裙，露出细雪一样白的胳膊和胸脯，拖鞋上有一串彩色小珍珠。她的眼睛大且圆，有一种天真温柔的女性气质——既像母亲又像女儿，准备好被牺牲，温驯又仁慈。她的美貌被精心修饰，关在金笼里。 “海黛。” 她见到了海黛。 或许你们知道房间里的大象的故事。 人们无意识、或是有意识地，绕过了那只房间里的象，试图不打破平稳的现实。 立香觉得自己是那只误闯房间的象。她穿着小兔子图案的睡衣睡裤，衣服上的数码印花因为多次在洗衣机中翻搅而有些剥落，和这间屋子格格不入。 女侍在她周围走动交谈着，因为要避开她而走出一条圆弧形。而她只能缩着脚趾，尽全力用身上不知道是谁——应该是海黛——拿来的花呢毯包裹住全身。 海黛态度友好地向她搭话：“你是谁？你从哪里来？” 立香怀疑自己也许是在演一出滑稽戏，没有观众的叫好，但是她也许该借着酒精的余味装一装神棍。但是她实在是太头痛了。于是她只是虚弱地询问有没有加冰块的水——她不知道这里处在什么季节，或许这里没有冰块——不过管它呢，她急迫地需要嚼一嚼冰块给自己糊成一团的脑子降一降温。 她们终于坐下来吃起了早饭。极其日常的搭配因为厨师的优秀而显得丰盛又诚恳。海黛神色自若，听着宿醉的酒鬼半是咕哝半是呓语的解释，偶尔有一两句高声也很快就被冰块堵在喉头。 “这么说，你是从另一个世界的未来回到这里的？”少女托着腮，叉起一小块蘸蜂蜜的软面包。 立香小心地使用着餐具，以免发出刺耳的敲击声，或者至少小声一点。她对理解和解释的流程习以为常，对餐桌礼仪则是深恶痛绝。而她还没有想好要如何描述她和爱德蒙的关系。 “你在那个世界也认识那位大人吗？你的世界里那位大人是什么样的呢？”少女又坦诚地问道。 立香正奋力磨着香料，她愣住，一边动手一边慢吞吞地组织着语言，狡猾地玩着文字游戏：“我从书里认识他，还有你。” “不，不是历史里的他，亲爱的，也许你不知道，但是你和他的关系一定比你说的要更亲密一些。” 蛋糊加了太多的胡椒，立香被呛出一声咳嗽，又急忙将其憋成一声闷哼：“……我认识的人是那位大人一部分性格和经历的映射。” 立香讨厌这么描述。 讨厌将爱德蒙描述为英灵。 那似乎意味着她必须承认爱德蒙只是英灵殿上的他的一小部分，他对她的爱也一样。 而这同样意味着爱德蒙并不像故事里那样最终获得了心灵的宁静，他永远被复仇的火焰侵蚀、折磨着，他从不像他表现的那么平和。 是的，这是立香一直在努力忽视的事实。 她在这个早上，在头痛中，在她一直以来的假想敌面前终于承认了这只大象。 “我认识的那位大人，以复仇者的身份存在着。” 没有人能比海黛处理得更好。午夜家中突然出现的访客，自称来自未来的远东的女性，言辞间又对自己有所了解。如果是立香自己遇到这样的状况，也许她早就让女侍友好地将其带走交给——不知道什么人，也许就是带到门厅外让其自生自灭吧。但海黛不仅准备了食物，甚至还取出衣服饰品，好似要和她做一对亲亲热热的姐妹。 立香当然在书里读到过海黛的聪敏和她坎坷的幼年时代，但是直面这一切还是让她自惭形秽。 在她们终于结束并不那么和谐的、漫长的早餐之后，女侍围过来为海黛换上出门的时装，今天她要去听音乐会。 海黛亲热地在一位女侍的耳边说了几句，那位女侍严厉地盯住立香，随后抱出了一条香槟色的绸缎裙子。 “不一定合身，但是足够让这位小姐出门啦。” 立香在簇拥下换上层叠繁复的大蛋糕，顶着重了起码三倍的脑袋挽上了海黛的胳膊。 事态的发展显然有些失控。 立香从没想过她们的见面会是这样的。她想过泪水涟涟或是激烈愤怒的争吵，甚至是针对性格和形貌的羞辱——净是些隐秘或直白的恶意。但是她们现在坐在同一辆小马车里，裙边堆积在一起，从一袋盐渍葡萄干里捡出饱满的果子互相喂食。 “你驾驶过单人马车吗？”海黛问立香。 “我们不再用马车作为交通工具，虽然没有试过，但是我还算擅长驾驶。” “我曾经在指甲上画上花。” “那块玫瑰色的天窗，我从一个吉普赛人那里听说过用星象占卜的方法，我有时候会透过那块天窗的栅格来计算运势，过去未来什么的。” 她们驾着双轮马车到郊外去，在傍晚悠闲地任那匹温顺的斑点小母马到路边啃食苜蓿，立香感受到熟悉的眩晕，她只来得及仓皇回头看海黛一眼，就倒回迦勒底。 那个小姑娘，又将是一人。 幕4立香在走廊上回过神来，周围没有人经过，她溜回自己房间，挣扎着把海黛的衣服撕扯下来团好塞进衣橱最深处。 “前辈今天不舒服吗？一整天都没有看见前辈，稍微有些担心……前辈，晚饭也不吃吗？”玛修抱着芙芙叩了叩立香的房门，在门外向里喊话。 立香睁开眼睛看着天花板，她已经重新取出一件睡衣——旧睡衣还在海黛那里，现在这件其实只是超大T恤。 她正拆着头上的发辫——海黛的侍女为立香重新编发辫的时候花了很多心思，编进名贵的珍珠和大小不一的细碎钻石发饰，立香揪得头皮紧绷，疼得直抽气。 “很快，帮我留一份吧玛修，我——我遇到一些意外需要处理。嘶——”立香隔空回应。 门外玛修的脚步声渐渐远离，立香放弃和发辫做搏斗，顶着拆一半的头发躺进床里。 松软的枕头把她的脑袋包裹着，立香清楚的感受到右边有一颗石头硌着她的脑袋，但是她试图不去管它。 她想起早上浸入汤水里的袖子——那是她被胡椒呛到之后。那个时候她觉得海黛好得不得了。她们去骑马、听音乐会，约定好逛断头台——这一切都让立香感到新奇，她们甚至没顾得上吃东西，光靠果脯打发肠胃。 爱德蒙在更晚一点的时候为她送来晚餐。 立香听到门禁被打开的嘀声和锁扣啪嗒一声打开的轻响。 “醒了？”爱德蒙走路的声音很轻，也许是因为他穿着非常柔软的小羊皮底的便鞋。 立香走路总是啪嗒啪嗒响，走到哪里都能让声控灯亮起来，立香承认有时候她是故意的，尽管这会让她显得粗鲁而“不像个淑女”。她喜欢声控灯亮起又熄灭的样子，这让她仿佛拖着一条流星的尾巴。 在这以前，她还在学校的时候，有过露营的经验，那时候经常有流星雨的播报——可惜立香一次都没有遇见过。他们在山谷里，防潮垫表面是银色的，能映出手电的光。绣球花开得到处都是，极漂亮，但是没有星星，那是个阴天，他们早该知道的，但是他们不肯看天气预报。半夜下起雨，他们在睡袋里瑟瑟发抖，只能挤到一块儿，天还没透亮就在蒙蒙细雨里收拾东西离开。他们包括立香本人、弟弟、和妈妈，那是一次难得的假期，虽然便利店的炸鸡因为被闷在袋子里而变得又黏又软，但掉下的碎块引来了好几拨蚂蚁大吃大嚼。他们回到家被安排着迅速泡热水澡裹好被子预防感冒，但仔细回忆起他们的脸时，立香却只能想起浴室里厚厚的、白蒙蒙的蒸汽。 如果醒得再早一些，或许能看到她窗里的星星。 “晚餐是咖喱。里面有炖得酥烂的牛肉丁，味道很不错。”爱德蒙把打包好的晚餐一一打开，浓重的香气极快速地弥散开来。 立香这才感觉到自己已经饥肠辘辘，饿得几乎要闭气，又因为吃了太多酸果脯而有点恶心。 她顶着蓬乱的头发直起身来。 “我今天去了巴黎。”立香犹豫了一下这么说道。 “那里阳光很好，玫瑰色的窗户让人整个儿都懒洋洋得。” “我想你认识那片窗户——” 立香觉得自己还不够坦诚——她又忍不住在绕圈。 “我是说……我今天见到了海黛。” 立香无法收回出口的话，但是她感觉到一阵轻松和精神上的亢奋，真奇怪，她原以为自己一定是如释重负的，甚至因为放松而昏昏欲睡——但是她没有。这阵亢奋让她脸颊呈现一种瑰丽、非常态的粉红色。 她拉住爱德蒙的衣袖，后者正在排布饭桌，将保温饭盒里的咖喱倒入成套餐具里。 “爱德蒙，我遇见了海黛。”立香又重申一遍，坚持希望看见爱人的脸孔。 “好，然后呢？”爱德蒙有些无奈，他意外于立香仍然在意这一点。 要说他对立香隐约的不自信和嫉妒毫无察觉，那必然是假的，但他无法给年轻的恋人以回应。 他是十八世纪的小说中的人物。他对海黛的感情一直以来都为世人所知——但对他自己来说并不光彩，曾经，将小女孩养成亭亭淑女，接着让她在金丝笼里成长为信赖、依赖着自己的爱人只是主人公的风流韵事，也是绅士魅力的一部分体现。 但是如今，他的行为不能算是全然无可指责，御主却又是这副幼小的姿态——他当然知道御主身心健全，与曾经的状况又有所不同，但他不敢主动，当御主退却时，他只能后退。 他在至今为止的很长一段时间都不是感情上强势的那方，只是为什么会在此时——。 “那么你决定放弃我了吗？”爱德蒙摁了摁额角，再抬起头又是平静坦然的一张脸。 “不。”年轻的御主脸皱巴巴的。 “海黛是个好女孩。”她补充道。 立香对爱德蒙产生了一种没来由的愤怒，这愤怒让她难以自抑地生出某种酷烈心思。 她想要破坏什么，但是爱德蒙依然是沉静的、平和和接受一切的，这让她看起来像是在无理由撒娇的小孩子。 她想要大喊，想要让爱德蒙背着他厚重的负罪感、去墓园里坐着——他仿佛一直以来都背着自己的墓志铭，他身姿挺拔，但有时候你就是知道他塌着背。 咖喱香气越来越勾魂夺魄，但是立香摁住开始隐隐作痛的胃，她已决意要解决他们之间的问题。 立香看着爱德蒙的脸。他侧过身，暴露在立香视线里的只有额角和侧脸的一点弧线。他的皮肤不知是因为健康问题还是胡茬的存在泛着淡淡的青色。仔细看的话能看到脸上由于不注意保养而出现的晒斑。 英灵的年纪着实难以探究，要用他们表现出的生理状态来判断年纪也似乎没什么意义。立香是头一回这么仔细地打量爱德蒙的脸——这个一直在处在复仇的痛苦中的男人的脸。 他的愤怒和哀伤一直存在，尽管故事有美好的结局，但是这里的爱德蒙呢？ 立香想起自己其实从没那么在意过。 他们是怎么开始的？ 一开始是在石窟中，后来是深夜的拜访，好像在她需要他的时候，他一直在场。 立香喜欢伯爵书里的形象，谁不喜欢呢，但是她无论如何也不能爱上那个曾经的伯爵——这是这趟晕乎乎的旅程告诉立香的最重要的答案。她和海黛本来就不是什么竞争、或是前后的关系。 她们恋慕的对象不同。 而爱德蒙很早就知道这一点。 哪怕是海黛也是一样，她举着水烟，吸一口，再以巧妙的方式优雅地喷出——就像立香无法爱上那时的爱德蒙一样，她也无法理解水烟要如何优雅，为什么是上流的爱好——她清楚地知道自己和立香没有关系。 于是她以最温和最客气的方式招待了一位危险分子，并让这位可能对自己心怀恶意的危险分子灰溜溜地回老家。 愚蠢的只有立香自己——她再一次认识到这点。 “你是怎么看我的？” 咖喱逐渐冷掉凝固，从勾魂夺命香变成令人不愉快的油脂味道。立香终于决定打破这漫长的凝视。 幕5很难说清在经过那一次糟糕透顶的谈话后他们之间的关系有什么实质性的改变。 日程照旧，世界也还在等待拯救，超级英雄没有儿女情长的余裕。 而问题的解决依旧得交给时间，大概就像爱德蒙说的那样。他们跳过情侣磨合直接进入热恋——就像某种战时特殊政策，跳过琐碎日常直接切入最核心的问题。但日常还是会抓住每一个逃避它的人痛殴一顿。 立香知道她的伙伴里不缺乏成熟、有经验又诚恳的人际关系处理大师，但是她不想征询他们的意见。她希望将这件事限于他们两个，或者说三个人之间。 圣诞节前夕立香收到一本植物图鉴，是玛修送的。 小姑娘忸忸怩怩搓着芙芙的肉球，说偶然在仓库里翻到植物图鉴的样子极可爱。 她们煮了一壶酸甜的蜜桃柠檬茶，边看图鉴边给芙芙梳毛。立体投影装置尽职地播放着米奇妙妙屋——立香屋里的这玩意有点卡机，也可能是某位英灵的恶作剧，不论投影什么都得先来一遍。 “迪〇尼警告了解一下好吗？” 片尾曲播完总算轮到图鉴对应的投影片。玛修关上灯，和立香一起一头扎进虚幻的绿林。 “前辈和岩窟王最近怎么样？” 她们穿越红醋栗和苹果树林，经过挂着鲜艳浆果的小灌木，躺在草地上，丛生的飞蓬在她们周围循环着开花和凋敝的过程，投影灯和拟太阳都热乎乎亮堂堂让人无法区分。 立香摁遥控把景象固定在花草繁茂的时候，然后抱着芙芙在地毯上滚半圈又回来。 “怎么突然问这个问题？” 玛修推推眼镜：“因为大家都很关心，前辈，如果岩窟王做了什么不好的事情，一定要告诉我。” 这个小丫头总是过分严肃，像随时可以射出箭矢的紧绷的弓，明明是盾的勇者来着…… “没什么啦，已经解决了。” “这么说确实有过问题？”玛修十分肯定，“这么说确实该和他打一架。” “诶——？” “是开玩笑啦。”小姑娘特别开心恶作剧成功。 “不过，前辈，虽然不知道你们之间发生了什么，但是你们不像是已经解决了问题。” “这么明显吗？”立香搓了搓脸。 “前辈最近都没怎么笑过，做日常练习也都磨磨蹭蹭（浪费大家时间），以往都会用最快速度暴力解决（好去谈恋爱的）。” “你偷偷加的吐槽我听见了……”都说近墨者黑，可是在这方面立香绝不承认玛修受到自己的影响，一定是哪个恶作剧英灵，查出来一定要把他的年假扣光扣光！ “明显没有解决啊……” 送走玛修和芙芙，立香又点开植物图鉴的文件，却只是重看了一遍米奇妙妙屋，在片尾曲时就盯着咖啡杯发起愣来。 “御主和海黛是不同的。”爱德蒙站得笔直，他说得很慢，似乎在很困难地挑剔着措辞。 爱德蒙用了很正式的称呼，立香却很怕他是在划清界限，她扑进他怀里，手从两侧卡住他的肋骨，头埋在他胸口。立香后悔自己开了口，却也很庆幸自己总算问出问题，但她无论如何也不想看到爱德蒙现在的表情。 立香感受到胳膊下的身体有一瞬紧绷，又放松下来。爱德蒙把手搭在立香肩上，停留一下，把小姑娘轻缓地推开。 “立香，”他还是选择了更亲密的称呼，“你看清楚，现在的我在这里，不在我们都熟悉的那座监狱塔，也不在你所担心的巴黎。” “但是你应该再想清楚一点。”他的神情让立香止住再次扑上前去的冲动。 “不要着急，”他努力勾出一丝很淡的笑意，“我们还有很长的时间。” “可我没有那么多经验，我也没有办法清醒理智不受任何影响。”立香半垂着头，她盯着爱德蒙的脚尖，估算它和桌脚的距离长度。 “我以为你是最好最好的，我们不会有任何问题。” “爱德蒙，我很害怕。”她盯着恋人的胸口银质的怀表链，在沉默的空气里默数秒针的啪嗒声。 她从曾经的普通国中生的经历里找不到任何解决问题的参照，她不是天真地以为恋爱可以毫无磕碰——少女漫画还要历经不少磨难呢——只是，可是，对象是爱德蒙，是她一直全然信赖的他。 他变得轻飘飘，变得不可捉摸，让她不能再全然交出信赖。而他怎么能就这样一直后退？ 那么只能由她走上前去，必须由她走上前去。 “我听见你在梦中呼唤着海黛。” 男人有些震惊，眉梢挑起。 “爱德蒙，我很害怕。”说着害怕，实际上女孩终于抬起头来，逼视恋人的眼睛。 男人仓皇后退，因为撞到凳子踉跄了一下。 “这绝不是因为你仍然在爱着她，对吗？”立香越说越顺畅。 最后的问题太痴缠了，难怪爱德蒙都没听完就跑出门去，留下立香一个人用热水温咖喱吃掉。 那之后到现在，立香甚至很难见到爱德蒙——他不知道正忙于什么事情。以至于她听到玛修的询问忍不住有些委屈。 临近圣诞，黑胡子的酒馆生意愈发火爆，而且装饰愈发像个正经酒吧的模样，终于在圣诞前两天连店老板也被换掉——这下该叫贤王的酒馆了。 立香干脆把圣诞活动从餐厅搬到这里，因为地方狭小、挨挨挤挤还比在餐厅里显得热闹些。 她依然没看见爱德蒙，但是今天明明连日常加班的孔明老师和梅林都在休假。 奇怪，梅林—— “就是这家伙在我枕头上做了手脚。”爱德蒙拖着一只巨大的六角恐龙从场外进门，福尔摩斯笑眯眯跟在后面。 “我莫名做噩梦、你掉进原作世界，全部这些。”他风尘仆仆，眼睛亮得像巨龙、像灯塔。 “立香，我——” 等等！不能在这里被公开处刑！不管是什么都给我私下再说。立香惊出一身冷汗，随时准备去捂住恋人的嘴。 “大家都知道的事情没有什么好瞒的前辈。”玛修边吃着小番茄边起哄。 究竟是谁教坏玛修的，她一定要去找他算账！ “他还企图在迦勒底所有立体投影中插入魔法梅莉的广告。”福尔摩斯笑眯眯补充道。 “梅莉酱最近跟我通信时教了我很多。” 好啊！罪魁祸首原来就是你六角恐龙！ “很抱歉，我曾质疑过你的情感，认为你无理由地脾气反复。” “你没有说出口，而当时你不了解全部情况。” “立香，我……” “没关系，我们还有很长时间。” 圣诞过后，无休无止的风雪停下了，爱德蒙和立香手牵手走在他们常常散步的小道上。 六角恐龙受到制裁，提前排演的独幕剧顺利演出，一切似乎都在往好的方向行进。","link":"/2019/04/16/胃疼/"},{"title":"重庆！重庆！","text":"写在前面年度团建活动，湘和发争夺主办权，最后发鹅凭借小猫咪和火锅让重庆赢过了具有地理位置优越性的杭州。不过我只会发出“我都可以”的声音所以怎样都好啦。本次团建我的最大遗憾是火锅没吃够，不过我依然将吃了什么作为了日记的重点……虽然我对吃的没什么执念但是火锅真的好吃，阿政在这方面是真的没有审美（不要说吃的不算审美，我说算就算。 出发之前事件：购买车票你们湘说好了（？）前一晚来睡我，临时（到买票的时候）又决定自己一早从杭州出发再到南京转车了，这人咋这样！不过之后睡了她很多天。 事件： 买鸭子吸取上次把鸭子背到广东结果坏掉了的教训，这次我用了双保险，能够长期保存的盐水鸭+新鲜打包的板鸭我们总能吃上一个的！不管是盐水鸭被发鹅提前吃掉还是板鸭坏掉都有备选方案嘻嘻。 事件： 如何才能讨好一只（或两只）小猫咪总之买了逗猫棒和小鱼干，希望能够获得雷雷狸狸的爱，但是事实证明我想多了，雷雷爱所有人类，狸狸讨厌我。 9.28事件：乘车清早其实还是有点忐忑的，与人相处之前先开始紧张也是我的常态了。不过见了面就很有话讲了，湘鹅的猫猫t真的好可爱。 车到武汉之前基本上是平原，我还找了一下上次去武汉群聚时经过的金寨，在我印象中特别好看，从黑漆麻乌的山洞里驶出的时候铺天盖地的绿让人完全脱离凡尘俗世，是非——常漂亮的山丘。 为什么我描述这么多呢…… 因为我发现……我是真的没有见识…… 离开武汉（姑且就拿这个做分界吧，因为别的地点我记不清楚了）后，我们经过了山山山洞洞洞山山洞洞山山洞。山都美得毫无灵魂，全tm绿油油一个样子。 雅湘跟我同时发出东部人民惊叹，特别是发现手机没有信号的时候……还有很多问题发言就不细讲了（比如山里的小溪怎样怎样），总之基建狂魔是真的爽，一直基建一直爽（bushi 没信号的时候我终于把拖拖拉拉没看完的寡妇爱上掏粪工看完了，之后又看了篇午后曳航，三岛的路数我不太吃，金阁寺我只记得内翻足，掏粪工看完印象深刻的有不少但实在爱不起来，希望春雪好一点。 中途湘鹅抱怨无聊。我：不如把阿政的翻译搞完？ 湘：不干。 咕咕不愧是咕咕，叫得真好听。 早餐：k记帕尼尼早上发现只有帕尼尼可卖，随便买了一个对付下 午餐：高铁外卖我们！尝试了！崭新的！生活方式！ 不过只有很少的站点提供外卖服务，我们在安徽下单只有汉口有服务那时候已经下午一点快两点了而且德克士也不怎么好吃……在车上仅有一点美蛙鱼头的念头能安慰我 晚餐：美蛙鱼头终于抵达重庆！发鹅和湘不约而姐妹，同样穿了猫猫T。行吧，你们rio，我是流泪猫猫头罢了。 到了发鹅家没来得及玩弄小猫咪就赶紧出门恰饭，美蛙鱼头真好吃，蛙蛙真好吃呀真好吃（在写这个的时候我的肚子叫了起来），粉也好吃，菇也好吃，鱼就是鱼。免费饮料有点太甜了但毕竟是免费的！发鹅的小伙伴很外向，跟不认识的人也聊很欢，是个甜妞。 豆知识：重庆话里帮厨叫墩子。 晚上彻夜玩弄夏大雷、打拳、玩分手厨房、玩弄夏大雷 睡眠是最不需要的东西（不是你们这群人快给我去睡觉啊凌晨三点钟了？！ 9.29事件： 钓鱼台我们是第二天才知道，这个发是第一次上高速。 但是对我来说没差因为我上车就睡着了……所以湘鹅的游记里有多次经过嘉陵江/高速见闻/山城路等，而我的游记里只会有（睡得）真香！发鹅开车真平稳！ 水军路真的很好笑，侧翻的车也很好笑。 我历史比较差，对钓鱼台的历史意义是没什么看法，去湘鹅博客能找到详细资料，风景很好，蚊子很大，冰棍很贵，还有九口锅。哦，我们还拍了沙雕自拍合影，比三角形比星星比爱心（但是效果是阿姆斯特朗回旋加速式阿姆斯特朗炮）。是真的快乐。 早餐： ？？？前一天三点睡第二天怎么可能还有早饭吃 午餐：糖醋味儿的江湖菜我们就不该让江苏人点菜.jpg 豆知识：粉蒸肉里原来是有红薯的！糖醋茄子和糖醋鱼一起吃是会逼死重庆人的！ 晚餐：我失忆了说真的，我们到底吃了什么？ 我想起来了 我们吃了蛋糕和烧烤！ 虽说一开始是想要吃中午的剩饭来着，但是在钓鱼台的时候我和发鹅一拍即合决定定个蛋糕吃。反正祖国70周年我2x岁雷雷狸狸1岁放在一起过啦。 雷雷狸狸：你们看我们是高兴想吃蛋糕的样子吗？？？ 然后因为吃蛋糕没吃饱又点了烧烤。（我从前没吃过的）鹅肠真好吃啊！希望我的常备选项千叶豆腐和豆角也能被你们喜欢靴靴！回南京以后因为思念美味鹅肠又点了一次，但是有味儿/湿冷了让鹅肠没有了记忆的滤镜。嘤。 打了拳，玩了分手厨房和马里奥赛车。让我坚定了双十一买NS的决心以及坚决不买马里奥奥德赛的决心。问我为什么？分手厨房里除了煮饭什么也干不了的我，和除了煮饭什么都要干还要煮饭的发都会给你答案的。 9.30事件：买菜 接人 到北城天街附近看电影买菜好快乐啊！这个超市里菜看起来漂亮，种类又齐全，不知不觉菜就堆了一整个购物车……但实际上我们菜还没买齐，最重要的饺子皮被遗忘了。 豆知识：买菜也可以用饿了么的哦。 发鹅在午睡，而我在玩弄夏大雷。非常宁静的午后时光。可惜我自身身体素质不太好，雷雷踩奶的时候居然会痛……要么双手抱胸让他踩手要么堆被子让他踩被子，真是甜蜜的负担。 四点多我们接到了在麦当劳等待的阿政，黑长直菜刀眼真的很好认。一边吃冰淇淋一边等阿左，我的麦旋风到接到阿左我们离开车站都没吃完…… 刚见到阿政的面我就尝试了M6，看视频和文字工作应该都不错，但是想要写字还是有些勉强……北城天街的华为和苹果点正好对门儿，我和阿左在逛了两个店之后都还是哭着选择贵的（当然没有买）。（阿左今天（10.15）选择了M6） 从这边到吃饭的地儿要走挺远，路上有个卖国旗的小哥好可爱！ 吃完饭去看电影啦，我们在大辣椒前面合了影（只有手出镜），另外逼迫菜政和辣椒合影，民间偏方是和辣椒合影并把照片枕在枕头下就可以逐渐能吃辣了的，希望下次见面政能感受到毛血旺有多好吃。 在看电影的商场里谭木匠正在做活动，可以自己做梳子并刻字，拥有很多梳子的雅湘不为所动，被狐狸迷了眼的我和阿政当然一人一把狐狸造型的梳子并且刻了赤灯的标题（在刻字师傅敦促的眼神下用特殊字符一个个选出来的日文平假名全都是阿政的心血），发鹅买了猫猫梳，阿左没有买梳子，她想买鞋。 但是这双鞋在昨天（10.12）才买。 电影院标配可乐爆米花当然得要，但是负责爆米花的我只吃了半桶嘻嘻 原本定的票是中国机长，但是临时看到了怒骂的弗兰……我们立刻重新买了我和我的祖国。 第一趴真的nb，我抽出纸巾的时候发现旁边的菜政摘了眼镜……对的就是群众送东西那里。 第二趴主要是靠任素汐撑着的，任素汐nb。 第三趴拍的很好玩啦，天线太烂了那里大家一起喷了，最后吴京出场就……行吧玩梗以及露个脸嘛大家都懂。 第四趴在汶川地震这个题点出来之前我都……靠着什么玩意不想看，点了之后就可以不错。 第五趴我出门去洗手间……然后这里有非常尴尬的一个条件，那就是我没接触过票根，不知道我们在哪个厅，还有一个条件就是，这一趴里，有国歌，也有英文对话，最后一个条件叫做，相邻两个厅，前后脚再放这一趴。 从洗手间回来的我，听见4号厅有国歌声，好的我们肯定是4号厅，打开一看，是歪果人讲话，行吧我赶紧退出来，再一听，欸放国歌的是5号厅，我刚刚肯定是听错了，那么赶紧跑到另一边，推门一看，欸怎么是讲粤语的惠英红老师？就这么来来回回好几趟，我才终于看清了自己的位置。 第六趴陈凯歌死了，多给他一句评价都是对我理智的折磨。标题这么好听拍出来却是个shi 第七趴姐姐真好看我好可以，大飞机真好看我也可以。 早餐：小面老板家的小橘子攀爬技能树点的很高 面条分宽面和细面两种，我们平时吃重庆小面都是细面，于是我当然选择了宽面（名词叫啥我忘了） 虽然我没有吃完但是真好吃啊。 午餐：豆花牛肉中午湘去和别人约会，就剩下我和发和雷雷狸狸四人世界！ 我们在去吃饭的路上对过路小学生的国庆表演服校服和妆容进行了无情的品评，最后达成了背带裤世界第一，眉心红点是国粹等重要共识。 我们在户外吃的豆花牛肉，吃着吃着就下雨了……毛毛雨不影响不影响 我觉得非常不错的一个饼，发鹅非常不屑，说她做的更好吃，可惜最后也没吃上她做的呜呜嘤嘤。 晚餐：江湖菜好辣！没有吃太多菜因为对我来说有点太辣了…… 豆知识：辣子鸡正宗做法是放麻花（有单独辣子麻花卖吗我想买了吃），毛血旺每家餐馆的料都不一样。 点了桃花酒很好喝，我跟阿左吨吨吨。 最后一起点了冰粉摆拍。吸溜吸溜。 10.1事件： 阅兵 包饺子 狗咖复制粘贴 快递正义 大型原木运输车展 粉尘污染教学 海军受迫害实录 我可以 好啦月饼就这么多内容了，反正再多也讲不出花来微博段子比我有趣。 包饺子是本次重庆游的特色和重点内容啦。 白菜阿左剁的，肉馅发发调的，我打了会儿下手，然后和良一起包了饺子，发发还教学如何包抄手（就是馄饨），下锅是湘鹅。下锅的人比较吃亏反正湘就没吃上抄手。（没吃到抄手的是阿左，湘鹅是只吃到了几个水饺）湘鹅的醋是真好喝，香！燕云自觉主动承担了拍照录vlog的重任，不过后来大家都忙着吃就不记得这回事惹。 狗咖好啊！柴犬可爱啊！狗子们一开始都在睡觉，后来起来了就开始打架，但是柯基的耳朵柴犬的脸都是名品，捏了不亏的。燕云被柯基踩着飞了过去哈哈哈哈哈（我这人真坏坏。 早餐+午餐：板鸭 水饺 炒粉鸭子是我带的！虽然没有切导致风味没有那么均匀（毕竟连皮带肉蘸点卤才是坠好的），但还是yummy嘻嘻嘻 阿左的炒粉好大一碗！吃完了水饺抄手我就不行了但还是强行塞了小半碗炒粉，yummy嘻嘻嘻 晚餐：老火锅本来计划是去动物园，但是早午饭吃完收拾完已经四点钟了……于是我们直接去吃老火锅去啦 豆知识：鸭血冷锅就得放，然后就会很嫩很好吃。 （这条豆知识请大家牢记并背诵） 老火锅真好吃啊，虽然吃了什么吃了多少我已经忘记了，但是真好吃啊 我和左还在厕所门前自拍了（所以为什么要在这里自拍啦（但是有镜子就忍不住（这个时候发还在卫生间（所以我们为什么要在这种地方自拍啦（是我的锅 临走湘准备玩梗：老板来瓶冰kuoluo 老板：没有冰可乐雪碧行不行？ 我：有可乐的在旁边。 屋子里顿时充满了快活的空气。阿政喝上了可乐。 等吃完我们才想起来明明是红裙趴却忘了拍照……找了路人妹妹帮拍，发鹅给我和阿良一人P了一条狐狸yiba，就简单纯粹的快乐，爽！ 10.2事件： 定番博物馆 动物园博物馆看起来有年头了……进馆就因为各自喜好迅速分散开来也是定番了，像菜政就在红色展区流连忘返，而我就只钟情小种大熊猫的头骨，怎么港，狗头人萨满的人设不能忘。 陶的瓷的大罐子都很一般没啥特色，比较有兴趣的夜宴图不出展，我和阿左最后只能在文创区快乐购物，以及被大风吹。 买了拼图！我老早就想买拼图玩了，这边正好图不错也不贵，快乐。 动物园我们先看了鸡鸟。 走地鸡鸟是鸸鹋和孔雀和八哥雌鸟和真的鸡。鸸鹋真的大。 鹦鹉太吵了，脑瓜子疼。 锦鸡好看！ 他们有绿孔雀！！！！还有蓝绿杂交孔雀还有白孔雀还有随处可见蓝孔雀，但是他们给绿孔雀笼子上表了蓝孔雀哈哈哈哈哈哈。 遇到熊孩子喂鸡吃零食，发鹅勇敢地发声教育了一通。发真棒。我的话在小孩儿们说出“我看鸟挺喜欢吃我们喂的呀”的时候就会暴怒要么走开要么揍人了，发居然立刻有了“你也喜欢吃零食但是也不能拿这个做主食”的回复，我看是带夏大雷带出的经验。 看完鸡我们看了熊猫，饲养员斗恶熊好看，熊熊爬树好看。我看得起劲的时候，发鹅发了句：我先去看熊猫崽子了，晚了他们要收猫的。反正这句收猫就很灵性，我立刻就去看小崽子了。崽子都睡得七仰八岔，粉粉的小鼻子小嘴儿让阿伟再也没有起来过。在我沉迷崽子的时候阿左这个狼女人洗劫了纪念品店购买了很多熊猫周边。然后我们欣赏了一会儿小熊猫喝奶，就赶紧去寻找云豹！金猫！豹猫！啦。 路过了平平无奇的狮虎熊，我们见到了湘鹅的挚爱们。这个时候我的脚已经断掉了，阿左也差不多，阿良因为一直没有高光让人判断不出状态所以我人工判定她也不行。 不过猫猫们值得。云豹一直在睡，金猫除了专心等饭就是在睡，但是豹猫小宝贝在跑酷，冲刺爬树到处乱钻，最近的时候离我们也就一个通风口！四舍五入我抱到了。 猫猫们旁边是因为换季（？）有点秃的狐狸们。看到了白狐阿良迅速复活并迫害小命大人。 我们还见到了混在一群貉里的萨摩耶白貉！可可爱爱。 我不记得我是怎么走出动物园的，我也不记得上车后我们是怎么到的发鹅家附近…… 湘鹅和发鹅的体力是真的不一般。杭州绝不能放这个湘安排活动。 早餐：腌面政委居然连切肉都不会就敢给我们做饭……我怀疑这个菜政想下毒。 枸杞叶居然是可以吃的！而且煮汤味道还行，香气还不错。（叶子本身是苦的我劝大家轻易不要尝试） 腌面我妹吃完。饭量这方面随便来个人都能吊打我我躺平任嘲。不过我沉迷画脸吃面的时候面都有点坨了。 本日我帮助两名小妹完成了基础拍粉底和简易眼影，画成什么样不重要，主要是我自己开心（不 有两三个月没有好好化过，我现在的化妆水平比之前更烂了，不过比烂要看跟谁比，你看我在这波群聚里一定是化的最好的一个。 午餐：没有哦从博物馆出来到动物园就三点多了没有餐馆营业也很正常 晚餐：串串 蛋糕对学校三号门门口的钢管厂小郡肝还心怀恐惧的我……一开始发现我们要吃这家还是很恐惧的，但是吃了就发现完全不一样嘛！辣锅味道也不算辣，就是很香，香菜牛肉和贡菜牛肉都好吃，贡菜以前我就吃过所以不像其他人那么惊诧（哼哼哼），不过作为纯素菜的时候肯定没有跟腌制的辣牛肉搭伴儿好吃嘛这还用说。猪皮是首次尝试，好恰。 凉虾真好吃啊！ 没错我们又吃了一回蛋糕，并且做作的拍照发朋友圈 嘻嘻。这次的蛋糕因为菜政的生日就在十月所以加上了庆祝她的生日，不过雷雷和狸狸明明也是主角却被关在了小书房吃饭。我竟然跟政委一样所有人都加了微信我看我可以谋划一下篡位的事情啦，不过在这之前我肯定要被湘鹅打一顿。不知道为什么，我把湘鹅的微信备注成了灰儿，并且在前段时间明明改过备注并有过PY交易的情况下还是觉得我没加过湘鹅微信……当时气氛就是尴尬，特别是我其实根本没有加过尘灰灰呢…… 另外虫网谁是cairuilin也还是个谜（我忘了备注对不起 10.3事件： 大足石刻不知道为啥订票的是湘，联系却写了我，毫无用处的我在沟通住址上只能做一个发鹅的传声筒。 人超级多我自闭大爆发……满心都是莫挨老子……但是人就是很多 据说我说了很多骚话，但是现在的我已经全都忘记了。 没颜色的那批石刻我只记得几个漂亮的观音，有颜色的那批印象还很深刻。 挖耳断手的刘居士是真的很硬核……我怀疑是很多恐怖小说的灵感来源，站在那片崖下面的时候我回想起了被灵异小说支配的初中年代，就很恐惧。地狱的景内容也很全，导游记这么多词真是辛苦了……（是柳不是刘 柳居士是从柳树瘿子里蹦出来的所以姓柳） 千手观音好看！金灿灿的830只手！ 倾斜的那几尊我老怕它们砸到我…… 农夫和牛那段导游讲的蛮有有意思的。 最后那个兽！可可爱爱。 早餐：饼干午餐：饭晚餐：杨记隆府在地铁上经历了几次失散，最后分批到达目的地的时候我被人流量惊呆了…… 解放碑人也太多了！ 这家比9.30那家要不辣很多，发鹅对这家评价不高…… 但我觉得很可以！不愧是小桌排了几百号的店，真是很照顾外地人的口味（阿政有话要说） 离开的时候还是坐地铁，地铁不知道几号线上沿着雅湘飞快熟悉起来的嘉陵江，风景特别好（阿左不这么觉得） 10.4事件：回家了早上一早切了阿政从兰州背来的瓜写了明信片之后我和左就出发去车站 早餐：午餐：晚餐：统统都是K记实在写不动了以后有空再补充吧 本次游记到此结束 PS: 小猫部分内容不足但我真的一滴也没有了！行程真的太满了小猫咪半夜踩奶我都昏迷着没有办法给出一点回应……湘鹅这个魔鬼。","link":"/2019/10/11/重庆/"}],"tags":[{"name":"笔记","slug":"笔记","link":"/tags/笔记/"},{"name":"cp日记","slug":"cp日记","link":"/tags/cp日记/"},{"name":"日记","slug":"日记","link":"/tags/日记/"},{"name":"考据","slug":"考据","link":"/tags/考据/"},{"name":"psycho pass","slug":"psycho-pass","link":"/tags/psycho-pass/"},{"name":"杂谈","slug":"杂谈","link":"/tags/杂谈/"},{"name":"茸米","slug":"茸米","link":"/tags/茸米/"},{"name":"赤红灯火妖魅行, 黑由","slug":"赤红灯火妖魅行-黑由","link":"/tags/赤红灯火妖魅行-黑由/"},{"name":"英耽","slug":"英耽","link":"/tags/英耽/"},{"name":"刀剑乱舞; 歌仙乙女","slug":"刀剑乱舞-歌仙乙女","link":"/tags/刀剑乱舞-歌仙乙女/"},{"name":"少女歌剧; 恋光","slug":"少女歌剧-恋光","link":"/tags/少女歌剧-恋光/"},{"name":"FGO","slug":"FGO","link":"/tags/FGO/"}],"categories":[{"name":"专业","slug":"专业","link":"/categories/专业/"},{"name":"生活","slug":"生活","link":"/categories/生活/"},{"name":"随笔","slug":"随笔","link":"/categories/随笔/"},{"name":"同人","slug":"同人","link":"/categories/同人/"},{"name":"翻译","slug":"翻译","link":"/categories/翻译/"}]}